Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/ClusteringAndEJBPassivation.po
Languages: fr_fr, it_it

source: Clustering and EJB Passivation
fr_fr: Mise en cluster et Mise en pause EJB
it_it: Clustering e passivazione EJB

source: Please note that this chapter is still being reviewed. Tread carefully.
fr_fr: Merci de noter que ce chapitre est toujours en en cours d'écriture. A manipuler avec précaussion.
it_it: Si noti che questo capitolo è ancora sotto revisione. Maneggiare con cura.

source: This chapter covers two distinct topics that happen share a common solution in Seam, (web) clustering and EJB passivation. Therefore, they are addressed together in this reference manual. Although performance tends to be grouped in this category as well, it's kept separate because the focus of this chapter is on the programming model and how it's affected by the use of the aforementioned features.
fr_fr: Ce chapitre couvre deux sujets discint qui heureusement partage une solution commun dans Seam , la mise en cluster (web) et la mise en pause EJB. Cependant, ils sont regroupés ensemble dans ce manuel de référence. Bien que la performance tende à être aussi regroupé dans cette catégorie, nous la conserverons à part cas le but de ce chapitre est le modèle de programmation et comment il est affecté par l'utilisation des fonctionalités susnommées.
it_it: Questo capitolo copre due distinti argomenti che condividono un soluzione comune in Seam, (web) clustering e passivazione EJB. Quindi, sono trattati assieme in questo manuale. Sebbene anche la performance tende ad essere raggruppata in questa categoria, essa viene mantenuta separata poiché il focus di questo capitolo è sul modello di programmazione e su come questo è influenzato dall'uso delle funzionalità sopracitate.

source: In this chapter you will learn how Seam manages the passivation of Seam components and entity instances, how to activate this feature, and how this feature is related to clustering. You will also learn how to deploy a Seam application into a cluster and verify that HTTP session replication is working properly. Let's start with a little background on clustering and see an example of how you deploy a Seam application to a JBoss AS cluster.
fr_fr: Dans ce chapitre vous allez apprendre comment Seam gère la mise en pause de composant de Seam et des instances entité, comment activer cette fonctionnalité et comment cette fonctionnalité est en liaison avec la mise en cluster. Vous devriez aussi apprendre comment déployer une application Seam dans un cluster et vérifier que la réplication de la session HTTP fonctione correctement. Commençons par un peu de généralités sur la mise en cluster et voyons un exemple de comment vous allez déployer une application Seam dans un cluster JBoss AS.
it_it: In questo capitolo si apprenderà come Seam gestisce la passivazione dei componenti Seam e degli entity, come attivare questa funzionalità e come questa funzionalità è collegata al clustering. Inoltre si apprenderà come eseguire il deploy di un'applicazione Seam in un cluster e verificare che la replica della sessione HTTP funzioni correttamente. Iniziamo con un pò di background sul clustering e vediamo come fare il deploy di un'applicazione Seam in un cluster JBoss AS.

source: Clustering
fr_fr: Mise en cluster

source: Clustering (more formally web clustering) allows an application to run on two or more parallel servers (i.e., nodes) while providing a uniform view of the application to clients. Load is distributed across the servers in such a way that if one or more of the servers fails, the application is still accessible via any of the surviving nodes. This topology is crucial for building scalable enterprise applications as performance and availability can be improved simply by adding nodes. But it brings up an important question. <emphasis>What happens to the state that was on the server that failed?</emphasis>
fr_fr: La mise en cluster (plus formellement la mise en cluster pour le web) permet à une application de s'exécuter sur deux serveurs ou plus en parallèle (autrement dit des noeuds) tout en fournissant une vue uniforme de l'application aux clients. La charge est distrbué au travers des serveurs de façon que si un ou plusieurs de ces serrveurs tombent, l'application reste accéssible via les noeuds survivants. Cette topologie est crucial pour la construction d'une application d'entreprise évolutif et avec une disponibilité qui peut être amméliorer en ajoutant simplement des noeuds. Mais cela amène une question importante. <emphasis>Qu'arrive t'il à l'état qui était sur le serveur qui est tombé?</emphasis>
it_it: Il clustering (più formalmente web clustering) consente ad un'applicazione di girare su due o più server paralleli (cioè, nodi) mentre viene fornita ai client una vista uniforme dell'applicazione. Il carico è distribuito sui server in modo tale che se uno o più server fallisce, l'applicazione continua ad essere accessibile tramite gli altri nodi. Questa tipologia è cruciale per la costruzione di applicazioni enterprise scalabili in performance e la disponibilità può essere migliorata semplicemente aggiungendo nodi. Ma si giunge ad una domanda importante. <emphasis>Cosa succede allo stato presente su un server che ha fallito?</emphasis>

source: Since day one, Seam has always provided support for stateful applications running in a cluster. Up to this point, you have learned that Seam provides state management in the form of additional scopes and by governing the life cycle of stateful (scoped) components. But state management in Seam goes beyond creating, storing and destroying instances. Seam tracks changes to JavaBean components and stores the changes at strategic points during the request so that the changes can be restored when the request shifts to a secondary node in the cluster. Fortunately, monitoring and replication of stateful EJB components is already handled by the EJB server, so this feature of Seam is intended to put stateful JavaBeans on par with their EJB cohorts.
fr_fr: Depuis le jour un, Seam a toujours fourni un support pour les applications avec état s'exécutant sur un cluster. En partant de ce point, vous avez appris que Seam fournissait un gestionnaire d'état de la forme d'étendues additionnelles et en controlant le cycle de vie des composants (d'étendue) avec état. Mais le gestionnaire d'état de Seam va plus loin que la création, le stockage et la destructions des instances. Seam surveillle les modificaitions des composants JavaBean et stocke leurs modification aux moments stratégiques pendant la requète pour ainsi faire que les modifications soient restorées quand la requète bascule dans un noeud secondaire du cluster. Heureusement, la supervision et la replication des composants EJB avec état est déjà géré par le serveur EJB, donc cette fonctionnalité de Seam est d'essayer de mettre le JavaBeans avec état actif avec sa cohorte d'EJB.
it_it: Sin dal primo giorno Seam ha sempre fornito il supporto alle applicazioni stateful in azione dentro un cluster. Fino ad ora si è appreso che Seam fornisce la gestione dello stato aggiungendo degli scope e governando il ciclo di vita dei componenti stateful (con scope). Ma la gestione dello stato in Seam va oltre alla creazione, memorizzazione e distruzione di istanze. Seam traccia i cambiamenti ai componenti JavaBean e memorizza i cambiamenti in punti strategici durante la richiesta, affinché i cambiamenti vengano ripristinati quando la richiesta passa su un nodo secondario del cluster. Fortunatamente il monitoraggio e la replica di componenti EJB stateful viene già gestita dal server EJB, quindi tale funzionalità di Seam serve per mettere i JavaBean a fianco dei suoi compagni EJB.

source: But wait, there's more! Seam also offers an incredibly unique feature for clustered applications. In addition to monitoring JavaBean components, Seam ensures that managed entity instances (i.e. JPA and Hibernate entities) don't become detached during replication. Seam keeps a record of the entities that are loaded and automatically loads them on the secondary node. You must, however, be using a Seam-managed persistence context to get this feature. More in depth information about this feature is provided in the second half of this chapter.
fr_fr: Mais attendez, il y a mieux! Seam offre aussi une fonctionnalité merveilleuse et unique pour les applications avec mise en cluster. En plus de la suppervision des composants JavaBeans, Seam s'assure que les instances d'entité gérées (autrement dit les entités Hibernate et JPA) ne deviennent pas détachées pendant la réplication. Seam conserve un enregistrement des entités qui ont été chargées et les charge automatiquement sur un noeud secondaire. Vous devez, cependant, utiliser le contexte de persistance géré par Seam pour avoir cette fonctionnalité. Plus en détails sur cette fonctionnalité est fournis dans la seconde partie de ce chapitre.
it_it: Ma attenzione, c'è di più! Seam offre anche un'incredibile ed unica caratteristica per le applicazioni cluster. In aggiunta al monitoraggio dei componenti JavaBean, Seam assicura che le istanze entity gestite (cioè entity JPA e Hibernate) non divengano detached durante la replica. Seam mantiene un record di entity caricati e li carica automaticamente nel nodo secondario. Occorre comunque usare un contesto di persistenza gestito da Seam per avere questa funzionalità. Maggiori e più dettagliate informazioni su questa funzionalità vengono fornite nella seconda parte del capitolo.

source: Now that you understand what features Seam offers to support a clustered environment, let's look at how you program for clustering.
fr_fr: Maintenant que vous comprenez que ces fonctionnalités que Seam offre qui support un environnement mise en cluster, allons voir commennt votre programme est mis en cluster.
it_it: Ora che si è capito quali funzionalità offre Seam per supportare l'ambiente clustered, guardiamo come si programma un cluster.

source: Programming for clustering
fr_fr: La programmation pour la mise en cluster
it_it: Programmare il clustering

source: Any session- or conversation-scoped mutable JavaBean component that will be used in a clustered environment must implement the <literal>org.jboss.seam.core.Mutable</literal> interface from the Seam API. As part of the contract, the component must maintain a dirty flag that is reported and reset by the <literal>clearDirty()</literal> method. Seam calls this method to determine if it is necessary to replicate the component. This avoids having to use the more cumbersome Servlet API to add and remove the session attribute on every change of the object.
fr_fr: Toute session- ou composant JavaBean mutable d'étendue conversationnel qui sera utilisé dans un environnement clusturisé doit implémenter l'interface <literal>org.jboss.seam.core.Mutable</literal> de l'API de Seam. Un partie du contrat est que le composant doit maintenir un drapeau sale qui est retourné et réinitialisé par la méthode <literal>clearDirty()</literal>. Seam peut appeler cette méthode pour déterminer s'il est nécéssaire de repliquer le composant. Cela évite d'avoir à utiliser l'API Servlet emcombrante pour ajouter et retirer l'attribut de session à chaque modification sur l'objet.
it_it: Un componente JavaBean mutabile con scope sessione o conversazione che verrà usato in un ambiente clustered deve implementare l'interfaccia <literal>org.jboss.seam.core.Mutable</literal> dell'API Seam. Come parte del contratto, il contratto deve mantenere un dirty flag che viene segnato e resettato dal metodo <literal>clearDirty()</literal>. Seam chiama questo metodo per determinare se è necessario replicare il componente. Questo evita di dover usare la più problematica API dei Servlet per aggiungere e rimuovere l'attributo sessione ad ogni cambiamento dell'oggetto.

source: You also must ensure that all session- and conversation-scoped JavaBean components are Serializable. Additional, all fields of a stateful component (EJB or JavaBean) must Serializable unless the field is marked transient or set to null in a <literal>@PrePassivate</literal> method. You can restore the value of a transient or nullified field in a <literal>@PostActivate</literal> method.
fr_fr: Vous devez aussi vous assurer que toutes les sessions - et les composants JavaBean d'étendue conversationnel sont sérialisable. De plus, tous les champs d'un composant avec état (EJB ou JavaBean) doit être sérialisable à moins que le champ ne soit marqué comme transient ou mit à null dans une méthode <literal>@PrePassivate</literal> . Vous pouvez restorer la velerur d'un transient ou d'un champs mis à null dans une méthode <literal>@PostActivate</literal>.
it_it: Bisogna assicurarsi che tutti i componenti JavaBean con scope sessione e conversazione siano Serializable. Inoltre tutti i campi di un componente stateful (EJB o JavaBean) devono essere Serializable amenoché siano marcati come transient o impostati a null in un metodo <literal>@PrePassivate</literal>. Si può ripristinare il valore di un campo transient o null in un metodo <literal>@PostActivate</literal>.

source: One area where people often get bitten is by using <literal>List.subList</literal> to create a list. The resulting list is not Serializable. So watch out for situations like that. If hit a <literal>java.io.NotSerializableException</literal> and cannot locate the culprit at first glance, you can put a breakpoint on this exception, run the application server in debug mode and attach a debugger (such as Eclipse) to see what deserialization is choking on.
fr_fr: Un endroit où les gens sont souvent bloqués est en utilisant <literal>List.subList</literal> pour créer une liste. La liste résultante n'est pas Sérialisable. Donc évitez les situations comme celle ci. Si vous avez une <literal>java.io.NotSerializableException</literal> et ne pouvez localiser le coupable au premier abord, vous pouvez mettre un point d'arrêt sur cette exception, exécutez le serveur d'application en mode débogage et y attacher un debogbeur (comme ave Eclipse) pour voir où la désérialisation s'étouffe.
it_it: Un'area in cui spesso le persone hanno problemi è con l'uso di <literal>List.subList</literal> per creare una lista. La lista risultante non è Serializable. Quindi attenzione a queste situazioni. Se ci si imbatte in una <literal>java.io.NotSerializableException</literal> e non si riescead individuare subito il colpevole, si può mettere un breakpoint su quest'eccezione, avviare l'application server in modalità debug ed attaccare il debugger (come in Eclipse) per vedere quale deserializzazione causa il problema.

source: Please note that clustering does not work with hot deployable components. But then again, you shouldn't be using hot deployable components in a non-development environment anyway.
fr_fr: Merci de noter que la mise en cluster ne fonctionne pas avec les composants deployables à chaud. Mais pour rappel, vous ne devriez jamais utiliser les composants déployables à chaud dans un environnement de non-développement.
it_it: Si noti che il clustering non funziona con componenti hot deployable. Ma comunque non si dovrebbero usare i componenti hot deployable in un ambiente non di sviluppo.

source: Deploying a Seam application to a JBoss AS cluster with session replication
fr_fr: Le déploiement d'une application Seam dans un cluster de JBoss AS avec la réplication de session
it_it: Deploy di un'applicazione Seam in un cluster JBoss AS con replica di sessione

source: The procedure outlined in this tutorial has been validated with an seam-gen application and the Seam booking example.
fr_fr: La procédure mise en avant dans ce tutoriel a été validé avec une appllication seam-gen et avec l'exemple de la réservation d'hotel de Seam
it_it: Questa procedura descritta nel tutorial è stata validata con un'applicazione seam-gen e nell'esempio Prenotazione.

source: In the tutorial, I assume that the IP addresses of the master and slave servers are 192.168.1.2 and 192.168.1.3, respectively. I am intentionally not using the mod_jk load balancer so that it's easier to validate that both nodes are responding to requests and can share sessions.
fr_fr: Dans ce tutoriel, je suppose que l'adresse IP du maitre et de l'esclave sont respectivement 192.168.1.2 et 192.168.1.3. J'ai intentionnellement refusé d'utiliser le gestionnaire de charge mod_jk pour rendre plus facile la validation des deux noeuds qui vont répondre aux requêtes et partager les sessions.
it_it: In questo tutorial si assume che gli indirizzi IP dei server master e slave siano rispettivamente 192.168.1.2 e 192.168.1.3. Intenzionalmente non viene usato il bilanciatore di carico mod_jk, quindi è più facile validate che entrambi i nodi stiano rispondendo alle richieste e possano condividere le sessioni.

source: I'm using the farm deployment method in these instructions, though you could also deploy the application normally and allow the two servers to negotiate a master/slave relationship based on startup order.
fr_fr: Je vais utiliserr la méthode de déploiement pour une ferme dans ces instructions, en pensant que vous pourriez aussi déployer normallement l'application et permettre aux deux serveur de négocier une relation maitre/esclave basé sur l'odre de démarrage.
it_it: In queste istruzioni si sta usando il metodo di sviluppo farm, sebbene si possa fare normalmente il deploy dell'applicazione e consentire ai due server di negoziare una relazione master/slave basata sull'ordine di avvio.

source: JBoss AS clustering relies on UDP multicasting provided by jGroups. The SELinux configuration that ships with RHEL/Fedora blocks these packets by default. You can allow them to pass by modifying the iptables rules (as root). The following commands apply to an IP address that matches 192.168.1.x.
fr_fr: La mise en cluster de JBoss AS se fait avec le multicasting UDP fournis par jGroups. La configuration SELinux qui est livrée par RHEL/Fedora bloque ces paquets par défaut. Vous devez autoriser leur passage en modificaiton les règles des iptables (en root). Les commandes suivantes s'appliquent à l'IP adresse suivante 192.168.1.x.
it_it: JBoss AS clustering si basa sul multicasting UDP fornito da jGroups. La configurazione SELinux che è inclusa in RHEL/Fedora di default blocca questi pacchetti. Si può consentire di lasciarli passare modificando le regole iptables (come root). I seguenti comandi si applicano ad un indirizzo IP che corrisponde a 192.168.1.x.

source: Detailed information can be found on <ulink url="http://www.jboss.org/community/docs/DOC-11935">this page</ulink> on the JBoss Wiki.
fr_fr: Des informations détaillés peuvent être trouvées sur <ulink url="http://www.jboss.org/community/docs/DOC-11935">cette page</ulink> sur le Wiki de JBoss.
it_it: Maggiori dettagli possono essere trovati nella <ulink url="http://www.jboss.org/community/docs/DOC-11935">pagina</ulink> del JBoss Wiki.

source: Create two instances of JBoss AS (just extract the zip twice)
fr_fr: La création de deux instances de JBoss AS (extraction du fichier zip simplement à faire deux fois)
it_it: Creare due istanze di JBoss AS (estrarre lo zip due volte)

source: Deploy the JDBC driver to server/all/lib/ on both instances if not using HSQLDB
fr_fr: Deploiement du pilote JDBC dans le serveur /all/lib sur les deux instances en cas de non-utilisation de HSQLDB
it_it: Fare il deploy del driver JDBC in server/all/lib/ su entrambe le istanze se non si usa HSQLDB

source: Add <literal>&lt;distributable/></literal> as the first child element in WEB-INF/web.xml
fr_fr: Ajout d'un <literal>&lt;distributable/&gt;</literal> comme premier élément fils dans WEB-INF/web.xml
it_it: Aggiungere <literal>&lt;distributable/></literal> come primo elemento figlio in WEB-INF/web.xml

source: Set the <literal>distributable</literal> property on <literal>org.jboss.seam.core.init</literal> to true to enable the ManagedEntityInterceptor (i.e., <literal><![CDATA[<core:init distributable="true"/>]]></literal>)
fr_fr: Définir la propriété <literal>distributable</literal> de <literal>org.jboss.seam.core.init</literal> à vrai pour activer le ManagedEntityInterceptor (autrement dit, <literal><![CDATA[<core:init distributable="true"/>]]></literal>)
it_it: Impostare la proprietà <literal>distributable</literal> su <literal>org.jboss.seam.core.init</literal> a true per abilitare il ManagedEntityInterceptor (cioè, <literal><![CDATA[<core:init distributable="true"/>]]></literal>)

source: Ensure you have two IP addresses available (two computers, two network cards, or two IP addressses bound to the same interface). I'll assume the two IP address are 192.168.1.2 and 192.168.1.3
fr_fr: Assurrer vous d'avoir deux adresses IP disponible (deux ordinateurs, deux cartes réseau ou deux adresses IP liées sur le même interface). Je pars du principe que les deux adresses IP sont 192.168.1.2 et 192.168.1.3
it_it: Assicurarsi di avere disponibili due indirizzi IP (due computer, due schede di rete oppure due indirizzi IP sulla stessa interfaccia). Si assume che i due indirizzi IP siano 192.168.1.2 e 192.168.1.3

source: Start the master JBoss AS instance on the first IP
fr_fr: Démarrer l'instance maitre de JBoss AS sur la première IP.
it_it: Avviare l'istanza master di JBoss AS sul primo IP

source: The log should report that there are 1 cluster members and 0 other members.
fr_fr: Le fichier de log doit montrer qu'il y a 1 membre du cluster et 0 autre membre.
it_it: Il log dovrebbe riportare che c'è 1 membro cluster e 0 altri membri.

source: Verify that the server/all/farm directory is empty in the slave JBoss AS instance
fr_fr: Vérifieez que le dossier du serveur /all/farm est vide dans l'instance esclave de JBoss AS.
it_it: Verificare che la directory server/all/farm sia vuota nell'istanza slave di JBoss AS

source: Start the slave JBoss AS instance on the second IP
fr_fr: Démarrez l'instance esclave de JBoss AS sur la seconde IP.
it_it: Avviare l'istanza slave di JBoss AS sul secondo IP

source: The log should report that there are 2 cluster members and 1 other members. It should also show the state being retrieved from the master.
fr_fr: Le log devrait afficher qu'il y a 2 membres du cluster et 1 autre membre. Il devrait aussi montrer que l'état a été récupéré depuis le maitre.
it_it: Il log dovrebbe riportare che ci sono 2 membri cluster e 1 altro membro. Dovrebbe anche mostrare che lo stato viene recuperato dal master.

source: Deploy the -ds.xml to server/all/farm of the master instance
fr_fr: Déployer le -ds.xml dans le serveur /all.farm sur l'instance maitre
it_it: Fare il deploy di -ds.xml in server/all/farm dell'istanza master

source: In the log of the master you should see acknowledgement of the deployment. In the log of the slave you should see a corresponding message acknowledging the deployment to the slave.
fr_fr: Dans le log du maitre vous devriez voir l'acquitement du déploiement. Dans le log de l'esclave vous devriez voir un message correspondant à l'acquitement du déploiement vers l'esclave.
it_it: Nel log del master si dovrebbe vedere l'acknowledgement del deploy. Nel log dello slave si dovrebbe vedere il corrispondente messaggio di acknowledgement del deploy per lo slave.

source: Deploy the application to the server/all/farm directory
fr_fr: Déployer l'application dans le dossier du server /all/farm
it_it: Fare il deploy dell'applicazione nella directory server/all/farm
