Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Components.po
Languages: it_it, ja_jp

source: <literal>themeSelector.themes</literal> &#8212; a list of <literal>SelectItem</literal>s representing the defined themes.
it_it: <literal>themeSelector.themes</literal> &#8212; una lista di <literal>SelectItem</literal> che rappresentano il temi definiti.
ja_jp: <literal>themeSelector.themes</literal> &#8212; 定義されたテーマを表している <literal>SelectItem</literal> の一覧です。

source: <literal>themeSelector.cookieEnabled</literal> &#8212; specifies that the theme selection should be persisted via a cookie.
it_it: <literal>themeSelector.cookieEnabled</literal> &#8212; specifica che la selezione del tema sia memorizzata in un cookie.
ja_jp: <literal>themeSelector.cookieEnabled</literal> &#8212; テーマ選択がクッキーで永続化されることを指定します。

source: A map containing theme entries.
it_it: Una mappa contenente delle entry di temi.
ja_jp: テーマエントリを含んでいるマップです。

source: Components for controlling conversations
it_it: Componenti per il controllo delle conversazioni.
ja_jp: 対話を制御するためのコンポーネント

source: The next group of components allow control of conversations by the application or user interface.
it_it: Il prossimo gruppo di componenti consente il controllo delle conversazioni da parte dell'applicazione o dell'interfaccia utente.
ja_jp: 次のコンポーネントグループを使うとアプリケーションまたはユーザーインタフェースにより対話の制御を行うことができるようになります。

source: API for application control of attributes of the current Seam conversation.
it_it: API per il controllo dell'applicazione degli attributi della conversazione di Seam.
ja_jp: 現在の Seam 対話の属性をアプリケーション制御するための API です。

source: <literal>getId()</literal> &#8212; returns the current conversation id
it_it: <literal>getId()</literal> &#8212; restituisce l'id della conversazione corrente
ja_jp: <literal>getId()</literal> &#8212; 現在の対話 ID を返します。

source: <literal>isNested()</literal> &#8212; is the current conversation a nested conversation?
it_it: <literal>isNested()</literal> &#8212; l'attuale conversazione è una conversazione annidata?
ja_jp: <literal>isNested()</literal> &#8212; 現在の対話はネストされている対話ですか?

source: <literal>isLongRunning()</literal> &#8212; is the current conversation a long-running conversation?
it_it: <literal>isLongRunning()</literal> &#8212; l'attuale conversazione è una conversazione long-running?
ja_jp: <literal>isLongRunning()</literal> &#8212; 現在の対話は長期実行の対話ですか?

source: <literal>getParentId()</literal> &#8212; returns the conversation id of the parent conversation
it_it: <literal>getParentId()</literal> &#8212; restituisce l'id della conversazione padre
ja_jp: <literal>getParentId()</literal> &#8212; 親対話の ID を返します。

source: <literal>getRootId()</literal> &#8212; returns the conversation id of the root conversation
it_it: <literal>getRootId()</literal> &#8212; restituisce l'id della conversazione radice
ja_jp: <literal>getRootId()</literal> &#8212; ルート対話の ID を返します。

source: <literal>setTimeout(int timeout)</literal> &#8212; sets the timeout for the current conversation
it_it: <literal>setTimeout(int timeout)</literal> &#8212; imposta il timeout della conversazione attuale
ja_jp: <literal>setTimeout(int timeout)</literal> &#8212; 現在の対話のタイムアウトをセットします。

source: <literal>setViewId(String outcome)</literal> &#8212; sets the view id to be used when switching back to the current conversation from the conversation switcher, conversation list, or breadcrumbs.
it_it: <literal>setViewId(String outcome)</literal> &#8212; imposta l'id della vista da usare quando si torna alla conversazione corrente dallo switcher di conversazione, dalla lista di conversazioni o dai breadcrumbs.
ja_jp: <literal>setViewId(String outcome)</literal> &#8212; 対話スイッチャー、 対話リストまたはブレッドクラムから現在の対話に切り替えて戻した場合に使用する ビュー ID をセットします。

source: <literal>setDescription(String description)</literal> &#8212; sets the description of the current conversation to be displayed in the conversation switcher, conversation list, or breadcrumbs.
it_it: <literal>setDescription(String description)</literal> &#8212; imposta la descrizione della conversazione corrente da mostrare nello switcher di conversazione, nella lista di conversazioni o nel breadcrumbs.
ja_jp: <literal>setDescription(String description)</literal> &#8212; 対話スイッチャー、 対話リストまたはブレッドクラムで表示される現在の対話の詳細をセットします。

source: <literal>redirect()</literal> &#8212; redirect to the last well-defined view id for this conversation (useful after login challenges).
it_it: <literal>redirect()</literal> &#8212; redirige all'ultimo view-id ben-definito per questa conversazione (utile dopo i login).
ja_jp: <literal>redirect()</literal> &#8212; この対話用に明確に定義された最後のビュー ID にリダイレクトします (ログインのチャレンジ後に便利)。

source: <literal>leave()</literal> &#8212; exit the scope of this conversation, without actually ending the conversation.
it_it: <literal>leave()</literal> &#8212; esce dallo scope di questa conversazione, senza terminare la conversazione.
ja_jp: <literal>leave()</literal> &#8212; 実際には対話を終了せずにこの対話のスコープを終了します。

source: <literal>begin()</literal> &#8212; begin a long-running conversation (equivalent to <literal>@Begin</literal>).
it_it: <literal>begin()</literal> &#8212; inizia una conversazione long-running (equivalente a <literal>@Begin</literal>).
ja_jp: <literal>begin()</literal> &#8212; 長期実行の対話を開始します (<literal>@Begin</literal> と同等)。

source: <literal>beginPageflow(String pageflowName)</literal> &#8212; begin a long-running conversation with a pageflow (equivalent to <literal>@Begin(pageflow="...")</literal>).
it_it: <literal>beginPageflow(String pageflowName)</literal> &#8212; inizia una conversazione long-running con un pageflow (equivalente a <literal>@Begin(pageflow="...")</literal>).
ja_jp: <literal>beginPageflow(String pageflowName)</literal> &#8212; ページフローを付けて長期実行の対話を開始します (<literal>@Begin(pageflow="...")</literal> と同等)。

source: <literal>end()</literal> &#8212; end a long-running conversation (equivalent to <literal>@End</literal>).
it_it: <literal>end()</literal> &#8212; termina una conversazione long-running (equivalente a <literal>@End</literal>).
ja_jp: <literal>end()</literal> &#8212; 長期実行の対話を終了します (<literal>@End</literal> と同等)。

source: <literal>pop()</literal> &#8212; pop the conversation stack, returning to the parent conversation.
it_it: <literal>pop()</literal> &#8212; estrae dallo stack di conversazione, restituendo la conversazione padre.
ja_jp: <literal>pop()</literal> &#8212; 対話スタックをポップして親対話に戻ります。

source: <literal>root()</literal> &#8212; return to the root conversation of the conversation stack.
it_it: <literal>root()</literal> &#8212; ritorna la conversazione root dello stack di conversazioni.
ja_jp: <literal>root()</literal> &#8212; 対話スタックのルート対話に戻ります。

source: <literal>changeFlushMode(FlushModeType flushMode)</literal> &#8212; change the flush mode of the conversation.
it_it: <literal>changeFlushMode(FlushModeType flushMode)</literal> &#8212; cambia la modalità flush della conversazione.
ja_jp: <literal>changeFlushMode(FlushModeType flushMode)</literal> &#8212; 対話のフラッシュモードを変更します。

source: Manager component for the conversation list.
it_it: Componente gestore per la lista delle conversazioni.
ja_jp: 対話一覧の管理コンポーネントです。

source: Manager component for the conversation stack (breadcrumbs).
it_it: Componente gestore per lo stack delle conversazioni (breadcrumbs).
ja_jp: 対話スタックの管理コンポーネントです (breadcrumbs)。

source: The conversation switcher.
it_it: Lo switcher di conversazione.
ja_jp: conversation switcher です。

source: jBPM-related components
it_it: Componenti per jBPM
ja_jp: jBPM 関連のコンポーネント

source: These components are for use with jBPM.
it_it: Questi componenti sono usati con jBPM.
ja_jp: jBPM と併用するコンポーネントになります。

source: API control of Seam pageflows.
it_it: Controllo API dei pageflow di Seam.
ja_jp: Seam ページフローの API 制御です。

source: <literal>isInProcess()</literal> &#8212; returns <literal>true</literal> if there is currently a pageflow in process
it_it: <literal>isInProcess()</literal> &#8212; ritorna <literal>true</literal> se c'è un pageflow nel processo
ja_jp: <literal>isInProcess()</literal> &#8212; 現在プロセス中のページフローがある場合に <literal>true</literal> を返します。

source: <literal>getProcessInstance()</literal> &#8212; returns jBPM <literal>ProcessInstance</literal> for the current pageflow
it_it: <literal>getProcessInstance()</literal> &#8212; restituisce una <literal>ProcessInstance</literal> jBPM per il pageflow corrente
ja_jp: <literal>getProcessInstance()</literal> &#8212; 現在のページフローの jBPM <literal>ProcessInstance</literal> を返します。

source: <literal>begin(String pageflowName)</literal> &#8212; begin a pageflow in the context of the current conversation
it_it: <literal>begin(String pageflowName)</literal> &#8212; inizia un pageflow nel contesto della conversazione corrente
ja_jp: <literal>begin(String pageflowName)</literal> &#8212; 現在の対話のコンテキスト内でページフローを開始します。

source: <literal>reposition(String nodeName)</literal> &#8212; reposition the current pageflow to a particular node
it_it: <literal>reposition(String nodeName)</literal> &#8212; riposiziona il pageflow corrente in un particolare nodo
ja_jp: <literal>reposition(String nodeName)</literal> &#8212; 現在のページフローを特定ノードに才配置します。

source: API for application control of attributes of the jBPM actor associated with the current session.
it_it: API per il controllo dell'applicazione degli attributi dell'attore jBPM associato alla sessione corrente.
ja_jp: 現在のセッションに関する jBPM actor の属性をアプリケーション制御するための API です。

source: <literal>setId(String actorId)</literal> &#8212; sets the jBPM actor id of the current user.
it_it: <literal>setId(String actorId)</literal> &#8212; imposta l'id dell'attore jBPM dell'utente corrente.
ja_jp: <literal>setId(String actorId)</literal> &#8212; 現在のユーザーの jBPM アクター ID をセットします。

source: <literal>getGroupActorIds()</literal> &#8212; returns a <literal>Set</literal> to which jBPM actor ids for the current users groups may be added.
it_it: <literal>getGroupActorIds()</literal> &#8212; ritorna un <literal>Set</literal> a cui gli id degli attori jBPM per i gruppi degli utenti correnti possono essere aggiunti.
ja_jp: <literal>getGroupActorIds()</literal> &#8212; 現在のユーザーグループ群用の jBPM アクター ID が追加可能なものに <literal>Set</literal> を返します。

source: API for application control of the jBPM transition for the current task.
it_it: API per il controllo dell'applicazione della transizione jBPM per il task corrente.
ja_jp: 現在のタスクに対する jBPM 移行のアプリケーション制御を目的とする API です。

source: <literal>setName(String transitionName)</literal> &#8212; sets the jBPM transition name to be used when the current task is ended via <literal>@EndTask</literal>.
it_it: <literal>setName(String transitionName)</literal> &#8212; imposta il nome della transizione jBPM da usare quando il task corrente viene terminato tramite <literal>@EndTask</literal>.
ja_jp: <literal>setName(String transitionName)</literal> &#8212; 現在のタスクが <literal>@EndTask</literal> で終了される場合に使用する jBPM 遷移名をセットします。

source: API for programmatic control of the association between the conversation and business process.
it_it: API per il controllo programmatico dell'associazione tra la conversazione ed il processo di business.
ja_jp: 対話とビジネスプロセス間の関連性をプログラム制御するための API です。

source: <literal>businessProcess.taskId</literal> &#8212; the id of the task associated with the current conversation.
it_it: <literal>businessProcess.taskId</literal> &#8212; l'id del task associato alla conversazione corrente.
ja_jp: <literal>businessProcess.taskId</literal> &#8212; 現在の対話に関連づけられたタスクの ID です。

source: <literal>businessProcess.processId</literal> &#8212; the id of the process associated with the current conversation.
it_it: <literal>businessProcess.processId</literal> &#8212; l'id del processo associato alla conversazione corrente.
ja_jp: <literal>businessProcess.processId</literal> &#8212; 現在の対話に関連づけられたプロセスの ID です。

source: <literal>businessProcess.hasCurrentTask()</literal> &#8212; is a task instance associated with the current conversation?
it_it: <literal>businessProcess.hasCurrentTask()</literal> &#8212; l'istanza del task è associata alla conversazione corrente?
ja_jp: <literal>businessProcess.hasCurrentTask()</literal> &#8212; 現在の対話に関連づけられたタスクインスタンスですか?

source: <literal>businessProcess.hasCurrentProcess()</literal> &#8212; is a process instance associated with the current conversation.
it_it: <literal>businessProcess.hasCurrentProcess()</literal> &#8212; l'istanza del processo è associata alla conversazione corrente?
ja_jp: <literal>businessProcess.hasCurrentProcess()</literal> &#8212; 現在の対話に関連づけられたプロセスインスタンスです。

source: <literal>createProcess(String name)</literal> &#8212; create an instance of the named process definition and associate it with the current conversation.
it_it: <literal>createProcess(String name)</literal> &#8212; crea un'istanza della definizione del processo (con nome) e l'associa alla conversazione corrente.
ja_jp: <literal>createProcess(String name)</literal> &#8212; 指定プロセス定義のインスタンスを作成し現在の対話に関連付けます。

source: <literal>startTask()</literal> &#8212; start the task associated with the current conversation.
it_it: <literal>startTask()</literal> &#8212; avvia il task associato alla conversazione corrente.
ja_jp: <literal>startTask()</literal> &#8212; 現在の対話に関連づけられたタスクを開始します。

source: <literal>endTask(String transitionName)</literal> &#8212; end the task associated with the current conversation.
it_it: <literal>endTask(String transitionName)</literal> &#8212; termina il task associato alla conversazione corrente.
ja_jp: <literal>endTask(String transitionName)</literal> &#8212; 現在の対話に関連づけられたタスクを終了します。

source: <literal>resumeTask(Long id)</literal> &#8212; associate the task with the given id with the current conversation.
it_it: <literal>resumeTask(Long id)</literal> &#8212; associa il task con l'id dato alla conversazione corrente.
ja_jp: <literal>resumeTask(Long id)</literal> &#8212; 特定の ID を持つタスクを現在の対話に関連付けます。

source: <literal>resumeProcess(Long id)</literal> &#8212; associate the process with the given id with the current conversation.
it_it: <literal>resumeProcess(Long id)</literal> &#8212; associa il processo con l'id dato alla conversazione corrente.
ja_jp: <literal>resumeProcess(Long id)</literal> &#8212; 特定の ID を持つプロセスを現在の対話に関連付けます。

source: <literal>transition(String transitionName)</literal> &#8212; trigger the transition.
it_it: <literal>transition(String transitionName)</literal> &#8212; avvia una transizione.
ja_jp: <literal>transition(String transitionName)</literal> &#8212; 遷移を引き起こします。

source: Manager component for the jBPM <literal>TaskInstance</literal>.
it_it: Componente gestore per la <literal>TaskInstance</literal> jBPM.
ja_jp: jBPM <literal>TaskInstance</literal> の管理コンポーネントです。

source: Manager component for the jBPM <literal>ProcessInstance</literal>.
it_it: Componente gestore per la <literal>ProcessInstance</literal> jBPM.
ja_jp: jBPM <literal>ProcessInstance</literal> の管理コンポーネントです。

source: Manager component for an event-scoped <literal>JbpmContext</literal>.
it_it: Componente gestore per il <literal>JbpmContext</literal> con scope evento.
ja_jp: イベントスコープ <literal>JbpmContext</literal> の管理コンポーネントです。

source: Manager component for the jBPM pooled task list.
it_it: Componente gestore per la lista di task pooled jBPM.
ja_jp: jBPM pooled task list の管理コンポーネントです。

source: Manager component for the jBPM task lists.
it_it: Componente gestore per la lista di task jBPM.
ja_jp: jBPM タスクリスト集の管理コンポーネントです。

source: Action handler for pooled task assignment.
it_it: Action handler per l'assegnamento del task pooled.
ja_jp: pooled task 割り当てのアクションハンドラです。

source: Manager for the process instance task list.
it_it: Manager per la lista di task delle istanze di processo.
ja_jp: プロセスインスタンスタスク一覧の管理機能です。

source: The process instance task list.
it_it: La lista dei task delle istanze di processo.
ja_jp: プロセスインスタンスのタスク一覧です。

source: All of these components are installed whenever the component <literal>org.jboss.seam.bpm.jbpm</literal> is installed.
it_it: Tutti questi componenti vengono installati quando viene installato il componente <literal>org.jboss.seam.bpm.jbpm</literal>.
ja_jp: <literal>org.jboss.seam.bpm.jbpm</literal> コンポーネントがインストールされるとこれらの全コンポーネントが常にインストールされます。

source: Security-related components
it_it: Componenti per la sicurezza
ja_jp: セキュリティ関連のコンポーネント

source: These components relate to web-tier security.
it_it: Questi componenti si relazionano alla sicurezza a livello web.
ja_jp: これらのコンポーネントはウェブ層のセキュリティに関連しています。

source: Manager component for the current user <literal>Principal</literal>.
it_it: Componente gestore per l'utente corrente <literal>Principal</literal>.
ja_jp: 現在のユーザー <literal>Principal</literal> の管理コンポーネントです。

source: Allows JSF pages to choose to render a control, depending upon the roles available to the current principal. <literal>&lt;h:commandButton value="edit" rendered="#{isUserInRole['admin']}"/&gt;</literal>.
it_it: Consente alla pagine JSF di scegliere di generare un controllo, dipendente dai ruoli disponibili al principal corrente. <literal>&lt;h:commandButton value="edit" rendered="#{isUserInRole['admin']}"/&gt;</literal>.
ja_jp: 現在のプリンシパルに使用可能なロールに応じて JSF ページがコントロールのレンダリングを選択できるようにします。 <literal>&lt;h:commandButton value="edit" rendered="#{isUserInRole['admin']}"/&gt;</literal>

source: JMS-related components
it_it: Componenti per JMS
ja_jp: JMS 関連のコンポーネント

source: These components are for use with managed <literal>TopicPublisher</literal>s and <literal>QueueSender</literal>s (see below).
it_it: Questi componenti sono per l'uso di <literal>TopicPublisher</literal> e <literal>QueueSender</literal> gestite (vedere sotto).
ja_jp: これらのコンポーネントは管理対象の <literal>TopicPublisher</literal> および <literal>QueueSender</literal> との併用を目的としています (下記参照)。

source: Manager component for a JMS <literal>QueueSession</literal> .
it_it: Componente gestore di una <literal>QueueSession</literal> JMS.
ja_jp: JMS <literal>QueueSession</literal> の管理コンポーネントです。

source: Manager component for a JMS <literal>TopicSession</literal> .
it_it: Componente gestore di una <literal>TopicSession</literal> JMS.
ja_jp: JMS <literal>TopicSession</literal> の管理コンポーネントです。

source: Mail-related components
it_it: Componenti relativi alla Mail
ja_jp: メール関連のコンポーネント

source: These components are for use with Seam's Email support
it_it: Questi componenti sono per l'uso del supporto email di Seam
ja_jp: Seam Email サポートと併用するコンポーネントになります。

source: Manager component for a JavaMail <literal>Session</literal>. The session can be either looked up in the JNDI context (by setting the <literal>sessionJndiName</literal> property) or it can created from the configuration options in which case the <literal>host</literal> is mandatory.
it_it: Componente gestore di una <literal>Session</literal> JavaMail. La sessione può essere o ricercata in un contesto JNDI (impostando la proprietà <literal>sessionJndiName</literal>) o creata dalle opzioni di configurazione nel qual caso è obbligatorio l'<literal>host</literal>.
ja_jp: JavaMail <literal>Session</literal> の管理コンポーネントです。 セッションを JNDI コンテキスト内で検索させるか (<literal>sessionJndiName</literal> プロパティを設定)、設定オプションから作成することができます。 後者の場合、 <literal>host</literal> は必須となります。

source: <literal>org.jboss.seam.mail.mailSession.host</literal> &#8212; the hostname of the SMTP server to use
it_it: <literal>org.jboss.seam.mail.mailSession.host</literal> &#8212; l'hostname del server SMTP da usare.
ja_jp: <literal>org.jboss.seam.mail.mailSession.host</literal> &#8212; 使用する SMTP サーバーのホスト名です。

source: <literal>org.jboss.seam.mail.mailSession.port</literal> &#8212; the port of the SMTP server to use
it_it: <literal>org.jboss.seam.mail.mailSession.port</literal> &#8212; la porta del server SMTP da usare.
ja_jp: <literal>org.jboss.seam.mail.mailSession.port</literal> &#8212; 使用する SMTP サーバーのポートです。

source: <literal>org.jboss.seam.mail.mailSession.username</literal> &#8212; the username to use to connect to the SMTP server.
it_it: <literal>org.jboss.seam.mail.mailSession.username</literal> &#8212; lo username da usare per connettersi al server SMTP.
ja_jp: <literal>org.jboss.seam.mail.mailSession.username</literal> &#8212; SMTP サーバーの接続に使用するユーザー−名です。

source: <literal>org.jboss.seam.mail.mailSession.password</literal> &#8212; the password to use to connect to the SMTP server
it_it: <literal>org.jboss.seam.mail.mailSession.password</literal> &#8212; la password da usare per connettersi al server SMTP.
ja_jp: <literal>org.jboss.seam.mail.mailSession.password</literal> &#8212; SMTP サーバーの接続に使用するパスワードです。

source: <literal>org.jboss.seam.mail.mailSession.debug</literal> &#8212; enable JavaMail debugging (very verbose)
it_it: <literal>org.jboss.seam.mail.mailSession.debug</literal> &#8212; abilita il debugging JavaMail (molto verboso).
ja_jp: <literal>org.jboss.seam.mail.mailSession.debug</literal> &#8212; JavaMail のデバッグ機能を有効にします (かなり冗長)。

source: <literal>org.jboss.seam.mail.mailSession.ssl</literal> &#8212; enable SSL connection to SMTP (will default to port 465)
it_it: <literal>org.jboss.seam.mail.mailSession.ssl</literal> &#8212; abilita la connessioneSSL all'SMTP (porta 465 di default).
ja_jp: <literal>org.jboss.seam.mail.mailSession.ssl</literal> &#8212; SMTP への SSL 接続を有効にします (デフォルトはポート465)。

source: <literal>org.jboss.seam.mail.mailSession.tls</literal> &#8212; by default true, enable TLS support in the mail session
it_it: <literal>org.jboss.seam.mail.mailSession.tls</literal> &#8212; di default è true, abilita il supporto TLS nella sessione mail.
ja_jp: <literal>org.jboss.seam.mail.mailSession.tls</literal> &#8212; デフォルトでは true です。 メールセッションで TLS サポートを有効にします。

source: <literal>org.jboss.seam.mail.mailSession.sessionJndiName</literal> &#8212; name under which a javax.mail.Session is bound to JNDI. If supplied, all other properties will be ignored.
it_it: <literal>org.jboss.seam.mail.mailSession.sessionJndiName</literal> &#8212; nome sotto cui una javax.mail.Session è legata a JNDI. Se fornito, tutte le proprietà verranno ignorate.
ja_jp: <literal>org.jboss.seam.mail.mailSession.sessionJndiName</literal> &#8212; JNDI にバインドされる javax.mail.Session と同じ名前です。 これを与えると他のプロパティはすべて無視されます。

source: Infrastructural components
it_it: Componenti infrastrutturali
ja_jp: 基盤となるコンポーネント

source: These components provide critical platform infrastructure. You can install a component which isn't installed by default by setting <literal>install="true"</literal> on the component in <literal>components.xml</literal>.
it_it: Questi componenti forniscono un'infrastruttura critica di piattaforma. Si può installare un componente che non è installato di default impostando <literal>install="true"</literal> nel componente in <literal>components.xml</literal>.
ja_jp: これらのコンポーネントは非常に重要なプラットフォームの基盤を提供します。 デフォルトではインストールされないコンポーネントは <literal>components.xml</literal> 内のそのコンポーネントで <literal>install="true"</literal> を設定するとインストールすることができます。

source: Initialization settings for Seam. Always installed.
it_it: Impostazioni di inizializzazione per Seam. Sempre installato.
ja_jp: Seam の初期化設定です。 常にインストールされます。

source: <literal>org.jboss.seam.core.init.jndiPattern</literal> &#8212; the JNDI pattern used for looking up session beans
it_it: <literal>org.jboss.seam.core.init.jndiPattern</literal> &#8212; il pattern JNDI usato per la ricerca dei bean di sessione
ja_jp: <literal>org.jboss.seam.core.init.jndiPattern</literal> &#8212; セッション Bean のルックアップに使用される JNDI パターンです。

source: <literal>org.jboss.seam.core.init.debug</literal> &#8212; enable Seam debug mode. This should be set to false when in production. You may see errors if the system is placed under any load and debug is enabled.
it_it: <literal>org.jboss.seam.core.init.debug</literal> &#8212; abilita la modalità di debug di Seam. Questo può essere impostato a false in produzione. Si possono vedere gli errori se il sistema è messo sotto carico ed il debug è abilitato.
ja_jp: <literal>org.jboss.seam.core.init.debug</literal> &#8212; Seam デバッグモードを有効にします。 実稼働では false にセットしてください。 デバッグが有効になっている状態でシステムになんらかの負荷がかかるとエラーが表示される場合があります。
