Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Components.po
Languages: it_it, ja_jp

source: Built-in Seam components
it_it: Componenti Seam predefiniti
ja_jp: 組み込み Seam コンポーネント

source: This chapter describes Seam's built-in components, and their configuration properties. The built-in components will be created even if they are not listed in your <literal>components.xml</literal> file, but if you need to override default properties or specify more than one component of a certain type, <literal>components.xml</literal> is used.
it_it: Questo capitolo descrive i componenti predefiniti di Seam e le loro proprietà di configurazione. I componenti predefiniti verranno creati anche se non sono elencati nel file <literal>components.xml</literal>, ma occorre fare l'override delle proprietà di default o specificare più di un compoenente di un certo tipo, viene usato <literal>components.xml</literal>.
ja_jp: 本章では Seam の組み込みコンポーネント、 その設定プロパティについて説明していきます。 組み込みコンポーネントは <literal>components.xml</literal> ファイルに記載がなくても作成されますが、 デフォルトのプロパティを上書きするまたは特定タイプの 1 つ以上のコンポーネントを指定する必要がある場合は <literal>components.xml</literal> を使用します。

source: Note that you can replace any of the built in components with your own implementations simply by specifying the name of one of the built in components on your own class using <literal>@Name</literal>.
it_it: Si noti che si puà sostituire uno dei componenti predefiniti con le proprie implementazioni semplicemente specificando il nome di uno dei componenti predefiniti nella propria classe usando <literal>@Name</literal>.
ja_jp: <literal>@Name</literal> を使って独自のクラスで組み込みコンポーネントの名前を指定すると、 組み込みコンポーネントを独自の実装に簡単に置き換えることができます。

source: Context injection components
it_it: Componenti per l'iniezione del contesto
ja_jp: コンテキストインジェクションのコンポーネント

source: The first set of built in components exist purely to support injection of various contextual objects. For example, the following component instance variable would have the Seam session context object injected:
it_it: Il primo set di componenti predefiniti esiste solamente per supportare l'injection di vari oggetti contestuali. Per esempio, la seguente variabile d'istanza di componente vedrebbe iniettato l'oggetto del contesto di sessione di Seam:
ja_jp: 最初の組み込みコンポーネントセットは、 単純にさまざまな文脈上のオブジェクトのインジェクトをサポートするために存在しています。 たとえば、 次のコンポーネントインスタンスの変数はインジェクトされた Seam セッションのコンテキストオブジェクトを持つことになります。

source: Component that provides access to Seam Context objects, for example <literal>org.jboss.seam.core.contexts.sessionContext['user']</literal>.
it_it: Componente che fornisce accesso agli oggetti del contesto di Seam, per esempio <literal>org.jboss.seam.core.contexts.sessionContext['user']</literal>.
ja_jp: Seam コンテキストのオブジェクトへのアクセスを提供します。 たとえば、 <literal>org.jboss.seam.core.contexts.sessionContext['user']</literal> など。

source: Manager component for the <literal>FacesContext</literal> context object (not a true Seam context)
it_it: Componente manager per l'oggetto del contesto <literal>FacesContext</literal> (non un vero contesto di Seam)
ja_jp: <literal>FacesContext</literal> コンテキストオブジェクト (正確には Seam コンテキストではない) の管理コンポーネント

source: All of these components are always installed.
it_it: Tutti questi componenti vengono sempre installati.
ja_jp: これらコンポーネントはすべて常にインストールされます。

source: JSF-related components
it_it: Componenti JSF

source: The following set of components are provided to supplement JSF.
it_it: Il seguente set di componenti è fornito come supplemento JSF.

source: Provides a default JSF converter for properties of type <literal>java.util.Date</literal>.
it_it: Fornisce un converter JSF di default per le proprietà di tipo <literal>java.util.Date</literal>.

source: This converter is automatically registered with JSF. It is provided to save a developer from having to specify a DateTimeConverter on an input field or page parameter. By default, it assumes the type to be a date (as opposed to a time or date plus time) and uses the short input style adjusted to the Locale of the user. For Locale.US, the input pattern is mm/DD/yy. However, to comply with Y2K, the year is changed from two digits to four (e.g., mm/DD/yyyy).
it_it: Questo converter è automaticamente registrato con JSF. E' fornito per risparmiare allo sviluppatore il dover specificare un DateTimeConverter su un campo d'input o su un parametro di pagina. Di default, si assume che il tipo sia una data (in opposto a tempo o tempo e data) ed usa lo stile d'input short corretto con il locale dell'utente. Per Locale.US, il pattern d'input è mm/DD/yy. Comunque in accordo con Y2K, l'anno è cambiato da due cifre a quattro (es. mm/DD/yyyy).

source: It's possible to override the input pattern globally using component configuration. Consult the JavaDoc for this class to see examples.
it_it: E' possibile eseguire l'override del pattern d'input in modo globale, usando la configurazione dei componenti. Per vedere alcuni esempi consultare la JavaDoc per questa classe.

source: Allows faces success messages to propagate across a browser redirect.
it_it: Consentono ai messaggi faces di successo di essere propagati lungo i redirect del browser.
ja_jp: ブラウザリダイレクト全体に伝播するよう faces が正しくメッセージングできるようにします。

source: <literal>add(FacesMessage facesMessage)</literal> &#8212; add a faces message, which will be displayed during the next render response phase that occurs in the current conversation.
it_it: <literal>add(FacesMessage facesMessage)</literal> &#8212; aggiunge un messaggio faces, che verrà mostrato durante la prossima fase di render response che avviene nella conversazione corrente.
ja_jp: <literal>add(FacesMessage facesMessage)</literal> &#8212; faces メッセージを追加します。 現在の対話内で発生する次の応答のレンダリングフェーズで表示されます。

source: <literal>add(String messageTemplate)</literal> &#8212; add a faces message, rendered from the given message template which may contain EL expressions.
it_it: <literal>add(String messageTemplate)</literal> &#8212; aggiunge un messaggio faces, generato dal template di messaggio che può contenere espressioni EL.
ja_jp: <literal>add(String messageTemplate)</literal> &#8212; faces メッセージを追加します。 EL 式を含むことができる特定のメッセージテンプレートからレンダリングされます。

source: <literal>add(Severity severity, String messageTemplate)</literal> &#8212; add a faces message, rendered from the given message template which may contain EL expressions.
it_it: <literal>add(Severity severity, String messageTemplate)</literal> &#8212; aggiunge un messaggio faces, generato dal template di messaggio che può contenere espressioni EL.
ja_jp: <literal>add(Severity severity, String messageTemplate)</literal> &#8212; faces メッセージを追加します。 EL 式を含むことができる特定のメッセージテンプレートからレンダリングされます。

source: <literal>addFromResourceBundle(String key)</literal> &#8212; add a faces message, rendered from a message template defined in the Seam resource bundle which may contain EL expressions.
it_it: <literal>addFromResourceBundle(String key)</literal> &#8212; aggiunge un messaggio faces, generato dal template di messaggio che può contenere espressioni EL.
ja_jp: <literal>addFromResourceBundle(String key)</literal> &#8212; faces メッセージを追加します。 EL 式を含むことができる Seam リソースバンドルで定義されたメッセージテンプレートからレンダリングされます。

source: <literal>addFromResourceBundle(Severity severity, String key)</literal> &#8212; add a faces message, rendered from a message template defined in the Seam resource bundle which may contain EL expressions.
it_it: <literal>addFromResourceBundle(Severity severity, String key)</literal> &#8212; aggiunge un messaggio faces, generato dal template di messaggio definito nel resource bundle di Seam e che può contenete espressioni EL.
ja_jp: <literal>addFromResourceBundle(Severity severity, String key)</literal> &#8212; faces メッセージを追加します。 EL 式を含むことができる Seam リソースバンドルで定義されたメッセージテンプレートからレンダリングされます。

source: <literal>clear()</literal> &#8212; clear all messages.
it_it: <literal>clear()</literal> &#8212; pulisce tutti i messaggi.
ja_jp: <literal>clear()</literal> &#8212; 全メッセージを消去します。

source: A convenient API for performing redirects with parameters (this is especially useful for bookmarkable search results screens).
it_it: Un'API per l'esecuzione dei redirect con parametri (utile specialmente per le schermate con risultati di ricerca memorizzabili come segnalibro).
ja_jp: パラメータつきでリダイレクトを行う場合に便利な API です (特にブックマーク可能な検索結果画面などに役立ちます)。

source: <literal>redirect.viewId</literal> &#8212; the JSF view id to redirect to.
it_it: <literal>redirect.viewId</literal> &#8212; l'id della vista JSF a cui fare il redirect.
ja_jp: <literal>redirect.viewId</literal> &#8212; リダイレクト先となる JSF ビュー ID です。

source: <literal>redirect.conversationPropagationEnabled</literal> &#8212; determines whether the conversation will propagate across the redirect.
it_it: <literal>redirect.conversationPropagationEnabled</literal> &#8212; determina se la conversazione verrà propagata assieme al redirect.
ja_jp: <literal>redirect.conversationPropagationEnabled</literal> &#8212; 対話をリダイレクト全体に伝播させるかどうか決定します。

source: <literal>redirect.parameters</literal> &#8212; a map of request parameter name to value, to be passed in the redirect request.
it_it: <literal>redirect.parameters</literal> &#8212; una mappa di nomi di parametri di richiesta da valorizzare, da passare alla richiesta di redirect.
ja_jp: <literal>redirect.parameters</literal> &#8212; 要求パラメータ名と値のマップです。 リダイレクト要求に渡されます。

source: <literal>execute()</literal> &#8212; perform the redirect immediately.
it_it: <literal>execute()</literal> &#8212; esegue immediatamente il redirect.
ja_jp: <literal>execute()</literal> &#8212; リダイレクトを直ちに実行します。

source: <literal>captureCurrentRequest()</literal> &#8212; stores the view id and request parameters of the current GET request (in the conversation context), for later use by calling <literal>execute()</literal>.
it_it: <literal>captureCurrentRequest()</literal> &#8212; memorizza l'id della vista ed i parametri di richiesta della richesta GET corrente (nel contesto conversazione), per poi essere usato chiamando <literal>execute()</literal>.
ja_jp: <literal>captureCurrentRequest()</literal> &#8212; 現在の GET 要求 (対話コンテキスト内) の要求パラメータとビュー ID を格納します。 <literal>execute()</literal> の呼び出しで使用されます。

source: A convenient API for sending HTTP errors.
it_it: Un'API per l'invio di errori HTTP.
ja_jp: HTTP エラーを送信する場合に便利な API です。

source: A component (session-scoped by default) responsible for maintaining a collection of render stamps. A render stamp is an indicator as to whether a form which was rendered has been submitted. This store is useful when the client-side state saving method of JSF is being used because it puts the determination of whether a form has been posted in the control of the server rather than in the component tree which is maintained on the client.
it_it: Un componente (di default con scope sessione) responsabile del mantenimento della collezione di stampe da renderizzare. Una stampa da renderizzare è un indicatore che mostra se una form renderizzata è stata inviata. Questa memorizzazione è utile quando viene il metodo JSF di salvataggio dello stato lato client, poiché determina se la form è stata mandata sotto il controllo del server anziché nell'albero dei componenti che viene mantenuto sul client.

source: To unbind this check from the session (which is one of the main design goals of client-side state saving) an implementation must be provided that stores the render stamps in the application (valid as long as the application is running) or the database (valid across server restarts).
it_it: Per disassociare questo check dalla sessione (che è uno dei principali obiettivi di design del salvataggio di stato lato client) deve essere fornita un'implementazione che memorizzi le stampe da renderizzare nell'applicazione (valida a lungo quanto l'esecuzione dell'applicazione) o il database (valido fino al riavvio del server).

source: <literal>maxSize</literal> &#8212; The maximum number of stamps to be kept in the store. Default: 100
it_it: <literal>maxSize</literal> &#8212; Il numero massimo di stampe da mantenere in memoria. Default: 100

source: These components are installed when the class <literal>javax.faces.context.FacesContext</literal> is available on the classpath.
it_it: Tutti questi componenti vengono installati quando la classe <literal>javax.faces.context.FacesContext</literal> è disponibile nel classpath.

source: Utility components
it_it: Componenti d'utilità
ja_jp: ユーティリティコンポーネント

source: These components are merely useful.
it_it: Questi componenti sono molto utili.
ja_jp: これらのコンポーネントが役に立つ機会はあまりありません。

source: An API for raising events that can be observed via <literal>@Observer</literal> methods, or method bindings in <literal>components.xml</literal>.
it_it: Un'API per sollevare eventi che possono essere osservati tramite i metodi <literal>@Observer</literal>, o binding di metodo in <literal>components.xml</literal>.
ja_jp: <literal>@Observer</literal> のメソッドまたは <literal>components.xml</literal> 内のメソッドバインディング経由で監視できるイベントを引き起こす API です。

source: <literal>raiseEvent(String type)</literal> &#8212; raise an event of a particular type and distribute to all observers.
it_it: <literal>raiseEvent(String type)</literal> &#8212; solleva un evento di un tipo particolare e lo distribuisce a tutti gli osservatori.
ja_jp: <literal>raiseEvent(String type)</literal> &#8212; 特定タイプのイベントを発生させてすべての監視者に配信します。

source: <literal>raiseAsynchronousEvent(String type)</literal> &#8212; raise an event to be processed asynchronously by the EJB3 timer service.
it_it: <literal>raiseAsynchronousEvent(String type)</literal> &#8212; solleva un evento da processare in modo asincrono da parte del servizio timer di EJB3.
ja_jp: <literal>raiseAsynchronousEvent(String type)</literal> &#8212; EJB3 タイマーサービスで非同期に処理されるイベントを発生させます。

source: <literal>raiseTimedEvent(String type, ....)</literal> &#8212; schedule an event to be processed asynchronously by the EJB3 timer service.
it_it: <literal>raiseTimedEvent(String type, ....)</literal> &#8212; schedula un evento da processare in modo asincrono dal servizio timer di EJB3.
ja_jp: <literal>raiseTimedEvent(String type, ....)</literal> &#8212; EJB3 タイマーサービスで非同期に処理されるイベントをスケジュールします。

source: <literal>addListener(String type, String methodBinding)</literal> &#8212; add an observer for a particular event type.
it_it: <literal>addListener(String type, String methodBinding)</literal> &#8212; aggiunge un observer per un particolare tipo di evento.
ja_jp: <literal>addListener(String type, String methodBinding)</literal> &#8212; 特定イベントタイプの監視者を追加します。

source: An API for interpolating the values of JSF EL expressions in Strings.
it_it: Un'API per interpolare i valori di espressioni EL JSF in String.
ja_jp: Strings に JFS EL 表現の値を補完するための API です。

source: <literal>interpolate(String template)</literal> &#8212; scan the template for JSF EL expressions of the form <literal>#{...}</literal> and replace them with their evaluated values.
it_it: <literal>interpolate(String template)</literal> &#8212; analizza il template per espressioni EL JSF della forma <literal>#{...}</literal> e li sostituisce con i loro valori valutati.
ja_jp: <literal>interpolate(String template)</literal> &#8212; <literal>#{...}</literal> 形式の JSF EL 式のテンプレートをスキャンしてその評価値に置換します。

source: An API for creating value and method bindings.
it_it: Un'API per creare binding di valore e di metodo.
ja_jp: 値とメソッドバインティングを作成するための API です。

source: <literal>createValueBinding(String expression)</literal> &#8212; create a value binding object.
it_it: <literal>createValueBinding(String expression)</literal> &#8212; crea un oggetto per il binding di valore.
ja_jp: <literal>createValueBinding(String expression)</literal> &#8212; 値バインディングオブジェクトを作成します。

source: <literal>createMethodBinding(String expression)</literal> &#8212; create a method binding object.
it_it: <literal>createMethodBinding(String expression)</literal> &#8212; crea un oggetto per il binding di metodo.
ja_jp: <literal>createMethodBinding(String expression)</literal> &#8212; メソッドバインディングオブジェクトを作成します。

source: Manager component for a JBoss Cache <literal>PojoCache</literal> instance.
it_it: Componente manager per un'istanza <literal>PojoCache</literal> di JBoss Cache.
ja_jp: JBoss Cache <literal>PojoCache</literal> インスタンスの管理コンポーネントです。

source: <literal>pojoCache.cfgResourceName</literal> &#8212; the name of the configuration file. Default to <literal>treecache.xml</literal>.
it_it: <literal>pojoCache.cfgResourceName</literal> &#8212; il nome del file di configurazione. Di default è <literal>treecache.xml</literal>.
ja_jp: <literal>pojoCache.cfgResourceName</literal> &#8212; 設定ファイル名です。 デフォルトでは <literal>treecache.xml</literal> に設定されます。

source: Components for internationalization and themes
it_it: Componenti per l'internazionalizzazione ed i temi
ja_jp: 国際化とテーマのコンポーネント

source: The next group of components make it easy to build internationalized user interfaces using Seam.
it_it: Il prossimo gruppo di componenti semplifica la costruzione di interfacce utente internazionalizzate usando Seam.
ja_jp: 次のコンポーネントグループは Seam を使用した国際化ユーザーインタフェースのビルドを容易にします。

source: The Seam locale.
it_it: Il locale di Seam.
ja_jp: Seam ロケールです。

source: The Seam timezone. The timezone is session scoped.
it_it: La timezone di Seam. La timezone ha scope di sessione.
ja_jp: Seam のタイムゾーンです。 タイムゾーンはセッションスコープです。

source: The Seam resource bundle. The resource bundle is stateless. The Seam resource bundle performs a depth-first search for keys in a list of Java resource bundles.
it_it: Il resource bundle di Seam. Il resource bundle è stateless. Il resource bundle di Seam esegue una ricerca delle chiavi in una lista di resource bundle di Java.
ja_jp: Seam リソースバンドルです。 リソースバンドルはステートレスになります。 Seam リソースバンドルは Java リソースバンドルの一覧内のキーの深さ優先検索を行います。

source: The resource loader provides access to application resources and resource bundles.
it_it: Il resource loader fornisce accesso alle risorce dell'applicazione ed ai resource bundle.
ja_jp: リソースローダーはアプリケーションリソースおよびリソースバンドルへのアクセスを提供します。

source: <literal>resourceLoader.bundleNames</literal> &#8212; the names of the Java resource bundles to search when the Seam resource bundle is used. Default to <literal>messages</literal>.
it_it: <literal>resourceLoader.bundleNames</literal> &#8212; i nomi dei resource bundle da cerca quando viene usato il resource bundle di Seam. Di default è <literal>messages</literal>.
ja_jp: <literal>resourceLoader.bundleNames</literal> &#8212; Seam リソースバンドルを使用する場合に検索する Java リソースバンドル名です。 デフォルトは <literal>messages</literal> になります。

source: Supports selection of the locale either at configuration time, or by the user at runtime.
it_it: Supporta la selezione del locale o a configuration time, o dall'utente a runtime.
ja_jp: 設定時間またはランタイム時のユーザーのいずれかでロケール選択をサポートします。

source: <literal>select()</literal> &#8212; select the specified locale.
it_it: <literal>select()</literal> &#8212; seleziona il locale specificato.
ja_jp: <literal>select()</literal> &#8212; 指定されたロケールを選択します。

source: <literal>localeSelector.locale</literal> &#8212; the actual <literal>java.util.Locale</literal>.
it_it: <literal>localeSelector.locale</literal> &#8212; l'attuale <literal>java.util.Locale</literal>.
ja_jp: <literal>localeSelector.locale</literal> &#8212; 実際の <literal>java.util.Locale</literal> です。

source: <literal>localeSelector.localeString</literal> &#8212; the stringified representation of the locale.
it_it: <literal>localeSelector.localeString</literal> &#8212; la rappresentazione in stringa del locale.
ja_jp: <literal>localeSelector.localeString</literal> &#8212; ロケールの文字列表現です。

source: <literal>localeSelector.language</literal> &#8212; the language for the specified locale.
it_it: <literal>localeSelector.language</literal> &#8212; il linguaggio per il locale specificato.
ja_jp: <literal>localeSelector.language</literal> &#8212; 指定されたロケールの言語です。

source: <literal>localeSelector.country</literal> &#8212; the country for the specified locale.
it_it: <literal>localeSelector.country</literal> &#8212; il paese del locale specificato.
ja_jp: <literal>localeSelector.country</literal> &#8212; 指定されたロケールの国です。

source: <literal>localeSelector.variant</literal> &#8212; the variant for the specified locale.
it_it: <literal>localeSelector.variant</literal> &#8212; la variante del locale specificato.
ja_jp: <literal>localeSelector.variant</literal> &#8212; 指定されたロケールのバリアントです。

source: <literal>localeSelector.supportedLocales</literal> &#8212; a list of <literal>SelectItem</literal>s representing the supported locales listed in <literal>jsf-config.xml</literal>.
it_it: <literal>localeSelector.supportedLocales</literal> &#8212; una lista di <literal>SelectItem</literal>che rappresenta il locale supportati elencati in <literal>jsf-config.xml</literal>.
ja_jp: <literal>localeSelector.supportedLocales</literal> &#8212; <literal>jsf-config.xml</literal> に記載のサポートロケールを表している <literal>SelectItem</literal> 一覧です。

source: <literal>localeSelector.cookieEnabled</literal> &#8212; specifies that the locale selection should be persisted via a cookie.
it_it: <literal>localeSelector.cookieEnabled</literal> &#8212; specifica che la selezione del locale debba essere memorizzata in un cookie.
ja_jp: <literal>localeSelector.cookieEnabled</literal> &#8212; ロケール選択がクッキーで永続化されることを指定します。

source: Supports selection of the timezone either at configuration time, or by the user at runtime.
it_it: Supporta la selezione della timezone o a configuration time o da parte dell'utente a runtime.
ja_jp: 設定時間またはランタイム時のユーザーのいずれかでタイムゾーン選択をサポートします。

source: <literal>timezoneSelector.timezone</literal> &#8212; the actual <literal>java.util.TimeZone</literal>.
it_it: <literal>timezoneSelector.timezone</literal> &#8212; la <literal>java.util.TimeZone</literal> corrente.
ja_jp: <literal>timezoneSelector.timezone</literal> &#8212; 実際の <literal>java.util.TimeZone</literal> です。

source: <literal>timezoneSelector.timeZoneId</literal> &#8212; the stringified representation of the timezone.
it_it: <literal>timezoneSelector.timeZoneId</literal> &#8212; la rappresentazione in stringa della timezone.
ja_jp: <literal>timezoneSelector.timeZoneId</literal> &#8212; タイムゾーンの文字列表現です。

source: <literal>timezoneSelector.cookieEnabled</literal> &#8212; specifies that the timezone selection should be persisted via a cookie.
it_it: <literal>timezoneSelector.cookieEnabled</literal> &#8212; specificare che la selezione della timezone debba essere memorizzata in un cookie.
ja_jp: <literal>timezoneSelector.cookieEnabled</literal> &#8212; タイムゾーン選択がクッキーによって永続化されることを指定します。

source: A map containing internationalized messages rendered from message templates defined in the Seam resource bundle.
it_it: Una mappa contenente messaggi internazionalizzati generati da template di messaggi definiti nel resource bundle di Seam.
ja_jp: Seam リソースバンドル内で定義されるメッセージテンプレートからレンダリングされる国際化メッセージを含んでいるマップです。

source: Supports selection of the theme either at configuration time, or by the user at runtime.
it_it: Supporta la selezione di temi o a configuration time, o da parte dell'utente a runtime.
ja_jp: 設定時間またはランタイム時のユーザーのいずれかでテーマ選択をサポートします。

source: <literal>select()</literal> &#8212; select the specified theme.
it_it: <literal>select()</literal> &#8212; seleziona il tema specificato.
ja_jp: <literal>select()</literal> &#8212; 指定されたテーマを選択します。

source: <literal>theme.availableThemes</literal> &#8212; the list of defined themes.
it_it: <literal>theme.availableThemes</literal> &#8212; la lista dei temi definiti.
ja_jp: <literal>theme.availableThemes</literal> &#8212; 定義されたテーマの一覧です。

source: <literal>themeSelector.theme</literal> &#8212; the selected theme.
it_it: <literal>themeSelector.theme</literal> &#8212; il tema selezionato.
ja_jp: <literal>themeSelector.theme</literal> &#8212; 選択されたテーマです。
