Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Components.po
Languages: it_it, ja_jp

source: <literal>org.jboss.seam.core.init.clientSideConversations</literal> &#8212; if set to <literal>true</literal>, Seam will save conversation context variables in the client instead of in the <literal>HttpSession</literal>.
it_it: <literal>org.jboss.seam.core.init.clientSideConversations</literal> &#8212; se impostato a <literal>true</literal>, Seam salverà le variabili del contestodi conversazione nel client anziché in <literal>HttpSession</literal>.
ja_jp: <literal>org.jboss.seam.core.init.clientSideConversations</literal> &#8212; <literal>true</literal> にセットすると Seam は対話コンテキストの変数を <literal>HttpSession</literal> 内ではなくクライアント内に保存するようになります。

source: Internal component for Seam page and conversation context management. Always installed.
it_it: Il componente interno per la pagina Seam e la gestione del contesto di conversazione. Sempre installato.
ja_jp: Seam ページおよび対話コンテキスト管理用の内部コンポーネントです。 常にインストールされます。

source: <literal>org.jboss.seam.core.manager.conversationTimeout</literal> &#8212; the conversation context timeout in milliseconds.
it_it: <literal>org.jboss.seam.core.manager.conversationTimeout</literal> &#8212; il timeout del contesto di conversazione espresso in millisecondi.
ja_jp: <literal>org.jboss.seam.core.manager.conversationTimeout</literal> &#8212; ミリ秒単位で対話コンテキストのタイムアウトを設定します。

source: <literal>org.jboss.seam.core.manager.concurrentRequestTimeout</literal> &#8212; maximum wait time for a thread attempting to gain a lock on the long-running conversation context.
it_it: <literal>org.jboss.seam.core.manager.concurrentRequestTimeout</literal> &#8212; massimo tempo di attesa per un thread che tenta di ottenere il locksul contesto di conversazione long-running.
ja_jp: <literal>org.jboss.seam.core.manager.concurrentRequestTimeout</literal> &#8212; 長期実行対話コンテキストでロックの取得を試行しているスレッドの最大待機時間です。

source: <literal>org.jboss.seam.core.manager.conversationIdParameter</literal> &#8212; the request parameter used to propagate the conversation id, default to <literal>conversationId</literal>.
it_it: <literal>org.jboss.seam.core.manager.conversationIdParameter</literal> &#8212; il parametro di richiesta usato per propagare l'id di conversazione, di default è <literal>conversationId</literal>.
ja_jp: <literal>org.jboss.seam.core.manager.conversationIdParameter</literal> &#8212; 対話 ID の電波に使用する要求パラメータです。 デフォルトは <literal>conversationId</literal> です。

source: <literal>org.jboss.seam.core.manager.conversationIsLongRunningParameter</literal> &#8212; the request parameter used to propagate information about whether the conversation is long-running, default to <literal>conversationIsLongRunning</literal>.
it_it: <literal>org.jboss.seam.core.manager.conversationIsLongRunningParameter</literal> &#8212; il parametro di richiesta usato per propagare l'informazione se la conversazione è long-running, di default è <literal>conversationIsLongRunning</literal>.
ja_jp: <literal>org.jboss.seam.core.manager.conversationIsLongRunningParameter</literal> &#8212; 対話が長期実行であるかどうかについての情報伝播に使用する要求パラメータです。 デフォルトは <literal>conversationIsLongRunning</literal> です。

source: <literal>org.jboss.seam.core.manager.defaultFlushMode</literal> &#8212; set the flush mode set by default on any Seam Managed Persistence Context. By default <literal>AUTO</literal>.
it_it: <literal>org.jboss.seam.core.manager.defaultFlushMode</literal> &#8212; imposta la modalità flush impostata di default su ogni contesto di persistenza gestito da Seam. Di default è <literal>AUTO</literal>.
ja_jp: <literal>org.jboss.seam.core.manager.defaultFlushMode</literal> &#8212; すべての Seam 管理永続コンテキストにデフォルトでセットされるフラッシュモードを設定します。 デフォルトは <literal>AUTO</literal> です。

source: Internal component for Seam workspace management. Always installed.
it_it: Componente interno per la gestione del workspace di Seam. Sempre installato.
ja_jp: Seam ワークスペースの管理用の内部コンポーネントです。 常にインストールされます。

source: <literal>org.jboss.seam.navigation.pages.noConversationViewId</literal> &#8212; global setting for the view id to redirect to when a conversation entry is not found on the server side.
it_it: <literal>org.jboss.seam.navigation.pages.noConversationViewId</literal> &#8212; impostazione globale per il view-id a cui fare redirect quando un'entry di conversazione non viene trovata lato server.
ja_jp: <literal>org.jboss.seam.navigation.pages.noConversationViewId</literal> &#8212; 対話エントリがサーバー側に見つからない場合のビュー ID リダイレクト先のグローバル設定です。

source: <literal>org.jboss.seam.navigation.pages.loginViewId</literal> &#8212; global setting for the view id to redirect to when an unauthenticated user tries to access a protected view.
it_it: <literal>org.jboss.seam.navigation.pages.loginViewId</literal> &#8212; impostazione globale per il view-id a cui fare redirect quando un utente non autenticato prova ad accedere ad una vista protetta.
ja_jp: <literal>org.jboss.seam.navigation.pages.loginViewId</literal> &#8212; 未承認ユーザーが保護されたビューにアクセスしようとしている場合のビュー ID リダイレクト先のグローバル設定です。

source: <literal>org.jboss.seam.navigation.pages.httpPort</literal> &#8212; global setting for the port to use when the http scheme is requested.
it_it: <literal>org.jboss.seam.navigation.pages.httpPort</literal> &#8212; impostazione globale per la porta da usare quando uno schema http viene richiesto.
ja_jp: <literal>org.jboss.seam.navigation.pages.httpPort</literal> &#8212; http スキームが要求された場合に使用するポートのグローバル設定です。

source: <literal>org.jboss.seam.navigation.pages.httpsPort</literal> &#8212; global setting for the port to use when the https scheme is requested.
it_it: <literal>org.jboss.seam.navigation.pages.httpsPort</literal> &#8212; impostazione globale per la porta da usare quando uno schema https viene richiesto.
ja_jp: <literal>org.jboss.seam.navigation.pages.httpsPort</literal> &#8212; https スキームが要求された場合に使用するポートのグローバル設定です。

source: <literal>org.jboss.seam.navigation.pages.resources</literal> &#8212; a list of resources to search for <literal>pages.xml</literal> style resources. Defaults to <literal>WEB-INF/pages.xml</literal>.
it_it: <literal>org.jboss.seam.navigation.pages.resources</literal> &#8212; una lista di risorse da cercare per le risorse di stile <literal>pages.xml</literal>. Di default è <literal>WEB-INF/pages.xml</literal>.
ja_jp: <literal>org.jboss.seam.navigation.pages.resources</literal> &#8212; <literal>pages.xml</literal> スタイルのリソースを検索するリソース一覧です。 デフォルトは <literal>WEB-INF/pages.xml</literal> です。

source: Bootstraps a <literal>JbpmConfiguration</literal>. Install as class <literal>org.jboss.seam.bpm.Jbpm</literal>.
it_it: Avvia una <literal>JbpmConfiguration</literal>. Installa <literal>org.jboss.seam.bpm.Jbpm</literal> come classe.
ja_jp: <literal>JbpmConfiguration</literal> をブートストラップします。 クラス <literal>org.jboss.seam.bpm.Jbpm</literal> としてインストールします。

source: <literal>org.jboss.seam.bpm.jbpm.processDefinitions</literal> &#8212; a list of resource names of jPDL files to be used for orchestration of business processes.
it_it: <literal>org.jboss.seam.bpm.jbpm.processDefinitions</literal> &#8212; una lista di nomi di risorsa di file jPDL da usare per l'orchestrazione dei processi di business.
ja_jp: <literal>org.jboss.seam.bpm.jbpm.processDefinitions</literal> &#8212; ビジネスプロセスの編成に使用する jPDL ファイルのリソース名一覧です。

source: <literal>org.jboss.seam.bpm.jbpm.pageflowDefinitions</literal> &#8212; a list of resource names of jPDL files to be used for orchestration of conversation page flows.
it_it: <literal>org.jboss.seam.bpm.jbpm.pageflowDefinitions</literal> &#8212; una lista di nomi di risorsa di file jPDL da usare per l'orchestrazione dei pageflow di conversazione.
ja_jp: <literal>org.jboss.seam.bpm.jbpm.pageflowDefinitions</literal> &#8212; 対話ページフローの編成に使用する jPDL ファイルのリソース名一覧です。

source: Internal session-scoped component recording the active long-running conversations between requests.
it_it: Componente interno con scope sessione che registra le conversazioni long-running attive tra le richieste.
ja_jp: 要求間のアクティブな長期の対話を記録するセッションスコープの内部コンポーネントです。

source: Internal page-scoped component recording the conversation context associated with a page.
it_it: Componente interno con scope pagina che registra il contesto di conversazione associato alla pagina.
ja_jp: ページに関連付けられる対話コンテキストを記録するページスコープの内部コンポーネントです。

source: Internal component recording the persistence contexts which were used in the current conversation.
it_it: Componente interno che registra i contesti di persistenza usati nell'attuale conversazione.
ja_jp: 現在の対話に使用された永続コンテキストを記録する内部コンポーネントです。

source: Manages a JMS <literal>QueueConnection</literal>. Installed whenever managed <literal>QueueSender</literal> is installed.
it_it: Gestisce una <literal>QueueConnection</literal> JMS. Installata ogni volta che viene installata una <literal>QueueSender</literal> gestita.

source: <literal>org.jboss.seam.jms.queueConnection.queueConnectionFactoryJndiName</literal> &#8212; the JNDI name of a JMS <literal>QueueConnectionFactory</literal>. Default to <literal>UIL2ConnectionFactory</literal>
it_it: <literal>org.jboss.seam.jms.queueConnection.queueConnectionFactoryJndiName</literal> &#8212; il nome JNDI di un <literal>QueueConnectionFactory</literal> JMS. Di default è <literal>UIL2ConnectionFactory</literal>
ja_jp: <literal>org.jboss.seam.jms.queueConnection.queueConnectionFactoryJndiName</literal> &#8212; JMS <literal>QueueConnectionFactory</literal> の JNDI 名です。 デフォルトは <literal>UIL2ConnectionFactory</literal> です。

source: Manages a JMS <literal>TopicConnection</literal>. Installed whenever managed <literal>TopicPublisher</literal> is installed.
it_it: Gestisce una <literal>TopicConnection</literal> JMS. Installata ogni volta che viene installata una <literal>TopicPublisher</literal> gestita.

source: <literal>org.jboss.seam.jms.topicConnection.topicConnectionFactoryJndiName</literal> &#8212; the JNDI name of a JMS <literal>TopicConnectionFactory</literal>. Default to <literal>UIL2ConnectionFactory</literal>
it_it: <literal>org.jboss.seam.jms.topicConnection.topicConnectionFactoryJndiName</literal> &#8212; il nome JNDIdi un <literal>TopicConnectionFactory</literal> JMS . Di default è <literal>UIL2ConnectionFactory</literal>
ja_jp: <literal>org.jboss.seam.jms.topicConnection.topicConnectionFactoryJndiName</literal> &#8212; JMS <literal>TopicConnectionFactory</literal> の JNDI 名です。 デフォルトは <literal>UIL2ConnectionFactory</literal> です。

source: Abstraction layer for non-standardized features of JPA provider.
it_it: Layer d'astrazione per le funzionalità non standardizzate del provider JPA.
ja_jp: JPA プロバイダの標準化されていない機能に対する抽出層です。

source: Caches instances of Hibernate Validator <literal>ClassValidator</literal>.
it_it: Mette in cache istanze di <literal>ClassValidator</literal> di Hibernate Validator.
ja_jp: Hibernate Validator <literal>ClassValidator</literal> のインスタンスをキャッシュします。

source: Allows the application to determine whether validation failed or was successful.
it_it: Consente all'applicazione di determinare se la validazione ha fallito o ha avuto successo.
ja_jp: 検証が失敗したのか成功だったのかアプリケーションが判断できるようになります。

source: Support for the Seam Debug Page.
it_it: Supporto per la pagina di debug di Seam.
ja_jp: Seam Debug Page のサポートです。

source: Internal component for exception handling.
it_it: Componente interno per la gestione delle eccezioni.
ja_jp: 例外処理用の内部コンポーネントです。

source: API for controlling transactions and abstracting the underlying transaction management implementation behind a JTA-compatible interface.
it_it: API per controllare le transazioni ed astrarre l'implementazione della gestione delle transazioni sottostante dietro all'interfaccia compatibile-JTA.
ja_jp: トランザクションを制御し JTA 互換のインタフェースの背後にある基礎となるトランザクション管理の実装を抽出するための API です。

source: Decides if an action expression in an incoming URL is safe. This is done by checking that the action expression exists in the view.
it_it: Decide se un'espressione d'azione in un URL entrante è sicura. Questo viene fatto controllando che l'espressione d'azione esista nella vista.
ja_jp: 着信 URL 内のアクション式が安全かどうかを決定します。 アクション式がビュー内に存在することを確認することでこれを行います。

source: Miscellaneous components
it_it: Componenti misti
ja_jp: その他のコンポーネント

source: These components don't fit into
it_it: Questi componenti non entrano in

source: Dispatcher stateless session bean for asynchronous methods.
it_it: Bean di sessione stateless dispatcher per i metodi asincroni.
ja_jp: 非同期メソッド用のディスパッチャステートレスセッション Bean

source: Image manipulation and interrogation.
it_it: Manipolazione d'immagine ed interrogazione.
ja_jp: イメージ操作および問い合わせ

source: Manager component for a PojoCache instance.
it_it: Componente gestore per un'istanza PojoCache.
ja_jp: PojoCache インスタンスの管理コンポーネント

source: Manages a map of UIComponents keyed by component id.
it_it: Gestisce una mappa per i UIComponent aventi come chiave l'id del componente.
ja_jp: コンポーネント ID によって与えられる UIComponents のマップを管理します。

source: Special components
it_it: Componenti speciali
ja_jp: 特殊なコンポーネント

source: Certain special Seam component classes are installable multiple times under names specified in the Seam configuration. For example, the following lines in <literal>components.xml</literal> install and configure two Seam components:
it_it: Alcune classi speciali di componenti Seam sono installabili più volte sotto nomi specificati nella configurazione Seam. Per esempio, le seguenti linee in <literal>components.xml</literal> installano e configurano due componenti Seam:
ja_jp: 特定の特殊な Seam コンポーネントクラスは Seam 設定内で指定される name の配下で複数回のインストールが可能です。 例えば、 <literal>components.xml</literal> 内の次の行は Seam コンポーネントを 2 つインストールして設定します。

source: The Seam component names are <literal>bookingDatabase</literal> and <literal>userDatabase</literal>.
it_it: I nomi dei componenti Seam sono <literal>bookingDatabase</literal> e <literal>userDatabase</literal>.
ja_jp: Seam コンポーネント名は <literal>bookingDatabase</literal> と <literal>userDatabase</literal> です。

source: Manager component for a conversation scoped managed <literal>EntityManager</literal> with an extended persistence context.
it_it: Componente gestore per un <literal>EntityManager</literal> gestito con scope conversazione con un contesto di persistenza esteso.
ja_jp: 拡張永続コンテキストを持つ対話スコープで管理対象の <literal>EntityManager</literal> の管理コンポーネントです。

source: <emphasis>&lt;entityManager&gt;</emphasis>.entityManagerFactory &#8212; a value binding expression that evaluates to an instance of <literal>EntityManagerFactory</literal>.
it_it: <emphasis>&lt;entityManager&gt;</emphasis>.entityManagerFactory &#8212; un'espressione di value binding che valuta un'istanza di <literal>EntityManagerFactory</literal>.
ja_jp: <emphasis>&lt;entityManager&gt;</emphasis>.entityManagerFactory &#8212; <literal>EntityManagerFactory</literal> のインスタンスに評価を行う値バインディング式です。

source: <emphasis>&lt;entityManager&gt;</emphasis>.persistenceUnitJndiName &#8212; the JNDI name of the entity manager factory, default to java:/<emphasis>&lt;managedPersistenceContext&gt;</emphasis>.
it_it: <emphasis>&lt;entityManager&gt;</emphasis>.persistenceUnitJndiName &#8212; il nome JNDI di un entity manager factory, il valore di default è java:/<emphasis>&lt;managedPersistenceContext&gt;</emphasis>.
ja_jp: <emphasis>&lt;entityManager&gt;</emphasis>.persistenceUnitJndiName &#8212; エンティティマネージャファクトリの JNDI 名です。 デフォルトは java:/<emphasis>&lt;managedPersistenceContext&gt;</emphasis> です。

source: Manages a JPA <literal>EntityManagerFactory</literal>. This is most useful when using JPA outside of an EJB 3.0 supporting environment.
it_it: Gestisce una <literal>EntityManagerFactory</literal> JPA. Questo è utile quando sia usa JPA fuori dall'ambiente EJB3.0.
ja_jp: JPA <literal>EntityManagerFactory</literal> を管理します。 EJB 3.0 サポート環境以外で JPA を使用する場合に最適となります。

source: <literal>entityManagerFactory.persistenceUnitName</literal> &#8212; the name of the persistence unit.
it_it: <literal>entityManagerFactory.persistenceUnitName</literal> &#8212; il nome dell'unità di persistenza.
ja_jp: <literal>entityManagerFactory.persistenceUnitName</literal> &#8212; 永続ユニット名です。

source: See the API JavaDoc for further configuration properties.
it_it: Si vede la API JavaDoc per ulteriori proprietà di configurazione.
ja_jp: 設定プロパティの詳細については API JavaDoc をご覧ください。

source: Manager component for a conversation scoped managed Hibernate <literal>Session</literal>.
it_it: Componente gestore per una <literal>Session</literal> HIbernate gestita con scope di conversazione.
ja_jp: 対話スコープで管理対象の Hibernate <literal>Session</literal> の管理コンポーネントです。

source: <emphasis>&lt;session&gt;</emphasis>.sessionFactory &#8212; a value binding expression that evaluates to an instance of <literal>SessionFactory</literal>.
it_it: <emphasis>&lt;session&gt;</emphasis>.sessionFactory &#8212; un'espressione di binding che valuta un'istanza di <literal>SessionFactory</literal>.
ja_jp: <emphasis>&lt;session&gt;</emphasis>.sessionFactory &#8212; <literal>SessionFactory</literal> のインスタンスに対して評価する値バインディング式です。

source: <emphasis>&lt;session&gt;</emphasis>.sessionFactoryJndiName &#8212; the JNDI name of the session factory, default to java:/<emphasis>&lt;managedSession&gt;</emphasis>.
it_it: <emphasis>&lt;session&gt;</emphasis>.sessionFactoryJndiName &#8212; il nome JNDI della factory di sessione, di default è java:/<emphasis>&lt;managedSession&gt;</emphasis>.
ja_jp: <emphasis>&lt;session&gt;</emphasis>.sessionFactoryJndiName &#8212; セッションファクトリの JNDI 名です。 デフォルトは java:/<emphasis>&lt;managedSession&gt;</emphasis> です。

source: Manages a Hibernate <literal>SessionFactory</literal>.
it_it: Gestisce una <literal>SessionFactory</literal> di Hibernate.
ja_jp: Hibernate <literal>SessionFactory</literal> を管理します。

source: <literal>&lt;sessionFactory&gt;.cfgResourceName</literal> &#8212; the path to the configuration file. Default to <literal>hibernate.cfg.xml</literal>.
it_it: <literal>&lt;sessionFactory&gt;.cfgResourceName</literal> &#8212; il percorso al file di configurazione. Di default è <literal>hibernate.cfg.xml</literal>.
ja_jp: <literal>&lt;sessionFactory&gt;.cfgResourceName</literal> &#8212; 設定ファイルへのパスです。デフォルトは <literal>hibernate.cfg.xml</literal> です。

source: Manager component for an event scoped managed JMS <literal>QueueSender</literal>.
it_it: Componente gestore per un <literal>QueueSender</literal> JMS gestito con scope evento.
ja_jp: イベントスコープで管理対象の JMS <literal>QueueSender</literal> の管理コンポーネントです。

source: <emphasis>&lt;managedQueueSender&gt;</emphasis>.queueJndiName &#8212; the JNDI name of the JMS queue.
it_it: <emphasis>&lt;managedQueueSender&gt;</emphasis>.queueJndiName &#8212; il nome JNDI della coda JMS.
ja_jp: <emphasis>&lt;managedQueueSender&gt;</emphasis>.queueJndiName &#8212; JMS キューの JNDI 名です。

source: Manager component for an event scoped managed JMS <literal>TopicPublisher</literal>.
it_it: Componente gestore per un <literal>TopicPublisher</literal> JMS gestito con scope evento.
ja_jp: イベントスコープで管理対象の JMS <literal>TopicPublisher</literal> の管理コンポーネントです。

source: <emphasis>&lt;managedTopicPublisher&gt;</emphasis>.topicJndiName &#8212; the JNDI name of the JMS topic.
it_it: <emphasis>&lt;managedTopicPublisher&gt;</emphasis>.topicJndiName &#8212; il nome JNDI del topic JMS.
ja_jp: <emphasis>&lt;managedTopicPublisher&gt;</emphasis>.topicJndiName &#8212; JMS トピックの JMDI 名です。

source: Manager component for a conversation scoped managed Drools <literal>WorkingMemory</literal>.
it_it: Componente gestore di una <literal>WorkingMemory</literal> di Drools gestita con scope di conversazione.
ja_jp: 対話スコープで管理対象の Drools <literal>WorkingMemory</literal> の管理コンポーネントです。

source: <emphasis>&lt;managedWorkingMemory&gt;</emphasis>.ruleBase &#8212; a value expression that evaluates to an instance of <literal>RuleBase</literal>.
it_it: <emphasis>&lt;managedWorkingMemory&gt;</emphasis>.ruleBase &#8212; un'espressione che valuta un'istanza di <literal>RuleBase</literal>.
ja_jp: <emphasis>&lt;managedWorkingMemory&gt;</emphasis>.ruleBase &#8212; <literal>RuleBase</literal> のインスタンスに対して評価する値式です。

source: Manager component for an application scoped Drools <literal>RuleBase</literal>. <emphasis>Note that this is not really intended for production usage, since it does not support dynamic installation of new rules.</emphasis>
it_it: Componente gestore di una <literal>RuleBase</literal> di Drools con scope di applicazione. <emphasis>Si noti che questo non è inteso per l'uso in produzione, poiché non supporta l'installazione dinamica di nuove regole.</emphasis>
ja_jp: アプリケーションスコープの Drools <literal>RuleBase</literal> の管理コンポーネントです。 <emphasis>新しいルールの動的なインストールには対応しないため、 実稼働での使用は目的としていないので注意してください。</emphasis>

source: <emphasis>&lt;ruleBase&gt;</emphasis>.ruleFiles &#8212; a list of files containing Drools rules.
it_it: <emphasis>&lt;ruleBase&gt;</emphasis>.ruleFiles &#8212; una lista di file contenenti regole Drools.
ja_jp: <emphasis>&lt;ruleBase&gt;</emphasis>.ruleFiles &#8212; Drools ルールを含むファイルの一覧です。

source: <emphasis>&lt;ruleBase&gt;</emphasis>.dslFile &#8212; a Drools DSL definition.
it_it: <emphasis>&lt;ruleBase&gt;</emphasis>.dslFile &#8212; una definizione DSL di Drools.
ja_jp: <emphasis>&lt;ruleBase&gt;</emphasis>.dslFile &#8212; Drools DSL 定義です。

source: Manager component for the jBPM task list.
ja_jp: jBPM task list の管理コンポーネントです。
