Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Conversations.po
Languages: fr_fr, it_it, ja_jp

source: Seam provides the notion of a <emphasis>page action</emphasis> to help solve the first problem, but this does nothing to help us with the second problem. We <emphasis>could</emphasis> work around this by using the RESTful approach of passing a request parameter and requerying for the selected object on the server side. In some cases &#8212; such as the Seam blog example application &#8212; this is indeed the best approach. The RESTful style supports bookmarking, since it does not require server-side state. In other cases, where we don't care about bookmarks, the use of <literal>@DataModel</literal> and <literal>@DataModelSelection</literal> is just so convenient and transparent!
fr_fr: Seam fourni la notion d'<emphasis>action de page</emphasis> pour aider à résoudre le premier problème, mais cela ne fait rien pour le second problème. Nous <emphasis>pourrions</emphasis>contourner cela en utilisant l'apporche RESTful en passant le paramètre de requête et en requérant l'objet sélectionné du côté serveur. Dans quelques cas &#8212; comme l'application blog en exemple de Seam &#8212; c'est en fait la meilleure approche. Le style RESTful supporte le marquepage alors qu'il ne requiere par un état du côté serveur. Dans les autres cas, quand nous ne nous inquiétons pas à propos des marques-pages, l'utilisation de <literal>@DataModel</literal> et <literal>@DataModelSelection</literal> est juste plus pratique et plus transparant!
it_it: Seam fornisce la nozione di <emphasis>pagina d'azione</emphasis> per aiutare a risolvere il primo problema, ma questo non aiuta per niente il secondo problema. Si <emphasis>può</emphasis> aggirare questo usando l'approccio RESTful di passare un parametro di richiesta e di riottenere l'oggetto selezionato lato server. In alcuni casi &#8212; come nell'esempio Seam del Blog &#8212; questo è il migliore approccio. Lo stile RESTful supporta i segnalibri, poiché non richiede uno stato lato server. In altri casi, dove non interessanno i segnalibri, l'uso di un <literal>@DataModel</literal> e di <literal>@DataModelSelection</literal> è conveniente e trasparente!

source: To fill in this missing functionality, and to make conversation propagation even simpler to manage, Seam provides the <literal>&lt;s:link&gt;</literal> JSF tag.
fr_fr: Pour implémenter cette fonctionnalité manquante et pour permettre la propagation de la conversation aussi simple pour gérer, Seam fourni la tag JSF <literal>&lt;s:link&gt;</literal>.
it_it: Per riempiere questa mancanza di funzionalità e rendere semplicela propagazione delle conversazioni da gestire, Seam fornisce il tag JSF <literal>&lt;s:link&gt;</literal>.
ja_jp: この機能を補ってさらに対話伝播の管理をより簡略化するために、 Seam は <literal>&lt;s:link&gt;</literal> JSF タグを提供しています。

source: The link may specify just the JSF view id:
fr_fr: Le lien peut juste spécifier l'iodentifiant de la vue JSF:
it_it: Il link può specificare solo l'id della vista JSF:
ja_jp: このリンクは JSF ビュー ID だけを指定することができます。

source: Or, it may specify an action method (in which case the action outcome determines the page that results):
it_it: Oppure può spcificareil metodo d'azione (nel qual caso l'esito dell'azione determina la pagina di destinazione):
ja_jp: あるいは、 アクションメソッドを指定することができます (この場合、 アクションの結果は最終的なページを確定する)。

source: If you specify <emphasis>both</emphasis> a JSF view id and an action method, the 'view' will be used <emphasis>unless</emphasis> the action method returns a non-null outcome:
fr_fr: Si vous spécifier les <emphasis>deux</emphasis> : un identifiant de vue JSF et une méthode d'action, la 'vue' sera utilisée <emphasis>à moins</emphasis> que la méthode d'action ne retourne un résultat non-null:
it_it: Se si specificano <emphasis>entrambi</emphasis> l'id della vista JSF ed il metodo d'azione, verrà usata la 'vista' <emphasis>amenoché</emphasis> il metodo d'azione ritorni un esito non-null:
ja_jp: JSF ビュー ID とアクションメソッドの<emphasis>両方</emphasis>を指定すると、 <emphasis>アクションメソッドが null 以外の結果を返さない限り</emphasis>「ビュー」が使用されます。

source: The link automatically propagates the selected row of a <literal>DataModel</literal> using inside <literal>&lt;h:dataTable&gt;</literal>:
fr_fr: Le lien propage automatiquement la ligne sélectionnée d'un <literal>DataModel</literal> en l'utilisant avec <literal>&lt;h:dataTable&gt;</literal>:
it_it: Il link propaga automaticamente la riga selezionata del <literal>DataModel</literal> usando all'interno <literal>&lt;h:dataTable&gt;</literal>:
ja_jp: リンクは <literal>&lt;h:dataTable&gt;</literal> 内で使用する <literal>DataModel</literal> の選択列を自動的に伝播します。

source: You can leave the scope of an existing conversation:
fr_fr: Vous pouvez quitter l'étendue d'une conversation existante:
it_it: Si può lasciare lo scope di una conversazione esistente:
ja_jp: 既存の対話のスコープを残しておくことができます。

source: You can begin, end, or nest conversations:
fr_fr: Vous pouvez commencer, finir ou grouper les conversations:
it_it: Si può iniziare, terminare, o innestare le conversazioni:
ja_jp: 対話を開始、 終了、 またはネストすることができます。

source: If the link begins a conversation, you can even specify a pageflow to be used:
fr_fr: Si le lien commence une conversation, vous pouvez même spécifier l'enchainement de page à utiliser:
it_it: Se il link inizia una conversazione, si può anche specificare il pageflow da usare:
ja_jp: リンクが対話を開始すると、 使用されるページプローを指定することもできます。

source: The <literal>taskInstance</literal> attribute is for use in jBPM task lists:
fr_fr: L'attribut <literal>taskInstance</literal> à utiliser dans une liste de tâches jBPM:
it_it: L'attributo <literal>taskInstance</literal> è per l'uso nelle liste di task jBPM:

source: (See the DVD Store demo application for examples of this.)
fr_fr: (Voir l'application de démonstration du magasin de DVD pour des exemples de cela.)
it_it: (Si veda l'applicazione demo di Negozio DVD come esempio.)
ja_jp: (上記の例は DVD ストアデモアプリケーションを参照してください。)

source: Finally, if you need the "link" to be rendered as a button, use <literal>&lt;s:button&gt;</literal>:
fr_fr: Enfin, si vous avez besoin d'un "lien" qui soit visualisé comme un bouton, utilisez <literal>&lt;s:button&gt;</literal>:
it_it: Infine se il "link" deve essere visualizzato come pulsante, si usi <literal>&lt;s:button&gt;</literal>:
ja_jp: 最後に、 ボタンとしてレンダリングされる「リンク」が必要な場合は <literal>&lt;s:button&gt;</literal> を使用します。

source: Success messages
fr_fr: Message de succès
it_it: Messaggi di successo
ja_jp: 成功のメッセージ

source: It is quite common to display a message to the user indicating success or failure of an action. It is convenient to use a JSF <literal>FacesMessage</literal> for this. Unfortunately, a successful action often requires a browser redirect, and JSF does not propagate faces messages across redirects. This makes it quite difficult to display success messages in plain JSF.
fr_fr: Il est assez commun d'afficher un message pour l'utilisateur indiquant le succés ou l'echec d'une action. Il est pratique d'utiliser un <literal>FacesMessage</literal> de JSF pour cela. Malheureusement, une action réussie a besoin souvant d'une redirection du navigateur, et JSF ne peut pas propager un messages faces au travers de redirections. Cela rends les choses un peu plus difficile pour afficher un message de succés en pur JSF.
it_it: E' abbastanza comune visualizzare all'utente un messaggio indicante il successo od il fallimento di un'azione. E' conveniente usare <literal>FacesMessage</literal> di JSF per questo scopo. Sfortunatamente un'azione di successo spesso richiede un redirect del browser, e JSF non propaga i messaggi faces lungo i redirect. Questo rende difficile visualizzare i messaggi nel semplice JSF.
ja_jp: 動作に対して成功したか失敗したかをユーザーに示すメッセージを表示するのは非常に一般的です。 これには、 JSF <literal>FacesMessage</literal> を使うと便利です。 残念ながら、 成功のアクションはブラウザリダイレクトを要することが多く、 JSF はリダイレクト全体に faces のメッセージは伝播しません。 このためプレーン JSF で成功のメッセージを表示するのはかなり困難になります。

source: The built in conversation-scoped Seam component named <literal>facesMessages</literal> solves this problem. (You must have the Seam redirect filter installed.)
fr_fr: Le composant de Seam d'étendue conversation livré dénomé <literal>facesMessages</literal> résoud ce problème. (Vous devez avoir un filtre de redirection de Seam installé.)
it_it: Il componente Seam predefinito con scope conversazione chiamato <literal>facesMessages</literal> risolve questo problema. (Occorre avere installato il filtro redirect di Seam.)
ja_jp: 組み込みの対話スコープ Seam コンポーネントである <literal>facesMessages</literal> がこの問題を解決してくれます。 (Seam リダイレクトフィルタをインストールしておく必要があります。)

source: Any message added to <literal>facesMessages</literal> is used in the very next render response phase for the current conversation. This even works when there is no long-running conversation since Seam preserves even temporary conversation contexts across redirects.
fr_fr: Chaque message ajouté à <literal>facesMessages</literal> est utilisé dans la phase de réponse immédiatement suivante pour la conversation courante. Cela fonctionne même quand il y une conversaiton à exécution longue depuis que Seam conserve les contexte de conversation temporaire au travers de redirections.
it_it: Qualsiasi messaggio aggiunto a <literal>facesMessages</literal> viene usato nella fase render response più prossima per la conversazione corrente. Questo funziona anche quando non ci sono conversazioni long-running poiché Seam preserva anche i contesti di conversazioni temporanee lungo i redirect.
ja_jp: <literal>facesMessages</literal> に追加されるメッセージはすべてすぐ次のフェースである応答レンダリングフェーズで現在の対話に対して使用されます。 これは Seam がリダイレクト全体に一時的な対話コンテキストを維持するので長期実行の対話がない場合でも機能します。

source: You can even include JSF EL expressions in a faces message summary:
fr_fr: Vous pouvez même inclure les expressions EL de JSF dans le label du messages faces:
it_it: Si possono anche includere espressioni JSF EL in un sommario di messaggi faces:
ja_jp: JSF EL 式を faces メッセージサマリーに含ませることもできます。

source: You may display the messages in the usual way, for example:
fr_fr: Vous pouvez afficher le message de manière usuelle, par exemple:
it_it: Si possono visualizzare i messaggi nella solita maniera, per esempio:
ja_jp: たとえば、 通常の方法でメッセージを表示することができます。

source: Natural conversation ids
fr_fr: Utilisation d'un identifiant de conversation "explicite"
it_it: Id di una conversazione naturale
ja_jp: ナチュラル対話の ID

source: When working with conversations that deal with persistent objects, it may be desirable to use the natural business key of the object instead of the standard, "surrogate" conversation id:
fr_fr: Ordinairement avec les conversation qui travaille avec des objets persistants, il peut être utile d'utiliser une clef métier explicite au lieu de la version standard, identifiant de conversation de "substitution":
it_it: Lavorando con le conversazioni che trattano oggetti persistenti, può essere desiderabile utilizzare la chiave naturale di business dell'oggetto invece dello standard, id di conversazione "surrogato":
ja_jp: 永続オブジェクトを処理する対話を作業する場合は標準のサロゲート対話 ID ではなくそのオブジェクトのナチュラルキーを使用する方が望ましい場合があります。

source: Easy redirect to existing conversation
fr_fr: Redirection simple vers une conversation existante
it_it: Redirect facile verso conversazioni esistenti
ja_jp: 既存の対話に容易にリダイレクト

source: It can be useful to redirect to an existing conversation if the user requests the same operation twice. Take this example: <quote> You are on ebay, half way through paying for an item you just won as a Christmas present for your parents. Lets say you're sending it straight to them - you enter your payment details but you can't remember their address. You accidentally reuse the same browser window finding out their address. Now you need to return to the payment for the item. </quote>
fr_fr: Il peut être utile de rediriger vers une conversation existante si l'utilisateur demande la même opération deux fois. Prenons cet exemple: <quote>Vous êtes sur ebay, au milieu de la phase de paiement pour un cadeau de noël pour vos parents que vous avez gagné. Inutile de dire que vous voulez le leur envoyé immédiatement - vous entrez les défailts sur le paiement mais sans pouvoir vous souvenir de leur adresse. Vous réutilisez accidentellement la même fenètre du navigateur pour trouver leur adresse. Maintenant, vous avez besoin de retourner vers le paiement pour ce truc. </quote>
it_it: Può essere utile redirigersi verso una conversazione esistente se l'utente richiede la stessa operazione due volte. Si prenda quest'esempio: <quote>Sei su eBay, stai per pagare un oggetto che hai scelto come regalo per i tuoi genitori. Diciamo che lo stai per inviare a loro - stai per inserire i dettagli di pagamento ma non ti ricordi il loro indirizzo. Accidentalmente riutilizzi la stessa finestra del browser per cercare il loro indirizzo. Ora devi ritornare al pagamento di quell'oggetto.</quote>
ja_jp: ユーザーが同じ操作を 2 回要求する場合は既存の対話にリダイレクトすると便利な場合があります。 例をあげてみます。 <quote> 「ebay で両親へのクリスマスプレゼントを獲得しそのアイテムの支払いプロセスが途中まで進んでいます。 ここでこのアイテムが直接両親に配達されるようにしようと思います。 支払い詳細は入力しましたが両親の明確な住所を思い出すことができません。 住所を検索しようとして誤って同じブラウザウィンドウを使ってしまいました。 もう一度さっきのアイテムの支払いに戻る必要があります。」 </quote>

source: With a natural conversation it's really easy to have the user rejoin the existing conversation, and pick up where they left off - just have them to rejoin the payForItem conversation with the itemId as the conversation id.
fr_fr: Avec une conversation explicite, il est vraiment très facile d'avoir un utilisateur qui rejoind une conversation existante, et la reprendra là où il la laissé - tout simplement lui permettre de rejoindre la conversation payForItem avec l'itemId comme identifiant de conversation.
it_it: Con una conversazione naturale è molto facile riunire l'utente alla conversazione esistente, e riprendere dove aveva lasciato - riunirsi alla conversazione pagaOggetto con l'idOggetto come id di conversazione.

source: User friendly URLs
fr_fr: Utilisation des URLs sympatiques
it_it: URL user friendly
ja_jp: ユーザーフレンドリーな URL

source: For me this consists of a navigable hierarchy (I can navigate by editing the url) and a meaningful URL (like this Wiki uses - so don't identify things by random ids). For some applications user friendly URLs are less important, of course.
fr_fr: Pour moi cela consiste dans une hierachie navigable (Je peux naviguer en éditant l'URL) et une URL pertinente (comme font les Wiki - donc sans identifier les choses avec des identifiants kabbalistiques). Pour des applications l'utilisation des URLs sympatiques ne sont pas , bien sûr, du tout utile.
it_it: Questo si concretizza in una gerarchia navigabile (si può navigare editando l'url) e in URL significativi (come mostrato in Wiki - quindi non si identifichino gli oggetti con id casuali). Per alcune applicazioni gli URL user friendly sono sicuramente meno importanti.
ja_jp: 個人的には操作可能な階層と (URL を編集しながら操作可能) 意味のある URL (この Wiki に見られるようにランダムな ID での識別を行わない) で構成されているように見えますが、 アプリケーションユーザーにとってはフレンドリーな URL はそれほど重要ではない場合もあるでしょう。

source: With a natural conversation, when you are building your hotel booking system (or, of course, whatever your app is) you can generate a URL like <literal>http://seam-hotels/book.seam?hotel=BestWesternAntwerpen</literal> (of course, whatever parameter <literal>hotel</literal> maps to on your domain model must be unique) and with URLRewrite easily transform this to http://seam-hotels/book/BestWesternAntwerpen.
fr_fr: Avec une conversation explicite, quand vous allez construire votre système de réservation d'hotel (ou, bien sûr, quelque soit votre application) vous pouvez générer une URL comme <literal>http://seam-hotels/book.seam?hotel=BestWesternAntwerpen</literal> (bien sûr, quelque soit le paramètre <literal>hotel</literal> correspondant au modèle de votre domaine doit être unique) et avec une ré-écriture des URLs facilement transformable en http://seam-hotels/book/BestWesternAntwerpen.
it_it: Con una conversazione naturale, quando si costruisce un sistema di prenotazione hotel (od una qualsiasi applicazione) si può generare un URL del tipo <literal>http://seam-hotels/book.seam?hotel=BestWesternAntwerpen</literal> (sicuramente un qualsiasi parametro <literal>hotel</literal>, che mappi sul modello di dominio, deve essere univoco) e con URLRewrite si può facilmente trasformare questo in http://seam-hotels/book/BestWesternAntwerpen.

source: Much better!
fr_fr: Encore mieux!
it_it: Molto meglio!
ja_jp: かなり改善されたはずです。

source: Creating a natural conversation
fr_fr: La création d'une conversation explicite
it_it: Creazione di una conversazione naturale
ja_jp: ナチュラル対話を作成する

source: Natural conversations are defined in <literal>pages.xml</literal>:
fr_fr: Les conversations explicites sont définies dans <emphasis>description</emphasis>
it_it: Le conversazioni naturali sono definite in <literal>pages.xml</literal>:
ja_jp: ナチュラル対話は <literal>pages.xml</literal> で定義されます。

source: The first thing to note from the above definition is that the conversation has a name, in this case <literal>PlaceBid</literal>. This name uniquely identifies this particular named conversation, and is used by the <literal>page</literal> definition to identify a named conversation to participate in.
fr_fr: La première chose à noter de la définition ci-dessus est qua la conversation a un nom, dans ce cas <literal>PlaceBid</literal>. Ce nom identifiant de manière unique cette conversation particulière, et est utilisé par la définition de <literal>page</literal> pour identifier une conversation sus-nommé pour y participer.
it_it: La prima cosa da notare dalla definizione di cui sopra è che la conversazione ha un nome, in questo caso <literal>PlaceBid</literal>. Questo nome identifica univocamente questa particolare conversazione e viene usato dalla definizione di <literal>pagina</literal> per identificare una conversazione con nome in cui partecipare.
ja_jp: 上記の定義でまず判るのは対話に名前があることです。 この場合 <literal>PlaceBid</literal> になります。 名前は特定の指定対話を固有に識別するため <literal>page</literal> 定義により参加する指定対話の識別に使用されます。

source: The next attribute, <literal>parameter-name</literal> defines the request parameter that will contain the natural conversation id, in place of the default conversation id parameter. In this example, the <literal>parameter-name</literal> is <literal>auctionId</literal>. This means that instead of a conversation parameter like <literal>cid=123</literal> appearing in the URL for your page, it will contain <literal>auctionId=765432</literal> instead.
fr_fr: L'attribut suivant, <literal>parameter-name</literal> définit le paramète de la requête qui va contenir l'identifiant explicite de conversation, en lieu et place du paramètre d'identifiant de conversation par défaut. Dans cet exemple, le <literal>parameter-name</literal> est <literal>auctionId</literal>. Ce qui signifie qu'au lieu d'avoir un paramètre de conversation comme <literal>cid=123</literal> qui apparait dans l'URL de votre page, il y aura <literal>auctionId=765432</literal> à la place.
it_it: Il prossimo attributo <literal>parameter-name</literal> definisce il parametro di richiesta che conterrà l'id della conversazione naturale, al posto del parametro dell'id della conversazione di default. In quest'esempio, il <literal>parameter-name</literal> è <literal>auctionId</literal>. Questo significa che invece di un parametro di conversazione come <literal>cid=123</literal> che appare nell'URL della pagina, conterrà invece <literal>auctionId=765432</literal>.
ja_jp: 次の属性 <literal>parameter-name</literal> はデフォルトの対話 ID パラメータの代わりにナチュラル対話の ID を含む要求パラメータを定義します。 この例では <literal>parameter-name</literal> は <literal>auctionId</literal> になります。 つまり、 ページの URL 内に出現する <literal>cid=123</literal> のような対話パラメータの代わりに <literal>auctionId=765432</literal> を含むようになります。

source: The last attribute in the above configuration, <literal>parameter-value</literal>, defines an EL expression used to evaluate the value of the natural business key to use as the conversation id. In this example, the conversation id will be the primary key value of the <literal>auction</literal> instance currently in scope.
fr_fr: Le dernier attribut dans la configuration ci-dessus, <literal>parameter-value</literal>, défini une expression EL utilisée pour évaluer la valeur de la clef métier explicite à utiliser comme identifiant de conversation. Dans cet exemple, l'identifiant de conversation sera une valeur de clef primaire de l'instance <literal>auction</literal> courante dans l'étendue.
it_it: L'ultimo attributo della configurazione di cui sopra, <literal>parameter-value</literal>, definisce un'espressione EL usata per valutare il valore della chiave naturale di business da usare come id di conversazione. In quest'esempio, l'id della conversazione sarà il valore della chiave primaria dell'istanza <literal>auction</literal> attualmente nello scope.
ja_jp: 上記の設定の最後の属性 <literal>parameter-value</literal> は対話 ID として使用するナチュラルビジネスキーの値の評価に使用される EL 式を定義します。 この例では対話 ID は現在範囲内の <literal>auction</literal> のプライマリーキー値になります。

source: Next, we define which pages will participate in the named conversation. This is done by specifying the <literal>conversation</literal> attribute for a <literal>page</literal> definition:
fr_fr: Ensuite, nous définissons quelle page va être dans la convesation dénommée. Ceci est fait en spécifiant que l'attribut <literal>conversation</literal> pour une définition de <literal>page</literal>:
it_it: Poi si definirà quali pagine parteciperanno nella conversazione con nome. Questo è fatto specificando l'attributo <literal>conversation</literal> per una definizione di <literal>pagina</literal>:
ja_jp: 次に指定対話に参加するページを定義します。 <literal>page</literal> 定義の <literal>conversation</literal> 属性を指定してこれを行います。

source: Redirecting to a natural conversation
fr_fr: Redirection vers une conversation explicite
it_it: Redirezione alla conversazione naturale
ja_jp: ナチュラル対話にリダイレクトする

source: When starting, or redirecting to, a natural conversation there are a number of options for specifying the natural conversation name. Let's start by looking at the following page definition:
fr_fr: Au moment de démarrer, ou de rediriger vers, une conversation explicite, il y a plusieurs options pour spécifier le nom de la conversation explicite. Commençons pas regarder la définition de page suivante:
it_it: Avviando o facendo redirect verso una conversazione naturale ci sono un numero di opzioni possibili per specificare il nome della conversazione naturale. Si guardi alla seguente definizione di pagina:
ja_jp: ナチュラル対話を開始またはリダイレクトする場合、 ナチュラル対話名を指定するいくつかのオプションがあります。 次のページ定義をまず見てみることにします。
