Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Conversations.po
Languages: fr_fr, it_it, ja_jp

source: From here, we can see that invoking the action <literal>#{bidAction.placeBid}</literal> from our auction view (by the way, all these examples are taken from the seamBay example in Seam), that we will be redirected to <literal>/bid.xhtml</literal>, which, as we saw previously, is configured with the natural conversation <literal>PlaceBid</literal>. The declaration for our action method looks like this:
fr_fr: A partir de là, nous pouvons voir que l'invocation de l'action <literal>#{bidAction.placeBid}</literal> pour notre vue auction (à partir de là, tous ces exemples sont prit de l'exemple seamBat dans Seam), qui va être redirigier vers <literal>/bid.xhtml</literal>, qui , comme nous l'avons vu précédemment, est configuré avec la conversation explicite <literal>PlaceBid</literal>. La déclaration de notre méthode action devrait ressemble à ceci:
it_it: Da qua si può vedere che invocando l'azione <literal>#{bidAction.placeBid}</literal> dalla vista auction (comunque, tutti questi esempio sono presi dall'esempio seamBay), che verrà rediretta a <literal>/bid.xhtml</literal>, che come si è visto, è configurata con la conversazione naturale <literal>PlaceBid</literal>. La dichiarazione del metodo d'azione appare come:
ja_jp: auction ビューからアクション <literal>#{bidAction.placeBid}</literal> を呼び出していること (これらのサンプルはすべて Seam にある seamBay から取得している)、 前述のようにナチュラル対話 <literal>PlaceBid</literal> で設定される <literal>/bid.xhtml</literal> にリダイレクトしていることがわかります。 アクションメソッドの宣言は以下のようになります。

source: When named conversations are specified in the <literal>&lt;page/&gt;</literal> element, redirection to the named conversation occurs as part of navigation rules, after the action method has already been invoked. This is a problem when redirecting to an existing conversation, as redirection needs to be occur before the action method is invoked. Therefore it is necessary to specify the conversation name when the action is invoked. One way of doing this is by using the <literal>s:conversationName</literal> tag:
fr_fr: Quand les conversations nommées sont spécifiées dans l'élément <literal>&lt;page/&gt;</literal>, la redirection vers la conversion nommé intervient comme une des règles de navigations, après que la méthode d'action ai été invoquée. Ceci est un problème quand la redirection vers une conversation existante, quand la redirection a besoin d'intervenir après que la méthode d'action ai été invoquée. C'est pourquoi il est nécéssaire de spécifier le nom de la conversation quand l'action est invoquée. Une façon de faire cela est en utilisant la balise <literal>s:conversationName</literal> :
it_it: Quando le conversazioni con nome vengono specificate nell'elemento <literal>&lt;page/&gt;</literal>, la redirezione alla conversazione con nome avviene come parte delle regole, dopo che il metodo d'azione è già stato invocato. Questo è un problema quando ci si redirige ad una conversazione esistente, poiché la redirezione deve avvenire prima che sia invocato il metodo d'azione. Quindi è necessario specificare il nome della conversazione quando si invoca l'azione. Un metodo per fare questo è usare il tag <literal>s:conversationName</literal>:
ja_jp: 名前が付けられた対話が <literal>&lt;page/&gt;</literal> エレメントに指定される場合、 その名前の対話へのリダイレクトはアクションメソッドが完全に呼び出された後でナビゲーションルールの一部として発生します。 既存の対話にリダイレクトする場合はアクションメソッドが呼び出される前にリダイレクトが発生する必要があるため問題となってきます。 したがってアクションが呼び出される場合は対話名を指定する必要があります。 <literal>s:conversationName</literal> タグを使って行うのがその方法のひとつとなります。

source: Another alternative is to specify the <literal>conversationName</literal> attribute when using either <literal>s:link</literal> or <literal>s:button</literal>:
fr_fr: Une autre manière de spécifier l'attribut <literal>conversationName</literal> est en utilisant aussi bien <literal>s:link</literal> que <literal>s:button</literal>:
it_it: Un'altra alternativa è specificare l'attributo <literal>conversationName</literal> quando si usano o <literal>s:link</literal> o <literal>s:button</literal>:
ja_jp: もうひとつの方法は <literal>s:link</literal> または <literal>s:button</literal> のどちらかを使用するときに <literal>conversationName</literal> を指定する方法です。

source: Workspace management
fr_fr: Le gestionnaire d'espace de travail
it_it: Gestione del workspace
ja_jp: ワークスペースの管理

source: Workspace management is the ability to "switch" conversations in a single window. Seam makes workspace management completely transparent at the level of the Java code. To enable workspace management, all you need to do is:
fr_fr: Le gestionnaire de l'espace de travail est capable de "basculer" les conversations dans une seule fenètre. Seam rend la gestion des espaces de travail complètement transparente au niveau du code Java. Pour activer le gestionnaire de l'espace de travail, tout ce que vous avez à faire est :
it_it: La gestione del workspace è la capacità di "cambiare" le conversazioni all'interno di una singola finestra. Seam rende la gestione del workspace completamente trasparente a livello di codice Java. Per abilitare la gestione del workspace, occorre fare questo:
ja_jp: ワークスペース管理は、1 つのウィンドウの中で対話を「切り換える」能力です。 Seam はワークスペース管理を Java コードのレベルで完全に透過的にします。 ワークスペース管理を可能にするために、必要なすべては以下の通りです。

source: Provide <emphasis>description</emphasis> text for each view id (when using JSF or Seam navigation rules) or page node (when using jPDL pageflows). This description text is displayed to the user by the workspace switchers.
fr_fr: Fournir un texte de <emphasis>description</emphasis>pour chaque identifiant de vue (avec l'utilisation de JSF ou des règles de navigation Seam) ou un noeud de page (avec l'utilisation des enchainements de page jPDL). Ce texte descriptif est afficher à l'utilisateur par le commutateur d'espace de travail.
it_it: Fornire un testo di <emphasis>descrizione</emphasis> ad ogni view-id (quando si usa JSF o le regole di navigazione JSF) od il nodo della pagina (quando si usano i pageflow jPDL). Questo testo di descrizione viene mostrato all'utente attraverso lo switcher di workspace.
ja_jp: それぞれのビュー ID (JSF または Seam ナビゲーションルールを使用する場合) またはページノード (jPDL ページフロー) に<emphasis>詳細</emphasis>のテキストを入力します。 この詳細テキストはワークスペース切り替えによってユーザーに表示されます。

source: Include one or more of the standard workspace switcher JSP or facelets fragments in your pages. The standard fragments support workspace management via a drop down menu, a list of conversations, or breadcrumbs.
fr_fr: Inclure un ou plusieurs commutateur d'espace de travail standards JSP ou fragment de facelets dans vos pages. Les fragments standards supportent le gestionnaire d'espace de travail via un menu par liste sélectionnable, ou par fil d'ariane.
it_it: Includere uno o più switcher JSP standard di workspace oppure frammenti facelets nelle proprie pagine. I frammenti standard supportano la gestione del workspace attraverso un menu dropdown, una lista di conversazioni, oppure breadcrumb.
ja_jp: ページの中に 1 つ以上の標準ワークスペース切り替え JSP または facelets の断片を含ませます。 標準の断片はドロップダウンメニュー、 対話のリスト、 ブレッドクラム (breadcrumbs) を通じてワークスペース管理をサポートします。

source: Workspace management and JSF navigation
fr_fr: Le gestionaire d'espace de trvail et la navigation JSF
it_it: Gestione del workspace e navigazione JSF
ja_jp: ワークスペース管理と JSF ナビゲーション

source: When you use JSF or Seam navigation rules, Seam switches to a conversation by restoring the current <literal>view-id</literal> for that conversation. The descriptive text for the workspace is defined in a file called <literal>pages.xml</literal> that Seam expects to find in the <literal>WEB-INF</literal> directory, right next to <literal>faces-config.xml</literal>:
fr_fr: Quand vous utiliser les règles de navigation Seam ou JSF, Seam bascule d'une conversation en restorant le <literal>view-id</literal> courrant pour cette conversation. Le texte descriptif pour l'espace de travail est défini dans un fichier appelé <literal>pages.xml</literal> ainsi Seam s'attend à trouver dans le dossier <literal>WEB-INF</literal>, tout à côté de <literal>faces-config.xml</literal>:
it_it: Quando si usano JSF o le regole di navigazione di Seam, Seam cambia la conversazione ripristinando l'attuale <literal>view-id</literal> per quella conversazione. Il testo descrittivo per il workspace viene definito in un file chiamato <literal>pages.xml</literal> che Seam si aspetta di trovare nella directory <literal>WEB-INF</literal>, giusto dove si trova <literal>faces-config.xml</literal>:
ja_jp: JSF または Seam ナビゲーションルールを使用する場合、 Seam は対話の現在の <literal>view-id</literal> を復元してその対話に切り替えます。 ワークスペースの記述的なテキストは <literal>pages.xml</literal> と呼ばれるファイルで定義され、 Seam はこのファイルが <literal>WEB-INF</literal> ディレクトリ内の <literal>faces-config.xml</literal> のすぐ次に配置されていることを期待します。

source: Note that if this file is missing, the Seam application will continue to work perfectly! The only missing functionality will be the ability to switch workspaces.
fr_fr: Botez que si le fichier est manquant, l'application Seam continura de fonctionner parfaitement! La seule fonctionnalité manquante sera la capacité de basculer dans les espaces de travail.
it_it: Si noti che se questo file manca, l'applicazione Seam continuerà a funzionare perfettamente! La sola cosa che mancherà sarà la possibilità di cambiare workspace.
ja_jp: このファイルが期待する場所になくても Seam アプリケーションは正常に動作を続行します。 動作しない機能はワークスペースの切り替え機能のみです。

source: Workspace management and jPDL pageflow
fr_fr: Le gestionnaire d'espace de travail et l'enchainement de page jPDL
it_it: Gestione del workspace e pageflow jPDL
ja_jp: ワークスペース管理と jPDL ページフロー

source: When you use a jPDL pageflow definition, Seam switches to a conversation by restoring the current jBPM process state. This is a more flexible model since it allows the same <literal>view-id</literal> to have different descriptions depending upon the current <literal>&lt;page&gt;</literal> node. The description text is defined by the <literal>&lt;page&gt;</literal> node:
fr_fr: Quand vous utilisez une définition d'enchainement de page jPDL, Seam bascule vers une conversation en restorant l'état du processus jBPM courant. Ceci est beaucoup plus flexible depuis qu'il permet au même <literal>view-id</literal> d'avoir plusieurs descriptions selon le noeud <literal>&lt;page&gt;</literal> courrant. Le texte descriptif est défini dans le noeud <literal>&lt;page&gt;</literal>:
it_it: Quando si usa una definizione di pageflow jPDL, Seam cambia la conversazione ripristinando il corrente stato del processo jBPM. Questo è un modello più flessibile poiché consente allo stesso <literal>view-id</literal> di avere descrizioni differenti a seconda del nodo corrente <literal>&lt;page&gt;</literal>. Il testo di descrizione è definito dal nodo <literal>&lt;page&gt;</literal>:
ja_jp: jPDL ページフロー定義を使う場合、 Seam は現在の jBPM のプロセス状態を復元することによって対話に切り替えます。 同じ <literal>view-id</literal> に現在の <literal>&lt;page&gt;</literal> に応じて異なる詳細を持たせることができるためこれはより柔軟なモデルになります。 詳細テキストは <literal>&lt;page&gt;</literal> ノードで定義されます。

source: The conversation switcher
fr_fr: Le commutateur de conversation
it_it: Lo switcher delle conversazioni
ja_jp: 対話切り替え

source: Include the following fragment in your JSP or facelets page to get a drop-down menu that lets you switch to any current conversation, or to any other page of the application:
fr_fr: Inclure les fragments suivant dans votre page facelets ou JSP pour avoir le menu à liste sélectionnable qui vous permet de basculer vers n'importe quelle conversation courante, ou vers n'importe quelle page de l'application:
it_it: Includere il seguente frammento nella pagina JSP o facelets per ottenere un menu dropdown che consenta di cambiare la conversazione, o la pagina dell'applicazione:
ja_jp: 次の断片を JSP または facelets のページに含ませて、 現在の対話またはその他いずれのアプリケーションのページにも切り替えられるドロップダウンメニューを取得します。

source: In this example, we have a menu that includes an item for each conversation, together with two additional items that let the user begin a new conversation.
fr_fr: Dans cet exemple, nous avons un menu qui inclus un élément pour chaque conversation, regroupé avec deux éléments additionnels qui permet à l'utilisateur de commencer une nouvelle conversation.
it_it: In quest'esempio si ha un menu che include un item per ogni conversazione, assieme a due item aggiuntivi che consentono all'utente di iniziare una nuova conversazione.
ja_jp: この例では、 ユーザーに新しい対話を開始させる 2 つの追加アイテムに加えて、 各対話のためのアイテムを含むメニューがあります。

source: Only conversations with a description (specified in <literal>pages.xml</literal>) will be included in the drop-down menu.
fr_fr: Seulement les conversations avec une description (spécifiée dans <literal>pages.xml</literal>) seront incluses dans le menu à liste sélectionnable.
it_it: Solo le conversazioni con una descrizione (specificata in <literal>pages.xml</literal>) verranno incluse nel menu dropdown.
ja_jp: 詳細を持つ対話 (<literal>pages.xml</literal> で指定) のみがドロップダウンメニューに含まれます。

source: The conversation list
fr_fr: La liste de conversation
it_it: La lista delle conversazioni
ja_jp: 対話一覧

source: The conversation list is very similar to the conversation switcher, except that it is displayed as a table:
fr_fr: La liste des conversations est vraiment similaire au commutateur de conversation, exception faite qu'elle est affiché comme un tableau:
it_it: La lista delle conversazioni è molto simile allo switcher delle conversazioni, tranne che viene mostrata come tabella:
ja_jp: 対話一覧は対話切り替えに非常によく似ていますが、 表形式で表示される点が異なります。

source: We imagine that you will want to customize this for your own application.
fr_fr: Nous imaginons que nous allons vouloir la personnaliser pour notre application.
it_it: Si immagini di voler personalizzare questo per la propria applicazione.
ja_jp: 恐らく、 多くの方が独自のアプリケーションに合うようカスタマイズを希望するだろうと思います。

source: Only conversations with a description will be included in the list.
fr_fr: Seule les conversations avec une description seront incluse dans la liste.
it_it: Solo le conversazioni con una descrizione verranno incluse nella lista.
ja_jp: 詳細を持つ対話のみがこの一覧に含まれます。

source: Notice that the conversation list lets the user destroy workspaces.
fr_fr: Il faut noter que la liste de conversation permet à l'utilisateur de détruire les espaces de travail.
it_it: Si noti che la lista delle conversazioni consente all'utente di distruggere i workspace.
ja_jp: 対話一覧によりユーザーがワークスペースを破壊することができるので留意してください。

source: Breadcrumbs are useful in applications which use a nested conversation model. The breadcrumbs are a list of links to conversations in the current conversation stack:
fr_fr: Les fils d'ariane sont vraiment très utile dans les applications qui utilisent un modèle de conversations liée. Le fil d'ariane est une list de liens vers les conversations dans la pile de conversation courante:
it_it: I breadcrumb sono utili nelle applicazioni che usano il modello di conversazioni innestato. I breadcrumb sono una lista di link alle conversazioni nell'attuale stack di conversazioni:
ja_jp: ブレッドクラムは、 ネストされた対話モデルを使うアプリケーションで役に立ちます。 ブレッドクラムは、 現在の対話スタック内の対話へのリンクの一覧になります。

source: Conversational components and JSF component bindings
fr_fr: Les composants conversationnels et la liaison avec les composants JSF
it_it: Componenti conversazionali ed associazione ai componenti JSF
ja_jp: 対話型コンポーネントと JSF コンポーネントのバインディング

source: Conversational components have one minor limitation: they cannot be used to hold bindings to JSF components. (We generally prefer not to use this feature of JSF unless absolutely necessary, since it creates a hard dependency from application logic to the view.) On a postback request, component bindings are updated during the Restore View phase, before the Seam conversation context has been restored.
fr_fr: Les composants conversationnels ont une limitation mineure; ils ne peuvent être utilisé pour conserver une liaison vers des composants JSF. (Nous préférons générallement ne pas utiliser cette fonctionnalité avec JSF à moins que cela ne soit absolument nécssaire, car cela créer une dépendance forte de la logique applicative vers la vue). Avec une requête de retour,la liaison de composant est mise à jours pendant la phase de restoration de la vue, avant que le contexte conversationnel de Sean ne soit restoré.
it_it: I componenti conversazionali hanno una piccola limitazione: non possono essere usati per mantenere un riferimento ai componenti JSF. (In generali si preferisce non usare questa funzionalità di JSF amenoché sia assolutamente necessario, poiché questo crea una dipendenza stretta della logica dell'applicazione con la vista.) Sulle richieste postback, i binding dei componenti vengono aggiornati durante la fase restore view, prima che il contesto della conversazione di Seam venga ripristinato.
ja_jp: 重要ではありませんが、 JSF コンポーネントへのバインディングの保持には使用できないという制限が対話型コンポーネントにはあります。 (一般的には、 アプリケーション論理からビューに対する強い依存関係を作ってしまうため、 絶対的に必要でない限り一般的にはこの JSF の機能は使用しないようにした方がよいでしょう。) postback 要求で、 Seam 対話コンテキストが復元される前、 ビューの復元フェーズ中にコンポーネントのバインディングは更新されます。

source: To work around this use an event scoped component to store the component bindings and inject it into the conversation scoped component that requires it.
fr_fr: Pour contourner ceci, utilisez un composant d'étendue évènement pour conserver la liaison du composant et l'injecter dans le composant d'étendue conversationnel qui en a besoin.
it_it: Per aggirare questo si usa un componente con scope evento per memorizzare i binding dei componenti ed per iniettarlo nel componente a scope conversazione che lo richiede.
ja_jp: これを回避するには、 イベントスコープコンポーネントを使ってコンポーネントバインディングを格納し、 それを必要とする対話スコープコンポーネントにインジェクトします。

source: Also, you can't inject a conversation scoped component into an event scoped component which you bind a JSF control to. This includes Seam built in components like <literal>facesMessages</literal>.
fr_fr: De même, vous ne pouvez pas injecter un composant d'étendue conversationnel dans un composant d'étendue d'évènement que vous liez avec un contrôle JSF. Ceci inclu les composants livrés de Seam comme <literal>facesMessages</literal>.
it_it: Inoltre non si può iniettare un componente con scope conversazione in un componente con scope evento a cui associare il controllo JSF. Questo include i componenti predefiniti Seam come <literal>facesMessages</literal>.
ja_jp: また、 対話スコープのコンポーネントを JSF コントロールのバインド先となるイベントスコープのコンポーネントにはインジェクトできません。 これには <literal>facesMessages</literal> のようなコンポーネント内での Seam 構築が含まれます。

source: Alternatively, you can access the JSF component tree through the implicit <literal>uiComponent</literal> handle. The following example accesses <literal>getRowIndex()</literal> of the <literal>UIData</literal> component which backs the data table during iteration, it prints the current row number:
fr_fr: L'alternative est que vous pouvez accéder à l'arbre de composant JSF au traver d'une référence <literal>uiComponent</literal> implicite. L'exemple suivant accède <literal>getRowIndex()</literal> du composant <literal>UIData</literal> qui conserve le tableau de données pendant l'itération, il affiche le numéro de ligne courrant:
it_it: In alternativa si può accedere all'albero del componente JSF attraverso l'handle implicito <literal>uiComponent</literal>. Il seguente esempio accede a <literal>getRowIndex()</literal> del componente <literal>UIData</literal> che è retrostante alla tabella dei dati durante l'interazione, e stampa il numero della riga corrente:

source: JSF UI components are available with their client identifier in this map.
fr_fr: Les composant UI de JSF sont disponibles avec leurs identifiants de client dans cette table de hachage.
it_it: I componenti JSF UI sono disponibili in questa mappa con il loro identificatore di client.
ja_jp: JSF UI のコンポーネントはこのマップ内のクライアント識別子で使用可能になります。

source: Concurrent calls to conversational components
fr_fr: Les appels concurentiels de composants conversationnels
it_it: Chiamare concorrenti ai componenti conversazionali
ja_jp: 対話的コンポーネントへの並列コール

source: A general discussion of concurrent calls to Seam components can be found in <xref linkend="concurrency"/>. Here we will discuss the most common situation in which you will encounter concurrency &#8212; accessing conversational components from AJAX requests. We're going to discuss the options that a Ajax client library should provide to control events originating at the client &#8212; and we'll look at the options RichFaces gives you.
fr_fr: Une discussion général d'appel concurentiel des composants de Seam peut être trouvée dans <xref linkend="concurrency"/>. Ici, nous allons discuter de la situation la plus courante où vous allez rencontrer de la concurence &#8212; l'accès aux composants conversationnel depuis les requêtes AJAX. Nous aloons discuter des options que les bibliothèque AJAX cliente devraient fournir pour controler les évènements provenant du client &#8212; et nous allons voir l'option que RichFaces vous offre.
it_it: Una discussione generale sulle chiamate concorrenti ai componenti Seam può essere trovata in <xref linkend="concurrency"/>. Qua si discuterà la situazione più comune in cui si troverà la concorrenza &#8212; accedendo a componenti conversazionali da richieste AJAX. Si dicuteranno le opzioni che la libreria client Ajax dovrebbe fornire per controllare gli eventi originati nel client &#8212; e si vedranno le opzioni che fornisce RichFaces.
ja_jp: Seam コンポーネントへの並列コールに関する全般は <xref linkend="concurrency"/> でご覧ください。 ここでは並列が発生する最も一般的な状況について説明しています (AJAX 要求から対話的コンポーネントにアクセスする)。 クライアントで発生したイベントの制御に Ajax クライアントライブラリが提供すべきオプションについて説明してから RichFaces で提供されるオプションについて見ていきます。

source: Conversational components don't allow real concurrent access therefore Seam queues each request to process them serially. This allows each request to be executed in a deterministic fashion. However, a simple queue isn't that great &#8212; firstly, if a method is, for some reason, taking a very long time to complete, running it over and over again whenever the client generates a request is bad idea (potential for Denial of Service attacks), and, secondly, AJAX is often to used to provide a quick status update to the user, so continuing to run the action after a long time isn't useful.
fr_fr: Les composants conversationnels ne permettent pas un accès réellement concurentiel à moins que Seam ne mette en file d'attente chaque requête pour les réaliser séquenciellement. Ceci permet à chaque requête d'être exécutée de façon déterministe. Cependant une simple file d'attente n'est pas aussi géniale &#8212; en premier lieu, si uen méthode prend, pour une raison quelconque, un très long moment pour se terminer, exécuter encore une par dessus , et encore une autre, tant et plus que le client génère une requête est une mauvaise idée (attaque potentielle par Dénie de Service) et en second, AJAX est souvent utilisé pour fournir une mise à jours rapide d'un status à l'utilisateur, donc continuer à exécuter l'action après un bout de temps n'est pas très utile.
it_it: I componenti conversazionali non consentono una vero accesso concorrente, e quindi Seam accoda ogna richiesta per poi processarla in modo seriale. Questo consente ad ogni richiesta di venir eseguita in un modo deterministico. Comunque, una semplice cosa non è cosa ottima &#8212; in primo luogo, se un metodo per qualche ragione impiega molto tempo a terminare, eseguirlo più volte quando il client genera una richiesta, è una cattiva idea (potenziale per attacchi di tipo Denial of Service), ed in secondo luogo, AJAX spesso viene usato per fornire un veloce aggiornamento dello stato all'utente, e così continuare ad eseguire l'azione per lungo tempo non è utile.
ja_jp: 対話的コンポーネントでは実際の並列アクセスは許可されないので、 Seam は要求を連続的に処理するようそれぞれを待ち行列に入れます。 これにより各要求は決定論的に実行されるようになります。 ただし、 シンプルなキューはあまりよくありません。 まず、 メソッドがなんらかの理由で完了に長時間かかっている場合、 クライアントが要求を生成するたび繰り返してそれを実行するのはよくありません (サービス妨害攻撃の可能性)。 また、 ユーザーに対するステータスのクィックアップデートに AJAX が頻繁に使用されるためアクションを長時間実行し続けるのは実用的ではありません。
