Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Conversations.po
Languages: fr_fr, it_it, ja_jp

source: Conversations and workspace management
fr_fr: Les conversations et le gestionnaire de l'espace de travail
it_it: Conversazioni e gestione del workspace
ja_jp: 対話とワークスペースの管理

source: It's time to understand Seam's conversation model in more detail.
fr_fr: Il est temps de comprendre le modèle conversationnel de manière plus détaillée.
it_it: E' ora di capire il modello di conversazione di Seam con maggior dettaglio.
ja_jp: 本章では、 そろそろ Seam の対話モデルについて詳細に理解していくことにします。

source: Historically, the notion of a Seam "conversation" came about as a merger of three different ideas:
fr_fr: Historiquement, la notion d'une "conversation" de Seam vient de la fusion de trois idées différentes:
it_it: Storicamente la nozione di "conversazione" Seam si presenta come unificatrice di tre differenti idee:
ja_jp: 事のはじまりは、 3 つの思いつきが融合した結果、 Seam 「対話」の概念となったことです。

source: The idea of a <emphasis>workspace</emphasis>, which I encountered in a project for the Victorian government in 2002. In this project I was forced to implement workspace management on top of Struts, an experience I pray never to repeat.
fr_fr: L'idée d'un <emphasis>espace de travail</emphasis>, que j'ai rencontré dans un projet pour le gouvernement Victorien en 2002. Dans ce projet, j'étais obligé d'implémenter un gestionnaire d'espace de travail par dessus Struts, une expérience que j'espère ne jamais plus répétée.
it_it: L'idea di uno <emphasis>spazio di lavoro (workspace)</emphasis>, che ho incontrato in un progetto per il governo Vittoriano nel 2002. In questo progetto fui obbligato ad implementare la gestione del workspace sopra Struts, un'esperienza che prego di non ripetere mai più.
ja_jp: <emphasis>ワークスペース</emphasis> という思いつき、 これは 2002 年にビクトリア州政府 (オーストラリア) のプロジェクトで思いつきました。 このプロジェクトで、私は Struts の上にワークスペース管理を実装せざるを得なくなりました。2 度と繰り返したいとは思わないような経験でした。

source: The idea of an <emphasis>application transaction</emphasis> with optimistic semantics, and the realization that existing frameworks based around a stateless architecture could not provide effective management of extended persistence contexts. (The Hibernate team is truly fed up with copping the blame for <literal>LazyInitializationException</literal>s, which are not really Hibernate's fault, but rather the fault of the extremely limiting persistence context model supported by stateless architectures such as the Spring framework or the traditional <emphasis>stateless session facade</emphasis> (anti)pattern in J2EE.)
fr_fr: L'idée d'une <emphasis>transaction d'application</emphasis> avec une sémantique optimiste, et que la réalisation d'un serveur d'application basé autour d'une architecture sans état ne peut fournir une gestion efficace des contextes de persistences étendues. (L'équipe Hibernate est réellement écoeurée d'être accusé pour toutes les <emphasis>LazyInitializationExceptions</emphasis>, ce qui n'est pas vraiment la faute d'Hibernate, mais plutôt la faute de la persistence extrèmement limitée du modèle de contexte supporté par les architectures sans état comme le serveur d'application Spring ou le traditionnel (anti)pattron <emphasis>facade de session sans état</emphasis> dans J2EE.)
it_it: L'idea di una <emphasis>transazione per l'applicazione</emphasis> con semantica ottimista, e il convincimento che i framework esistenti basati su un'architettura stateless non potessero fornire una gestione efficiente dei contesti di persistenza estesa. (La squadra di Hibernate è veramente stanca di sentire lamentele per le <literal>LazyInitializationException</literal>, che non è in verità colpa di Hibernate, ma piuttosto colpa di un modello di contesto di persistenza estremamente limitato delle architetture stateless come il framework Spring o il tradizionale (anti)pattern <emphasis>stateless session facade</emphasis> in J2EE.)
ja_jp: 楽観的セマンティクスで動作する<emphasis>アプリケーショントランザクション</emphasis>という思いつきに加え、 ステートレスなアーキテクチャをベースとする既存のフレームワークでは拡張された永続コンテキストの効率的な管理は実現できないことを実感した事実でした。 (Hibernate チームは <literal>LazyInitializationException</literal> に対する非難は聞き飽きていましたし、 実際にはこれは Hibernate に問題があるのではなく、 むしろ Spring フレームワークや J2EE における従来の <emphasis>stateless session facade</emphasis> (anti) パターンなどステートレスアーキテクチャでサポートされる極端に限定的な永続コンテキストモデルに問題があったのです。)

source: The idea of a workflow <emphasis>task</emphasis>.
fr_fr: L'idée d'un enchainement de <emphasis>tâches</emphasis>.
it_it: L'idea di un <emphasis>task</emphasis> a workflow.
ja_jp: ワークフロー<emphasis>タスク</emphasis>という思いつき

source: By unifying these ideas and providing deep support in the framework, we have a powerful construct that lets us build richer and more efficient applications with less code than before.
fr_fr: En unifiant ces idées et en fournissant un profond support dans le squellete d'application, nous avons une construction percutante qui nous permets de construire de plus riche et de plus éfficace applications avec moins de code qu'auparavant.
it_it: Unificando queste idee e fornendo un supporto profondo nel framework, si ha un costrutto potente che consente di creare applicazioni più ricche e più efficienti con meno codice di prima.
ja_jp: こうした思いつきを統一しフレームワークで強力なサポートを提供することで、 以前よりすっきりしたコードでより豊かで効率的なアプリケーションをビルドできるパワフルな構成概念を得ました。

source: Seam's conversation model
fr_fr: Le modèle conversationnel de Seam
it_it: Il modello di conversazioni di Seam
ja_jp: Seam の対話モデル

source: The examples we have seen so far make use of a very simple conversation model that follows these rules:
fr_fr: Les exemples que nous avons vu jusque là utilisent un modèle conversationnel très simple qui suit ces règles:
it_it: Gli esempi visti finora usano un modello di conversazione molto semplice che segue queste regole:
ja_jp: これまでに見た例は、以下の規則に従う非常に単純な対話モデルを利用します。

source: There is always a conversation context active during the apply request values, process validations, update model values, invoke application and render response phases of the JSF request lifecycle.
fr_fr: l y a toujours un contexte conversationnel actif pendant l'application des valeurs de la requête, l'exécution des validations, la mise à jours des valeurs du modèles, l'invocation de l'application et le rendu des phases de responses du cycle de vie de la requête JSF.
it_it: C'è sempre un contesto di conversazione attivo durante le fasi di apply request values, process validations, update model values, invoke application e render response del ciclo di vita della richiesta JSF.
ja_jp: JSF 要求ライフサイクルである、 要求値の適用、 プロセスの妥当性検証、 モデル値の更新、 アプリケーションの呼び出し、 応答のレンダリングの各フェーズの期間、 常にアクティブな対話コンテキストがあります。

source: At the end of the restore view phase of the JSF request lifecycle, Seam attempts to restore any previous long-running conversation context. If none exists, Seam creates a new temporary conversation context.
fr_fr: A la fin de la phase de restoration de la vue du cycle de vie de la requête JSF, Seam essaye de restorer tout contexte conversationnel à éxécution longue. Si aucun n'existe, Seam crée un nouveau contexte conversationnel temporaire.
it_it: Alla fine della fase restore view del ciclo di vita della richiesta JSF, Seam tenta di ripristinare ogni precedente contesto di conversazione long-running. Se non ne esiste nessuno, Seam crea un nuovo contesto di conversazione temporanea.
ja_jp: JSF 要求ライフサイクルであるビューの復元フェーズの終わりで、 Seam はそれまでの長期対話コンテキストの復元を試みます。 存在しなければ、 Seam は新しい一時的な対話コンテキストを生成します。

source: When an <literal>@Begin</literal> method is encountered, the temporary conversation context is promoted to a long running conversation.
fr_fr: Quand une méthode <literal>@Begin</literal> est rencontrée, le contexte conversationnel temporaire est promu en conversation à exécution longue.
it_it: Quando viene incontrato un metodo <literal>@Begin</literal>, il contesto della conversazione temporanea è promosso a conversazione long-running.
ja_jp: <literal>@Begin</literal> メソッドが出てくると、 一時的な対話コンテキストは長期対話に昇格します。

source: When an <literal>@End</literal> method is encountered, any long-running conversation context is demoted to a temporary conversation.
fr_fr: Quand la méthode <literal>@End</literal> est rencontré , chaque contexte conversationnel à exécution longue est dégommé en conversation temporaire.
it_it: Quando viene incontrato un metodo <literal>@End</literal>, il contesto della conversazione long-running è ridotto a conversazione temporanea.
ja_jp: <literal>@End</literal> メソッドが出てくると、 どのような長期対話コンテキストでも一時的な対話に降格されます。

source: At the end of the render response phase of the JSF request lifecycle, Seam stores the contents of a long running conversation context or destroys the contents of a temporary conversation context.
it_it: Alla fine della fase di render response del ciclo di vita della richiesta JSF, Seam memorizza i contenuti del contesto di conversazione long-running o distrugge i contenuti del contesto di conversazione temporanea.
ja_jp: JSF 要求ライフサイクルである応答のレンダリングのフェーズの終わりで、 Seam は長期対話コンテキストの内容を記憶するか、 一時的な対話コンテキストの内容を破棄します。

source: Any faces request (a JSF postback) will propagate the conversation context. By default, non-faces requests (GET requests, for example) do not propagate the conversation context, but see below for more information on this.
fr_fr: Chaque requête face (un postback JSF) va propager le contexte conversationnel. Par défaut, les requêtes non-faces (requêtes GET, par exemple), ne propage pas le contexte conversationnel, mais regardez ci-dessous pour plus d'information à propos de cela.
it_it: Qualsiasi richiesta faces (un postback JSF) si propagherà nel contesto della conversazione. Di default le richieste non-faces (richieste GET, per esempio) non si propagano nel contesto di conversazione, si veda sotto per maggiori informazioni.
ja_jp: どのような faces 要求 (JSF ポストバック) でも対話コンテキストを伝播します。 デフォルトでは、 non-faces 要求 (例えば、 GET 要求) は対話コンテキストを伝播しませんが、 これについての詳細は下記を参照してください。

source: If the JSF request lifecycle is foreshortened by a redirect, Seam transparently stores and restores the current conversation context &#8212; unless the conversation was already ended via <literal>@End(beforeRedirect=true)</literal>.
fr_fr: Si le cycle de vie de la requête JSF est réduit par une redirection, Seam entreprose de manière transparente et restitue le contexte conversationnel courrant &#8212; à moins que la conversation n'est été déjà terminée via <literal>@End(beforeRedirect=true)</literal>.
it_it: Se il ciclo di vita della richiesta JSF viene accorciato da un redirect, Seam memorizza e ripristina in modo trasparente il contesto dell'attuale conversazione &#8212; amenoché la conversazione sia già stata terminata tramite <literal>@End(beforeRedirect=true)</literal>.

source: Seam transparently propagates the conversation context (including the temporary conversation context) across JSF postbacks and redirects. If you don't do anything special, a <emphasis>non-faces request</emphasis> (a GET request for example) will not propagate the conversation context and will be processed in a new temporary conversation. This is usually - but not always - the desired behavior.
fr_fr: Seam propage de manière transparente le contexte conversationnel au travers des postbacks JSF et des redirections. Si vous ne voulez pas faire quelquechose de spécial, une <emphasis>requête non-faces</emphasis> (une requête GET par exemple) ne va pas propager le contexte conversationnel et va être exécuté dans une nouvelle conversdation temporaire. C'est habituellement- mais pas toujours- le fonctionnement désiré.
it_it: Seam propaga in modo trasparente il contesto della conversazione (includendo il contesto della conversazione temporanea) lungo i postback JSF e i redirect. Se non si fa niente di speciale, una <emphasis>richiesta non-faces</emphasis> (per esempio una richiesta GET) non verrà propagata nel contesto di conversazione e non verrà processata in una conversazione temporanea. Questo è solitamente - ma non sempre - il comportamento desiderato.
ja_jp: Seam は透過的に対話コンテキスト (一時的な対話コンテキストを含む) を JSF ポストパックおよびリダイレクト全体に伝播します。 特に何もしなければ <emphasis>非 faces 要求</emphasis> (たとえば GET 要求など) は対話コンテキストを伝播せず新しい一時的な対話内で処理されます。 常にとは限りませんが、 これが通常求められる動作になります。

source: If you want to propagate a Seam conversation across a non-faces request, you need to explicitly code the Seam <emphasis>conversation id</emphasis> as a request parameter:
fr_fr: Si vous voulez propager une conversation Seam au travers d'une requête non-faces, vous devez explicitement coder <emphasis>l'identifiant de conversation</emphasis> comme un paramètre de requête:
it_it: Se si vuole propagare una conversazione Seam lungo una richiesta non-faces, non occorre esplicitamente codificare l'<emphasis>id della conversazione</emphasis> come parametro di richiesta:
ja_jp: non-faces 要求全体に Seam 対話を伝播させたい場合、 要求パラメータとして Seam <emphasis>対話 ID (conversation id)</emphasis> を明示的にコード化する必要があります。

source: Or, the more JSF-ish:
fr_fr: Ou beaucoup plus, JSF-ien:
it_it: O in stile più JSF:
ja_jp: JSF のようにする場合には以下のようにします。

source: If you use the Seam tag library, this is equivalent:
fr_fr: Si vous utilisez la librairie de tag de Seam, ceci est équivalent:
it_it: Se si utilizza la libreria di tag Seam, questo è l'equivalente:
ja_jp: Seam タグライブラリを使用する場合、 以下は等価です。

source: If you wish to disable propagation of the conversation context for a postback, a similar trick is used:
fr_fr: Si vous voulez désactiver la propagation du contexte conversationnel pour un postback, un truc similaire est utilisé:
it_it: Se si desidera disabilitare la propagazione del contesto di conversazione per il postback, viene usato un simile trucchetto:
ja_jp: ポストバック用の対話コンテキストの伝播を無効にしたい場合は、 同様のトリックが使えます。

source: Note that disabling conversation context propagation is absolutely not the same thing as ending the conversation.
fr_fr: Notez que la désactivation de la propgation du contexte conversationnel n'est absolument pas la même chose que finir la conversation.
it_it: Si noti che disabilitando la propagazione del contesto della conversazione non è assolutamente la stessa cosa che terminare la conversazione:
ja_jp: 対話コンテキストの伝播を無効にすることと、 対話を終了することとは全く異なることですので注意してください。

source: The <literal>conversationPropagation</literal> request parameter, or the <literal>&lt;s:conversationPropagation&gt;</literal> tag may even be used to begin a conversation, end the current conversation, destroy the entire conversation stack, or begin a nested conversation.
fr_fr: Le paramètre de requête <literal>conversationPropagation</literal> ou le tag <literal>&lt;s:conversationPropagation&gt;</literal> peut même être utilisé pour commencer ou finir la conversation liée.
it_it: Il parametro di richiesta <literal>conversationPropagation</literal>, o il tag <literal>&lt;s:conversationPropagation&gt;</literal> possono anche essere usati per iniziare e terminare una conversazione, distruggere l'intero stack di conversazione, o iniziare una conversazione innestata.

source: This conversation model makes it easy to build applications which behave correctly with respect to multi-window operation. For many applications, this is all that is needed. Some complex applications have either or both of the following additional requirements:
fr_fr: Ce modèle conversationnel rend facile de construire des applications qui traite correctement en respectant les opération multi-fenètres. Pour beaucoup d'application, c'est tout ce qu'il y a besoin. Quelques applications complexes ont besoin d'une ou des deux exigeances additionnelles suivantes:
it_it: Il modello di conversazione rende semplice costruire applicazioni che si comportano in modo corretto in presenza di operazioni con finestre multiple. Per molte applicazioni, questo è quello che serve. Alcune applicazioni complesse hanno uno ed entrambi dei seguenti requisiti aggiuntivi:
ja_jp: この対話モデルは、 マルチウィンドウ操作に関して正常に動作するアプリケーションの構築を容易してくれます。 多くのアプリケーションにとって必要なものはこれだけです。 複雑なアプリケーションのなかには以下の追加要件の両方あるいはどちらかを必要とするものがあります。

source: A conversation spans many smaller units of user interaction, which execute serially or even concurrently. The smaller <emphasis>nested conversations</emphasis> have their own isolated set of conversation state, and also have access to the state of the outer conversation.
fr_fr: Une conversation s'étend sur plusieurs petites unités d'intéraction de l'utilisateur, qui s'exécute en série ou même en concurence. Les plus petites <emphasis>conversations liées </emphasis> ont leur propre groupe d'état conversationnel isolé, et aussi ont accès à l'état des conversation externe.
it_it: Una conversazione propaga diverse unità più piccole di interazione utente, che vengono eseguite in modo seriale o anche concorrente. Le più piccole <emphasis>conversazioni innestate</emphasis> hanno il proprio stato isolato di conversazione, ed hanno anche accesso allo stato della conversazione più esterna.
ja_jp: 対話には、 連続的に実行したり同時に実行することもある多くの小さな単位のユーザーインタラクションも含まれます。 より小さい <emphasis>ネストされた対話 (nested conversation)</emphasis> には単独の対話状態セットがあり、 また外側の対話状態へのアクセスもあります。

source: The user is able to switch between many conversations within the same browser window. This feature is called <emphasis>workspace management</emphasis>.
fr_fr: L'utilisateur est aussi capable de basculer entre plusieurs conversations dans la même fenètre du navigateur. Cette fonctionnalité est appelé le <emphasis>gestionnaire d'espace de travail</emphasis>.
it_it: L'utente è in grado di passare tra più conversazioni dentro la stessa finestra del browser. Questa caratteristica è chiamata <emphasis>gestione del workspace</emphasis>.
ja_jp: ユーザーは同じブラウザのウィンドウ内でいくつもの対話を切り換えることができます。 この機能が<emphasis>ワークスペース管理</emphasis>と呼ばれるものです。

source: Nested conversations
fr_fr: Les conversations liées
it_it: Conversazioni innestate
ja_jp: ネストされた対話

source: A nested conversation is created by invoking a method marked <literal>@Begin(nested=true)</literal> inside the scope of an existing conversation. A nested conversation has its own conversation context, but can read values from the outer conversation's context. The outer conversation's context is read-only within a nested conversation, but because objects are obtained by reference, changes to the objects themselves will be reflected in the outer context.
fr_fr: Une conversation liée est créée en invoquant la métode marqué <literal>@Begin(nested=true)</literal> à l'intérieur d'une conversation existante. Une conversation liée a son propre contexte conversationnel et peut aussi lire les valeurs depuis le contexte conversationnel externe . Le contexte conversationnel externe est en lecture seul à l'intérieur d'une conversation liée mais parce que les objets sont obtenue par référence, les modifications des objets eux-même seront réfléchies dans le contexte externe.
it_it: Una conversazione innestata viene creata invocando un metodo marcato con <literal>@Begin(nested=true)</literal> dentro lo scope di una conversazione esitente. Una conversazione innestata ha un proprio contesto di conversazione, ma può leggere i valori dal contesto della conversazione più esterna. Il contesto della conversazione più esterna è in sola lettura in una conversazione innestata, ma poiché gli oggetti sono ottenuti per riferimento, i cambiamenti agli oggetti stessi si rifletteranno nel contesto più esterno.
ja_jp: ネストされた対話は既存の対話のスコープ内で <literal>@Begin(nested=true)</literal> とマークされたメソッドを呼び出すことによって作成されます。 ネストされた対話はそれ自体の対話コンテキストを持っていますが、 外側の対話のコンテキストから値を読み取ることができます。 オブジェクトは参照により取得されるため外側の対話のコンテキストはネストされた対話内では読み取り専用となりますが、 オブジェクト自体への変更はその外側のコンテキストに反映されます。

source: Nesting a conversation through initializes a context that is stacked on the context of the original, or outer, conversation. The outer conversation is considered the parent.
fr_fr: En liant au travers d'une conversation initialise un contexte qui sera empilé sur le contexte de la conversation orginelle ou externe. La conversation externe est considéré comme la parente.
it_it: Innestando una conversazione si inizializza un contesto che viene messo sullo stack del contesto della conversazione originale, o più esterna. La conversazione più esterna è considerata padre.
ja_jp: 対話をネストするとオリジナルの対話または外側の対話のコンテキストに積み重ねられるコンテキストを初期化します。 外側の対話が親とみなされます。

source: Any values outjected or directly set into the nested conversation’s context do not affect the objects accessible in the parent conversation’s context.
fr_fr: Toute valeurs extradée ou directement défini dans le contexte conversationnelle lié n'affectera pas l'accéssibilité des objets dans le contexte conversationnel parent.
it_it: Ogni valore messo in outjection o direttamente impostato nel contesto della conversazione innestata non influenza gli oggetti accessibili nel contesto della conversazione padre.
ja_jp: ネストされた対話のコンテキストに直接セットされるまたはアウトジェクトされる値はすべて親となる対話のコンテキスト内にアクセス可能なオブジェクトに影響は与えません。

source: Injection or a context lookup from the conversation context will first lookup the value in the current conversation context and, if no value is found, will proceed down the conversation stack if the conversation is nested. As you will see in moment, this behavior can be overriden.
fr_fr: L'injection ou le parcours dans le contexte depuis le contexte conversaionnel cherchera en premier la valeur dans le contexte conversationnel courant et si aucune valeur n'est trouvée, descendra dans la pile de conversation si la conversation est liée. Comme vous le voyez pour l'instant, cette fonctionnalité peut être surchargée.
it_it: L'iniezione o la ricerca nel contesto da un contesto di conversazione per prima cosa cercherà il valore nell'attuale contesto e, se non viene trovato alcun valore, procederà lungo lo stack della conversazione se questa è innestata. Come si vedrà, questo comportamento può essere ridefinito.
ja_jp: 対話コンテキストからのコンテキスト検索やインジェクションはまず現在の対話コンテキストにある値を検索し、 値がみつかならないと対話がネストされている場合はその対話スタックに進みます。 このあとわかるように、 この動作は上書き可能です。

source: When an <literal>@End</literal> is subsequently encountered, the nested conversation will be destroyed, and the outer conversation will resume, by "popping" the conversation stack. Conversations may be nested to any arbitrary depth.
fr_fr: Quand un <literal>@End</literal> est par la suite rencontré, la conversation liée sera détruite et la conversation externe sera terminée, en la "retirant du dessus" de la pile des conversations. Les conversations peuvent être liée à n'importe quelle profondeur arbitraire.
it_it: Quando si incontra una <literal>@End</literal>, la conversazione innestata verrà distrutta, togliendola dallo stack (pop), e la conversazione più esterna verrà ripristinata. Le conversazioni possono essere annidate con gradi di profondità arbitrari.
ja_jp: 次に <literal>@End</literal> が出てくると、 対話スタックから「ポップ(Pop)」されることで、 その取り出された対話は破棄されます。 対話は任意の深さにネストすることができます。
