Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Conversations.po
Languages: fr_fr, it_it, ja_jp

source: Certain user activity (workspace management, or the back button) can cause the outer conversation to be resumed before the inner conversation is ended. In this case it is possible to have multiple concurrent nested conversations belonging to the same outer conversation. If the outer conversation ends before a nested conversation ends, Seam destroys all nested conversation contexts along with the outer context.
fr_fr: Certaines activités de l'utilisateur (gestionnaire de l'espace de travail ou bouton précédent) peuvent faire en sorte que la conversation externe soit reprise avant que la conversation interne ne soit finie. Dans ce cas, il est possible d'avoir de multiples conversations concurrantes liées appartenant à la même conversation externe. Si la conversation externe se fini avant que la conversation liée ne s'arrête, Seam détruit tous les contextes conversationnels liés en relation avec le contexte externe.
it_it: Certe attività utente (gestione del workspace, o il pulsante indietro) possono causare il ripristino della conversazione più esterna prima che venga terminata la conversazione innestata. In questo caso è possibile avere più conversazioni innestate concorrenti che appartengono alla stessa conversazione più esterna. Se la conversazione più esterna finisce prima che termini la conversazione innestata, Seam distrugge tutti i contesti delle conversazioni innestate assieme a quella più esterna.
ja_jp: 特定のユーザーアクティビティ (ワークスペース管理や戻るボタン) により、 内側の対話が終了する前に外側の対話が開始させることができます。 この場合、 同じ外側の対話に属する複数の並列ネスト対話を持つことができます。 ネストされた対話が終了する前に外側の対話が終了すると、 Seam はネストされた対話コンテキストを外側のコンテキストと共にすべて破棄します。

source: The conversation at the bottom of the conversation stack is the root conversation. Destroying this conversation always destroy all of its descendents. You can achieve this declaratively by specifying <literal>@End(root=true)</literal>.
fr_fr: La conversation au bas de la pil de conversation est la conversation racine. La destruction de cette conversation va toujours détruire les conversations enfantées. Vous pouvez réaliser ceci en spécifiant <literal>@End(root=true)</literal>.
it_it: La conversazione alla fine dello stack delle conversazioni è la conversazione radice. Distruggendo questa conversazione si distruggono sempre tutti i suoi discendenti. Si può ottenere questo in modo dichiarativo specificando <literal>@End(root=true)</literal>.
ja_jp: 対話スタックの最下位にある対話がルートの対話になります。 この対話を破棄すると常に派生した対話はすべて破棄されます。 <literal>@End(root=true)</literal> を指定すると宣言的にこれを行うことができます。

source: A conversation may be thought of as a <emphasis>continuable state</emphasis>. Nested conversations allow the application to capture a consistent continuable state at various points in a user interaction, thus ensuring truly correct behavior in the face of backbuttoning and workspace management.
fr_fr: Une conversation peut être imaginée comme un <emphasis>état continue</emphasis>. Les conversations liée permette à l'application de capture un état constistent et continue à plusieurs moments de l'interaction utilisateur, ainsi assurant de manière réellement correcte le focntionnement vis à vis du bouton précédent et de la gestion de l'espace de travail.
it_it: Una conversazione può essere pensata come uno <emphasis>stato continuo</emphasis>. Le conversazioni innestate consentono all'applicazione di catturare lo stato continuo consistente in vari punti durante l'interazione utente, quindi assicurando un comportamento corretto rispetto al pulsante indietro ed alla gestione del workspace.
ja_jp: 対話は<emphasis>継続可能な状態</emphasis>と見なすことができます。 ネストされた対話により、 ユーザーとの交信でのさまざまなポイントにおいてアプリケーションは一貫した継続可能な状態を捕らえることができるようになります。 従って、 戻るボタンを押すことやワークスペース管理に対して正しい動作を保証します。

source: As mentioned previously, if a component exists in a parent conversation of the current nested conversation, the nested conversation will use the same instance. Occasionally, it is useful to have a different instance in each nested conversation, so that the component instance that exists in the parent conversation is invisible to its child conversations. You can achieve this behavior by annotating the component <literal>@PerNestedConversation</literal>.
fr_fr: Comme indiqué précédemment, si un composant existe dans la conversation parente de la conversation liée courante, la conversation liée utilisera la même instance. Occasionnellement, il est utile d'avoir une instance différente pour chaque conversation liée, ainsi l'instance du composant qui existe dans la conversation parente est invisible à ses propres conversations filles. Vous pouvez avoir cette fonctionnalité en annotatant le composant <literal>@PerNestedConversation</literal>.
it_it: Come menzionato in precedenza, se un componente si trova in una conversazione padre dell'attuale conversazione innestata, la conversazione innestata userà la stessa istanza. Occasionalmente, è utile avere diverse istanze in ciascuna conversazione innestata, cosicché l'istanza del componente che si trova nella conversazione padre sia invisibile alle sue conversazioni figlie. Si può ottenere questo comportamento annotando il componente <literal>@PerNestedConversation</literal>.
ja_jp: 前述した通り、 現在ネストされている対話の親となる対話にコンポーネントが存在する場合、 このネストされている対話は同じインスタンスを使用します。ときには、 親となる対話内に存在するコンポーネントインスタンスがその子となる対話からは見えなくなるように、 ネストされるそれぞれの対話内に別々のインスタンスを持たせると便利なことがあります。 コンポーネントに <literal>@PerNestedConversation</literal> アノテーションを付けるとこれを行うことができます。

source: Starting conversations with GET requests
fr_fr: Démarrage des conversations avec les requêtes GET
it_it: Avvio di conversazioni con richieste GET
ja_jp: GET 要求を使って対話を開始する

source: JSF does not define any kind of action listener that is triggered when a page is accessed via a non-faces request (for example, a HTTP GET request). This can occur if the user bookmarks the page, or if we navigate to the page via an <literal>&lt;h:outputLink&gt;</literal>.
fr_fr: JSF ne définie aucun type d'écouteur d'action qui est déclencher quand une page est accédée via une requête non-faces (par exemple, une requête HTTP GET). Cela peut arriver si l'utilisateur fait une favori de la page, ou si nous navigons vers la page via un <literal>&lt;h:outputLink&gt;</literal>.
it_it: JSF non definisce alcun tipo di action listener da lanciare quando una pagina viene acceduta tramite una richiesta non-faces (per esempio, una richiesta HTTP GET). Questo può succedere se l'utente memorizza la pagina come segnalibro, o se si naviga nella pagina tramite un <literal>&lt;h:outputLink&gt;</literal>.
ja_jp: ページが non-faces 要求 (例、 HTTP GET 要求) 経由でアクセスされる場合、 JSF は起動されるアクションリスナーを全く定義しません。 ユーザーがそのページをブックマークする、あるいは <literal>&lt;h:outputLink&gt;</literal> からそのページに行き着く場合などに発生します。

source: Sometimes we want to begin a conversation immediately the page is accessed. Since there is no JSF action method, we can't solve the problem in the usual way, by annotating the action with <literal>@Begin</literal>.
fr_fr: Parfois nous voulons commencer une conversation immédiatement quand la page est accédée. Depuis qu'il n'y a pas de méthode d'action JSF, nous ne pouvons résoudre le problème de la manière habituelle, en annotation l'action avec<literal>@Begin</literal>.
it_it: A volte si vuole immediatamente iniziare una conversazione all'accesso della pagina. Poiché non c'è alcun metodo d'azione JSF, non si può risolvere il problema nel consueto modo, annotando l'azione con <literal>@Begin</literal>.
ja_jp: ページがアクセスされたら直ちに対話を開始したい場合があります。 JSF アクションメソッドがないため、 アクションに <literal>@Begin</literal> アノテーションを付けるという普通の方法では問題を解決することができません。

source: A further problem arises if the page needs some state to be fetched into a context variable. We've already seen two ways to solve this problem. If that state is held in a Seam component, we can fetch the state in a <literal>@Create</literal> method. If not, we can define a <literal>@Factory</literal> method for the context variable.
fr_fr: Un autre problème est levé si la page a besoin des états soient reliés dans une variable de contexte. Nous avons déjà vue deux façon de résoudre ce problème. Si l'état est retenue par un composant Seam, nous pouvons relié l'éata dans une méthode <literal>@Create</literal> . Sinon, nous pouvons définir une méthode <literal>@Factory</literal> pour la variable de contexte.
it_it: Sorge un altro problema se la pagina ha bisogno di recuperare uno stato da una variabile di contesto. Si sono già visti due modi per risolvere questo problema. Se lo stato è mantenuto in un componente Seam, si può recuperare lo stato in un metodo <literal>@Create</literal>. Se non lo è, si può definire un metodo <literal>@Factory</literal> per la variabile di contesto.
ja_jp: このページが状態をコンテキスト変数にフェッチする必要がある場合、 さらなる問題が発生します。 すでに、2 つの問題解決方法を見てきました。 Seam コンポーネントにその状態が保持される場合、 <literal>@Create</literal> メソッドでその状態をフェッチできます。 保持されていなければ、 コンテキスト変数に対して <literal>@Factory</literal> メソッドを定義することができます。

source: If none of these options works for you, Seam lets you define a <emphasis>page action</emphasis> in the <literal>pages.xml</literal> file.
fr_fr: Si aucune de ces options ne fonctionne pour vous, Seam vous permet de définir une action de page dans le fichier<literal>pages.xml</literal> file.
it_it: Se nessuna di queste opzioni funziona, Seam permette di definire una <emphasis>pagina d'azione</emphasis> nel file <literal>pages.xml</literal>.
ja_jp: これらのオプションがうまくいかない場合、 Seam では <literal>pages.xml</literal> ファイルに <emphasis>ページアクション</emphasis> を定義することができます。

source: This action method is called at the beginning of the render response phase, any time the page is about to be rendered. If a page action returns a non-null outcome, Seam will process any appropriate JSF and Seam navigation rules, possibly resulting in a completely different page being rendered.
fr_fr: Cette méthode d'action est appelé au début de la phase de rendue de la réponse, à chaque fois que la page est au moment d'être rendue. Si une actiond e page retourne une sortie non-nulle, Seam va réaliser chaque règle de navigation JSF et Seam appropriée, résultant possiblement dans une page complètement différente à être rendue.
it_it: Il metodo d'azione viene chiamato all'inizio della fase di render response, ogni volta che la pagina sta per essere generata. Se l'azione della pagina ritorna un esito non-null, Seam processerà ogni opportuna regola di JSF e Seam, e genererà un'altra pagina.
ja_jp: ページがレンダリングされるようとするときは常に、 応答のレンダリングフェーズの冒頭でこのアクションメソッドが呼び出されます。 ページアクションが null 以外の結果を返す場合、 Seam は適切な JSF および Seam ナビゲーションの規則を処理するので、 まったく異なるページがレンダリングさることになるかもしれません。

source: If <emphasis>all</emphasis> you want to do before rendering the page is begin a conversation, you could use a built-in action method that does just that:
fr_fr: Si <emphasis>tout</emphasis> ce que vous voulez faire avant de rendre la page est de commencer une conversation, vous pouvez utiliser une méthode d'action livrée qui fait juste cela:
it_it: Se <emphasis>tutto</emphasis> ciò che si vuole fare prima di generare una pagina è iniziare una conversazione, si può utilizzare un metodo d'azione predefinito che fa questo:
ja_jp: ページのレンダリング前に行いたいことが対話の開始だけなら、 組み込みアクションメソッドを次のように使用できます。

source: Note that you can also call this built-in action from a JSF control, and, similarly, you can use <literal>#{conversation.end}</literal> to end conversations.
fr_fr: Notez que vous pouvez aussi appeler cette action livrée depuis un control JSF, et , de manière simmilaire, vous pouvez utiliser <literal>#{conversation.end}</literal> pour finir les conversations.
it_it: Si noti che si può chiamare quest'azione ridefinita da un controllo JSF, ed in modo simile si può usare <literal>#{conversation.end}</literal> per terminare le conversazioni.
ja_jp: また、 この組み込みアクションは JSF コントロールからも呼び出すことができ、 同様に <literal>#{conversation.end}</literal> を使って対話を終了することができます。

source: If you want more control, to join existing conversations or begin a nested conversion, to begin a pageflow or an atomic conversation, you should use the <literal>&lt;begin-conversation&gt;</literal> element.
fr_fr: Si vous voulez plus de contrôle, pour rejoindre les conversations existantes ou commencer une conversation liée, pour commencer une enchainement de page ou une conversation insécable, vous devriez utiliser l'élément <literal>&lt;begin-conversation&gt;</literal>.
it_it: Se si vuole più controllo, per unirsi a conversazioni esistenti od iniziare una conversazione innestata, per iniziare un pageflow od una conversazione atomica, occorre usare l'elemento <literal>&lt;begin-conversation&gt;</literal>.
ja_jp: 既存の対話にジョインするあるいはネストされる対話を開始する、 ページフローまたはアトミック対話を開始するためにさらに制御が必要な場合は、 <literal>&lt;begin-conversation&gt;</literal> エレメントを使用してください。

source: There is also an <literal>&lt;end-conversation&gt;</literal> element.
fr_fr: Il y aussi un élément <literal>&lt;end-conversation&gt;</literal>.
it_it: C'è anche un elemento <literal>&lt;end-conversation&gt;</literal>.
ja_jp: また、 <literal>&lt;end-conversation&gt;</literal> エレメントもあります。

source: To solve the first problem, we now have five options:
fr_fr: Pour résoudre le premier problème, nous avons maintenant cinq options:
it_it: Per risolvere il primo problema, si hanno cinque opzioni:
ja_jp: 1 番目の問題を解決するには、 現在 5 つのオプションから選択できます。

source: Annotate the <literal>@Create</literal> method with <literal>@Begin</literal>
fr_fr: Annoter la méthode <literal>@Create</literal> avec <literal>@Begin</literal>
it_it: Annotare il metodo <literal>@Create</literal> con <literal>@Begin</literal>
ja_jp: <literal>@Create</literal> メソッドに <literal>@Begin</literal> アノテーションを追加する

source: Annotate the <literal>@Factory</literal> method with <literal>@Begin</literal>
fr_fr: Annoter la méthode <literal>@Factory</literal> avec <literal>@Begin</literal>
it_it: Annotare il metodo <literal>@Factory</literal> con <literal>@Begin</literal>
ja_jp: <literal>@Factory</literal> メソッドに <literal>@Begin</literal> アノテーションを追加する

source: Annotate the Seam page action method with <literal>@Begin</literal>
fr_fr: Annoter l'action de la page Seam avec <literal>@Begin</literal>
it_it: Annotare il metodo d'azione della pagina Seam con <literal>@Begin</literal>
ja_jp: Seam ページアクションメソッドに <literal>@Begin</literal> アノテーションを追加する

source: Use <literal>&lt;begin-conversation&gt;</literal> in <literal>pages.xml</literal>.
fr_fr: Utiliser <literal>&lt;begin-conversation&gt;</literal> dans <literal>pages.xml</literal>.
it_it: Usare <literal>&lt;begin-conversation&gt;</literal> in <literal>pages.xml</literal>.
ja_jp: <literal>pages.xml</literal> で <literal>&lt;begin-conversation&gt;</literal> を使用する

source: Use <literal>#{conversation.begin}</literal> as the Seam page action method
fr_fr: Utiliser <literal>#{conversation.begin}</literal> dans la méthode d'action de page de Seam
it_it: Usare <literal>#{conversation.begin}</literal> come metodo d'azione della pagina Seam
ja_jp: <literal>#{conversation.begin}</literal> を Seam ページアクションメソッドとして使用する

source: Requiring a long-running conversation
fr_fr: Demander une conversation à exécution longue
it_it: Richiedere una conversazione long-running

source: Certain pages are only relevant in the context of a long-running conversation. One way to "protect" such a page is to require a long-running conversation as a prerequisite to rendering the page. Fortunately, Seam has a built-in mechanism for enforcing this requirement.
fr_fr: Certaines pages ne sont pertinente que dans le contexte d'une conversation à exécution longue. Une façon de "proteger" ce type de page est de demander une conversation à exécution longue comme un prérequis pour rendre la page. Heureusement, Seam a un mécanisme livré pour mettre en place ce prérequis.
it_it: Certe pagine sono rilevanti solo nel contesto di conversazione long-running. Un modo per "proteggere" tale pagina è richiedere una conversazione long-running come prerequisito per renderizzare la pagina. Fortunatamente, Seam ha un meccanismo predefinito per forzare questa richiesta.

source: In the Seam page descriptor, you can indicate that the current conversation must be long-running (or nested) in order for a page to be rendered using the <literal>conversation-required</literal> attribute as follows:
fr_fr: Dans le descripteur de la page de Seam, vous pouvez indiquer que la conversation courante doit être à exécution longue (ou liée) pour que la page soit rendue en utilisant l'attribut <literal>conversation-required</literal> comme ci-dessous:
it_it: Nel descrittore di pagina di Seam si può indicare che la conversazione corrente sia long-running (o innestata) come requisito per poter renderizzare la pagina, usando l'attributo <literal>conversation-required</literal> come mostrato:

source: The only downside is there's no built-in way to indicate <emphasis>which</emphasis> long-running conversation is required. You can build on this basic authorization by dually checking if a specific value is present in the conversation within a page action.
fr_fr: Le seul défaut est qu'il n'y à pas de façpon livré pour indiquer <emphasis>quelle</emphasis> conversation à exécution longue est requise. Vous pouvez construire ce mécanisme d'autorisation simple en à al fois vérifiant qu'une valeur spécifique est présente dans la conversation avec une action de page.
it_it: L'unico inconveniente è che non c'è alcun modo predefinito per indicare <emphasis>quale</emphasis> conversazione long-running sia richiesta. Si può costruire un'autorizzazione base controllando se è presente un valore specifico nella conversazione dentro l'azione di pagina.

source: When Seam determines that this page is requested outside of a long-running conversation, the following actions are taken:
fr_fr: Quand Seam détermine que cette page est requise à l'extérieure d'une conversation à exécution longue, les actions suivantes interviennent:
it_it: Quando Seam determina che questa pagina è richiesta fuori da una conversazione long-running, vengono intraprese le seguenti azioni:

source: A contextual event named <literal>org.jboss.seam.noConversation</literal> is raised
fr_fr: Un évènement contextuel dénommé <literal>org.jboss.seam.noConversation</literal> est levé
it_it: Viene sollevato un evento contestuale chiamato <literal>org.jboss.seam.noConversation</literal>

source: A warning status message is registered using the bundle key <literal>org.jboss.seam.NoConversation</literal>
fr_fr: Un message de status avertissement est enregistré en utilisant la clef fournie <literal>org.jboss.seam.NoConversation</literal>
it_it: Un messaggio di avviso di stato viene registrato usando la chiave di bundle <literal>org.jboss.seam.NoConversation</literal>

source: The user is redirected to an alternate page, if defined
fr_fr: L'utilisateur est rediriger vers une page alternative, si définie
it_it: L'utente viene rediretto alla pagina alternativa, se definita

source: The alternate page is defined in the <literal>no-conversation-view-id</literal> attribute on a <literal>&lt;pages&gt;</literal> element in the Seam page descriptor as follows:
fr_fr: La page alternative est définie dans l'attribut <literal>no-conversation-view-id</literal> sur l'élément <literal>&lt;pages&gt;</literal> dans le descripteur de page de Seam comme ci-dessous:
it_it: La pagina alternativa è definita nell'attributo <literal>no-conversation-view-id</literal> in un elemento <literal>&lt;pages&gt;</literal> nel descrittore di pagina Seam come mostrato:

source: At the moment, you can only define one such page for the entire application.
fr_fr: A ce moment là, vous pouvez seulement définir un seul type de page pour toute l'application.
it_it: Al momento si può solo definire una sola pagina per l'intera applicazione.

source: Using <literal>&lt;s:link&gt;</literal> and <literal>&lt;s:button&gt;</literal>
fr_fr: L'utilisation de <literal>&lt;s:link&gt;</literal> et de <literal>&lt;s:button&gt;</literal>
it_it: Usando <literal>&lt;s:link&gt;</literal> e <literal>&lt;s:button&gt;</literal>
ja_jp: <literal>&lt;s:link&gt;</literal> と <literal>&lt;s:button&gt;</literal> の使いかた

source: JSF command links always perform a form submission via JavaScript, which breaks the web browser's "open in new window" or "open in new tab" feature. In plain JSF, you need to use an <literal>&lt;h:outputLink&gt;</literal> if you need this functionality. But there are two major limitations to <literal>&lt;h:outputLink&gt;</literal>.
fr_fr: Les liens de commande JSF réalise toujours une soumission de formulaire via JavaScript, qui casse la fonctionnalité des navigateur web de "ouvrir une nouvelle fenêtre" ou "ouvrir un nouvel onglet". En pur JSF, vous avez besoin d'utiliser un <literal>&lt;h:outputLink&gt;</literal> si vous avez besoin de la fonctionnalité. Mais il y a deux limitations majeures à <literal>&lt;h:outputLink&gt;</literal>.
it_it: I comandi link JSF eseguono sempre un invio di form tramite JavaScript, che rompe le caratteristiche dei browser "Apri in nuova finestra" o "Apri in nuova scheda". Nel semplice JSF occorre usare un <literal>&lt;h:outputLink&gt;</literal> se si vuole questa finzionalità. Ma ci sono due grandi limitazioni in <literal>&lt;h:outputLink&gt;</literal>
ja_jp: JSF コマンドリンクは常に JavaScript でフォームサブミットを行います。 これによりウェブブラウザの「新しいウィンドウで開く」または「新しいタブで開く」機能を動作させなくしてしまいます。 プレーンの JFS でこの機能が必要な場合は、 <literal>&lt;h:outputLink&gt;</literal> を使用する必要があります。 ただし、 <literal>&lt;h:outputLink&gt;</literal> には重要な制限が 2 つあります。

source: JSF provides no way to attach an action listener to an <literal>&lt;h:outputLink&gt;</literal>.
fr_fr: JSF fourni une façon d'attacher un écouteur d'action à un <literal>&lt;h:outputLink&gt;</literal>.
it_it: JSF non fornisce un modo per agganciare un action listener a <literal>&lt;h:outputLink&gt;</literal>.
ja_jp: JSF はアクションリスナーを <literal>&lt;h:outputLink&gt;</literal> につなげる方法を提供していません。

source: JSF does not propagate the selected row of a <literal>DataModel</literal> since there is no actual form submission.
fr_fr: JSF ne propage pas la ligne sélectionné dans un <literal>DataModel</literal> s'il n'y a pas réellement de soumission de formulaire.
it_it: JSF non propaga la riga selezionata di un <literal>DataModel</literal> poiché non c'è alcun invio di form.
ja_jp: 実際にフォームサブミットがないため、 JSF は選択された <literal>DataModel</literal> の列を伝播しません。
