Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Drools.po
Languages: fr_fr, it_it

source: Seam and JBoss Rules
fr_fr: Seam et Jboss Rules
it_it: Seam e JBoss Rules

source: Seam makes it easy to call JBoss Rules (Drools) rulebases from Seam components or jBPM process definitions.
fr_fr: Seam rends facile l'appel aux règles de bases de JBoss Rules (Drools) depuis les composants Seam ou la définition de processus jBPM.
it_it: Seam facilita le chiamate alle regole di JBoss Rules (Drools) dai componenti Seam o dalle definizioni di processo jBPM.

source: Installing rules
fr_fr: Installation des règles
it_it: Installazione delle regole

source: The first step is to make an instance of <literal>org.drools.RuleBase</literal> available in a Seam context variable. For testing purposes, Seam provides a built-in component that compiles a static set of rules from the classpath. You can install this component via <literal>components.xml</literal>:
fr_fr: La première étape est de rendre une instance de <literal>org.drools.RuleBase</literal> disponible dans une variable de contexte de Seam. Pour les besoins de tests, Seam fourni un composant livré qui compile un groupe de règles statiques depuis le classpath. Vous pouvez installer ce composant via <literal>components.xml</literal>:
it_it: Il primo passo è creare un'istanza di <literal>org.drools.RuleBase</literal> disponibile in una variabile del contesto di Seam. Per i test Seam fornisce un componente interno che compila un set statico di regole dal classpath. Si può installare questo componente tramite <literal>components.xml</literal>:

source: This component compiles rules from a set of DRL (<literal>.drl</literal>) or decision table (<literal>.xls</literal>) files and caches an instance of <literal>org.drools.RuleBase</literal> in the Seam <literal>APPLICATION</literal> context. Note that it is quite likely that you will need to install multiple rule bases in a rule-driven application.
fr_fr: Ce composant compiles les règles depuis un groupe de fichiers (<literal>.drl</literal>) ou d'un fichier de table de décision (<literal>.xls</literal>) et met en cache une instance de <literal>org.drools.RuleBase</literal> dans le contexte <literal>APPLICATION</literal> de Seam. Notez que c'est presque comme cela que vous allez devoir installer les bases de règles multiples dans une application conduite par les règles.
it_it: Questo componente compila le regole da un set di file DRL (<literal>.drl</literal>) o tabelle di decisione (<literal>.xls</literal>) e mette in cache un'istanza di <literal>org.drools.RuleBase</literal> nel contesto <literal>APPLICATION</literal> di Seam. Notare che è abbastanza probabile che in un'applicazione guidata dalle regole occorra installare altre basi di regole.

source: If you want to use a Drools DSL, you alse need to specify the DSL definition:
fr_fr: Si vous voulez utiliser un Drools DSL, vous avez aussi besoin de spécifier la définition DSL :
it_it: Se si vuole utilizzare una Drool DSL, devi specificare la definizione DSL:

source: Support for Drools RuleFlow is also available and you can simply add a <literal>.rf</literal> or a <literal>.rfm</literal> as part of your rule files as:
fr_fr: Le support de Drools RuleFlow est aussi disponible et peut vous simplifier l'ajout de <literal>.rf</literal> ou de <literal>.rfm</literal> comme morceau de vos fichiers de règles comme:
it_it: E' disponibile il supporto a Drools RuleFlow ed è possibile aggiungere un <literal>.rf</literal> o <literal>.rfm</literal> come parte dei file delle regole:

source: Note that when using the Drools 4.x RuleFlow (<literal>.rfm</literal>) format, you need to specify the -Ddrools.ruleflow.port=true system property on server startup. This is however still an experimental feature and we advise to use the Drools5 (<literal>.rf</literal>) format if possible.
fr_fr: Notez qu'avec l'utilisation du format Drools 4.x RuleFlow (<literal>.rfm</literal>), vous allez avoir besoin de spécifier la propriété système -Ddrools.ruleflow.port=true au démarrage du serveur. Ceci est cependant toujours une fonctionnalité expérimentale et nous conseillons d'utiliser le format Drools5 (<literal>.rf</literal>) si possible.
it_it: Si noti che quando si usa il formato Drools 4.x RuleFlow (<literal>.rfm</literal>) occorre specificare la proprietà di sistema -Ddrools.ruleflow.port=true all'avvio del server. Questa è una funzionalità sperimentale e si consiglia l'uso del formato Drools5 (<literal>.rf</literal>) se possibile.

source: If you want to register a custom consequence exception handler through the RuleBaseConfiguration, you need to write the handler, for example:
fr_fr: Si vous voulez enregistrer un gestionnaire d'exception de conséquence particulière ay travers de RuleBaseConfiguration, vous allez devoir écrire le gestionnaire, par exemple:
it_it: Se si vuole registrare un handler personalizzato per le eccezioni tramite RuleBaseConfiguration, occorre scrivere l'handler, per esempio:

source: and register it:
fr_fr: et l'enregistrer:
it_it: e registrarlo:

source: In most rules-driven applications, rules need to be dynamically deployable, so a production application will want to use a Drools RuleAgent to manage the RuleBase. The RuleAgent can connect to a Drools rule server (BRMS) or hot deploy rules packages from a local file repository. The RulesAgent-managed RuleBase is also configurable in <literal>components.xml</literal>:
fr_fr: Dans la plus part des applications conduites par les règles, les règles doivent être déployable dynamiquement pour que l'application en production qui veux utiliser un Drools RuleAgent pour gérer la RuleBase. Le RuleAgent peut se connecter au seveur de règle Drools (BRMS) ou aux packages de règles déployés à chauds depuis le référenciel de fichier local. La RuleBase gérant le RulesAgent-managed est aussi configurable dans <literal>components.xml</literal>:
it_it: Nella maggior parte delle applicazioni guidate dalle regole, le regole devono essere dinamicamente deployabili, e quindi un'applicazione in produzione dovrà usare un Drools RuleAgent per gestire la RuleBase. Il RuleAgent può connettersi al server di regole Drool (BRMS) od eseguire l'hot deploy dei pacchetti di regole dal repository locale. La RuleBase gestita dal RulesAgen è configurabile in <literal>components.xml</literal>:

source: The properties file contains properties specific to the RulesAgent. Here is an example configuration file from the Drools example distribution.
fr_fr: Le fichier de propriété contient les propriétés spécifiques au RulesAgent. Voici un exemple de fichier de configuration depuis la distribution exemple de Drools.
it_it: Il file delle proprietà contiene proprietà specifiche per RulesAgent. Ecco un file di configurazione d'esempio proveniente dalla distribuzione Drools.

source: It is also possible to configure the options on the component directly, bypassing the configuration file.
fr_fr: Il est aussi possible de configurer les options du composant directement, en outrepassant le fichier de configuration.
it_it: E' anche possibile configurare le opzioni derettamente sul componente, bypassando il file di configurazione.

source: Next, we need to make an instance of <literal>org.drools.WorkingMemory</literal> available to each conversation. (Each <literal>WorkingMemory</literal> accumulates facts relating to the current conversation.)
fr_fr: Ensuite, vous allons avoir besoin de faire une instance de <literal>org.drools.WorkingMemory</literal> disponible pour chaque conversation. (Chaque <literal>WorkingMemory</literal> accumule les faits relatif à la conversation courante.)
it_it: Successivamente occorre rendere disponibile ad ogni conversazione un'istanza di <literal>org.drools.WorkingMemory</literal>. (Ogni <literal>WorkingMemory</literal> accumula fatti relativi alla conversazione corrente.)

source: Notice that we gave the <literal>policyPricingWorkingMemory</literal> a reference back to our rule base via the <literal>ruleBase</literal> configuration property.
fr_fr: Notes que nous avons donné au <literal>policyPricingWorkingMemory</literal> une référence en retour vers notre base de règles via la propriété de configuration <literal>ruleBase</literal>.
it_it: Notare che è stato dato a <literal>policyPricingWorkingMemory</literal> un riferimento alla base di regole tramite la proprietà di configurazione <literal>ruleBase</literal>.

source: We can also add means to be notified of rule engine events, including rules firing, objects being asserted, etc. by adding event listeners to WorkingMemory.
fr_fr: Nous pouvons aussi en faire plus pour être informé des évènements du moteur de règles, ce qui inclus le déclenche de règles, le fait que des objets soient injecté, etc. en ajoutant des écouteur d'évènements au WorkingMemory.
it_it: Si può anche aggiungere gli strumenti per essere notificati degli eventi rule engine, inclusi l'avvio delle regole, gli oggetti da asserire, ecc. aggiungendo event listener alla WorkingMemory.

source: Using rules from a Seam component
fr_fr: L'utilisation des règles d'un composant de Seam
it_it: Utilizzo delle regole da un componente SEAM

source: We can now inject our <literal>WorkingMemory</literal> into any Seam component, assert facts, and fire rules:
fr_fr: Nous pouvons injecter notre <literal>WorkingMemory</literal> dans tout composant de Seam, insérer des faits, et déclencher des règles:
it_it: Ora è possibile iniettare la <literal>WorkingMemory</literal> in un qualsiasi componente di Seam, asserire i fatti e lanciare le regole:

source: Using rules from a jBPM process definition
fr_fr: L'utilisation des règles depuis une définition de processus jBPM
it_it: Utilizzo delle regole da una definizione di processo jBPM

source: You can even allow a rule base to act as a jBPM action handler, decision handler, or assignment handler &#8212; in either a pageflow or business process definition.
fr_fr: Nous pouvons même autoriser une base de règle à agir comme un gestionnaire d'action jBPM, un gestionnaire de décision, ou un gestionnaire d'affectation &#8212; à la fois dans un enchainement de page ou dans la définition de processus métier.
it_it: Si può anche consentire alla base di regole di agire come action handler di jBPM, decision handler, o assignment handler &#8212; sia in una definizione di pageflow sia in un processo di business.

source: The <literal>&lt;assertObjects&gt;</literal> element specifies EL expressions that return an object or collection of objects to be asserted as facts into the <literal>WorkingMemory</literal>.
fr_fr: L'élément <literal>&lt;assertObjects&gt;</literal> spécifie des expressions EL qui retourne un objet ou une collection d'objjets à insérer dans les faits dans le <literal>WorkingMemory</literal>.
it_it: L'elemento <literal>&lt;assertObjects&gt;</literal> specifica le espressioni EL che restituiscono un oggetto od una collezione di oggetti da asserire come fatti nella <literal>WorkingMemory</literal>.

source: The <literal>&lt;retractObjects&gt;</literal> element on the other hand specifies EL expressions that return an object or collection of objects to be retracted from the <literal>WorkingMemory</literal>.
fr_fr: L'élément <literal>&lt;retractObjects&gt;</literal> d'un autre côté spécifie les expressions EL qui retourne un objet ou une collection d'objets à être extrait depuis le <literal>WorkingMemory</literal>.
it_it: L'elemento <literal>&lt;retractObjects&gt;</literal> specifica le espressioni EL che restituiscono un oggetto od una collezione di oggetti da Rritrarre dalla <literal>WorkingMemory</literal>.

source: There is also support for using Drools for jBPM task assignments:
fr_fr: Il y a aussi le support pour l'utilisation de Drool pour l'affectation des tâches jBPM
it_it: Esiste anche il supporto per l'uso di Drools per le assegnazioni dei task in jBPM:

source: Certain objects are available to the rules as Drools globals, namely the jBPM <literal>Assignable</literal>, as <literal>assignable</literal> and a Seam <literal>Decision</literal> object, as <literal>decision</literal>. Rules which handle decisions should call <literal>decision.setOutcome("result")</literal> to determine the result of the decision. Rules which perform assignments should set the actor id using the <literal>Assignable</literal>.
fr_fr: Certains objets sont disponibles pour les règles comme Drools globals, dénommé le jBPM <literal>Assignable</literal>, comme <literal>assignable</literal> et un objet <literal>Decision</literal> de Seam, comme <literal>décision</literal>. Les règles qui gèrent les décisions devraient s'appeler <literal>decision.setOutcome("result")</literal> pour déterminer le résultat de la décision. Les règles qui réalise l'affectation devrait définir l'identifiant de l'acteur en utilisant <literal>Assignable</literal>.
it_it: Alcuni oggetti sono consultabili dalle regole come Drools globals, chiamate <literal>Assignable</literal> in jBPM, come <literal>assignable</literal> ed oggetto <literal>Decision</literal> in Seam, come <literal>decision</literal>. Le regole che gestiscono le decisioni dovrebbero chiamare <literal>decision.setOutcome("result")</literal> per determinare il risultato della decisione. Le regole che eseguono assegnazioni dovrebbero impostare l'actor id usando <literal>Assignable</literal>.

source: You can find out more about Drools at <ulink url="http://www.drools.org"></ulink>
fr_fr: Vous pouvez trouver beaucoup plus sur les Drools sur <ulink url="http://www.drools.org"></ulink>
it_it: Si possono trovare altre informazioni su Drools all'indirizzo <ulink url="http://www.drools.org"></ulink>

source: Seam comes with enough of Drools' dependencies to implement some simple rules. If you want to add extra capabilities to Drools you should download the full distribution and add in extra dependencies as needed.
fr_fr: Seam vient avec suffisant de dépendances de Drools pour implémenter quelques règles simples. Si vous voulez ajouter des fonctionnalités additionnelles à Drools vous devriez télécharger une distribution complète et ajouter des dépendances additionnelles selon les besoins.
it_it: Seam viene fornito con dipendenze Drools sufficienti per implementare alcune regole semplici. Per aggiungere ulteriori funzionalità a Drools occorre scaricare la distribuzione completa ed aggiungere le dipendenze necessarie.
