Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Elenhancements.po
Languages: fr_fr, it_it, ja_jp

source: However, it actually returns a list containing a list of the employees for each individual department. To combine the values, it is necessary to use a slightly longer expression:
fr_fr: Cependant, elle retourne actuellement une liste contenant une liste des employés pour chaque département individuellement. Pour combiner les valeurs, il est nécéssaire d'utiliser une expression légèrement plus longue:
it_it: Comunque, restituisce una lista contenente una lista di impiegati per ogni singolo dipartimento. Per combinare questi valori è necessario usare un'espressione leggermente più lunga:
ja_jp: しかし実際には各個別部署ごとの社員一覧を含む一覧を返します。 値を結合させるにはもう少し長い式を使う必要があります。

source: It is important to note that this syntax cannot be parsed by Facelets or JSP and thus cannot be used in xhtml or JSP files. We anticipate that the projection syntax will change in future versions of JBoss EL.
fr_fr: Il est important de noter que la syntaxe ne peut être analysé par les Facelets ou par JSP et ainsi ne peut être utilisé dans les fichiers xhtml ou JSP. Nous anticipons que la syntaxe de projection va changer dans les futures versions de JBoss EL.
it_it: E' importante notare che questa sintassi non può essere analizzata da Facelets o JSP e quindi non può essere usata in file xhtml o jsp. Anticipiamo che la sintassi di proiezione cambierà nelle future versioni di JBoss EL.
ja_jp: この構文は Facelets や JSP では解析不能なため xhtml または JSP ファイルでは使用できない点に注意してください。 プロジェクション構文は JBoss EL の将来的なバージョンにおける変更が見込まれています。
