Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Elenhancements.po
Languages: fr_fr, it_it, ja_jp

source: Seam uses JBoss EL which provides an extension to the standard Unified Expression Language (EL). JBoss EL provides a number of enhancements that increase the expressiveness and power of EL expressions.
fr_fr: Seam fourni un extention pour le Langage d'Expression Unifiée (EL) standardisé appelé JBoss EL. JBoss EL fournit un nombre d'amélioration qui augmente l'expressivité et la puissance des expressions EL.
it_it: Seam utilizza JBoss EL, il quale fornisce un'estensione allo standard Unified Expression Language (EL). JBoss EL apporta un numero di miglioramenti che incrementano l'espressività e la potenza delle espressioni EL.
ja_jp: Seam は 標準の Unified Expression Language (EL) に拡張を提供する JBoss EL を使用します。 JBoss EL は EL 式のパワーや表現力を増強させるいくつかの機能拡張を提供しています。

source: Parameterized Expressions
fr_fr: Les expressions paramétisées
it_it: Espressioni parametrizzate
ja_jp: パラメータ化された式

source: Standard EL does not allow you to use a method with user defined parameters &#8212; of course, JSF listener methods (e.g. a <literal>valueChangeListener</literal>) take parameters provided by JSF.
fr_fr: Le EL standard ne vous permet d'utiliser une méthode où l'utilisateur définir les paramètres &#8212; bien sur, les méthodes d'écoute de JSF (par exemple, un <literal>valueChangeListener</literal>) prends les paramètres fournis par JSF.
it_it: Lo standard EL non consente di utilizzare un metodo con parametri definiti dall'utente &#8212; sicuramente metodi JSF listener (es. <literal>valueChangeListener</literal>) prende i parametri forniti da JSF.
ja_jp: 標準 EL ではユーザー定義のパラメータでメソッドを使用することはできません。 当然、 JSF リスナーのメソッド (<literal>valueChangeListener</literal>) は JSF 提供のパラメータをとることになります。

source: JBoss EL removes this restriction. For example:
fr_fr: JBoss EL retire cette restriction. Par exemple:
it_it: JBoss EL rimuove questa restrizione. Per esempio:
ja_jp: JBoss EL ではこの制約が取り除かれます。 以下が例です。

source: Usage
fr_fr: Utilisation
it_it: Utilizzo
ja_jp: 使い方

source: Just as in calls to method from Java, parameters are surrounded by parentheses, and separated by commas:
fr_fr: Appelez juste cette méthode depuis Java, les paramètres sont entourés par des parenthèses, et séparés par des virgules:
it_it: Come nelle chiamate ai metodi in Java, i parametri sono racchiusi tra parentesi e separati da virgole:
ja_jp: ちょうど Java から メソッドへのコールと同じように、 パラメータは括弧で囲まれコンマで区切られます。

source: The parameters <literal>hotel</literal> and <literal>user</literal> will be evaluated as value expressions and passed to the <literal>bookHotel()</literal> method of the component.
fr_fr: Les paramètres <literal>hotel</literal> et <literal>user</literal> seront évalués comme des expressions de valeur et passés à la méthode du composant <literal>bookHotel()</literal>.
it_it: I parametri <literal>hotel</literal> e <literal>user</literal> verranno valutati come espressioni di valore e passati al metodo <literal>bookHotel()</literal> del componente.
ja_jp: パラメータ <literal>hotel</literal> と <literal>user</literal> は値式として評価されコンポーネントの <literal>bookHotel()</literal> メソッドに渡されます。

source: Any value expression may be used as a parameter:
fr_fr: Tout expression de valeur peut être utilisé comme un paramètre:
it_it: Qualsiasi valore d'espressione può essere usato come parametro:
ja_jp: パラメータには、以下のように、どのような値式も使う事ができます。

source: It's important to fully understand how this extension to EL works. When the page is rendered, the parameter <emphasis>names</emphasis> are stored (for example, <literal>hotel.id</literal> and <literal>user.username</literal>), and evaluated (as value expressions) when the page is submitted. You can't pass objects as parameters!
fr_fr: Il est important de bien comprends comme cette extension de EL fonctionne. Quand la page est rendu, le paramètres <emphasis>names</emphasis> est stocké (par exemple, <literal>hotel.id</literal> et <literal>user.username</literal>) et évalués (comme des expressions de valeur) quand la page est soumise. Vous ne pouvez passer des objets comme des paramètres!
it_it: E' importante capire bene come funziona quest'estensione a EL. Quando la pagine viene generata, i <emphasis>nomi</emphasis> dei parametri vengono memorizzati (per esempio <literal>hotel.id</literal> e <literal>user.username</literal>) e valutati (come espressioni di valore) quando la pagina viene inviata. Non si possono passare oggetti come parametri!
ja_jp: こうした EL への拡張がどのように動作するのかを十分に理解しておくことが重要となります。 ページがレンダリングされるとパラメータの <emphasis>名前</emphasis> が保存され (例、 <literal>hotel.id</literal> と <literal>user.username</literal>)、 ページがサブミットされるときに評価されます。 パラメータとしてオブジェクトを渡すことはできません。

source: You must ensure that the parameters are available not only when the page is rendered, but also when it is submittedIf the arguments can not be resolved when the page is submitted the action method will be called with <literal>null</literal> arguments!
fr_fr: Vous devez vous assurer que les paramètres sont disponibles pas seulement quand la page est rendue mais aussi quand elle est soumis. Si l'argument ne peut être résolu quand la page est soumise la méthode d'action sera appelée avec des arguments <literal>null</literal>!
it_it: Devi assicurarti che i parametri siano disponibili non solo quando la pagina viene generata, ma anche quando ne viene fatto il submit. Se gli argomenti non possono essere risolti quando la pagina viene inviata, il metodo d'azione verrà chiamato con argomenti <literal>null</literal>!
ja_jp: ページがレンダリングされる場合だけでなくサブミットされる場合にもパラメータが使用できるようになっていることを確認する必要があります。 ページがサブミットされるときに引数が解決できないとアクションメソッドが <literal>null</literal> 引数を付けて呼び出されます。

source: You can also pass literal strings using single quotes:
fr_fr: Vous pouvez aussi passer des chaines de caractères en utilisant les apostrophes:
it_it: Si può passare stringe letterali usando virgolette singole:
ja_jp: 一重引用符を用いて文字列リテラルを渡すこともできます。

source: Unified EL also supports value expressions, used to bind a field to a backing bean. Value expressions use JavaBean naming conventions and expect a getter/setter pair. Often JSF expects a value expression where only retrieval (get) is needed (e.g. the <literal>rendered</literal> attribute). Many objects, however, don't have appropriately named property accessors or require parameters.
fr_fr: EL unifié supporte aussi les expressions de valeur, utilisés pour trouver un champs d'un bean arrière. Les expressions de valeurs utilise les conventions de nommage des JavaBeans et s'attends à une paire d'assesseurs. Souvent JSF attends une expression de valeur avec seulement une lecture (get) est nécéssaire (par exemple l'attribut <literal>rendered</literal>). Beaucoup d'objets, cependant, n'ont pas les asseceurs de propriétés dénommé de manière approprié ou nécéssite des paramètres.
it_it: EL unificato supporta anche le espressioni di valore, usate per associare un campo ad un bean. Le espressioni di valore utilizzano le convenzioni dei nomi di JavaBean e richiedono get e set. Spesso JSP si attende un'espressione di valore dove solo un recupero (get) è richiesto (es. l'attributo <literal>rendered</literal>). Molti oggetti, comunque, non hanno nominato in modo appropriato i metodi accessor alle proprietà o i parametri richiesti.
ja_jp: Unified EL は値式にも対応し、 フィールドを支えている Bean にバインドするために使用されます。 値式は JavaBean の命名規則を使用し getter と setter の組み合わせを期待します。 JSF はしばしば、値の検索 (get) のみを必要とするような場合にも値式を期待します (<literal>rendered</literal> 属性)。 にもかかわらず、 多くのオブジェクトが適切な名前のプロパティアクセッサを持っていなかったり、 要求されたパラメータを持っていなかったりする場合があります。

source: JBoss EL removes this restriction by allowing values to be retrieved using the method syntax. For example:
fr_fr: JBoss EL retire cette restriction qui permet aux valeurs d'êre retrouvé en utilisant la syntaxe des méthodes. Par exemple:
it_it: JBoss EL rimuove questa restrizione permettendo che i valori vengano recuperati usando la sintassi del metodo. Per esempio:
ja_jp: JBoss EL はメソッド構文を使った値の検索を許可することで制約を取り除きます。 以下が例です。

source: You can access the size of a collection in a similar manner:
fr_fr: Vous pouvez accéder à la taille de la collection de manière similaire:
it_it: Si può accedere alla dimensione di una collezione in maniera analoga:
ja_jp: 同様にして 1 集合のサイズにアクセスが可能です。

source: #{searchResults.size()}
it_it: <![CDATA[<h:outputText value="#{person.name}" rendered="#{person.name.length() > 5}" />]]>

source: In general any expression of the form #{obj.property} would be identical to the expression #{obj.getProperty()}.
fr_fr: En égénral, toute expression de la forme #{obj.property} devrait être indentique à l'expression #{obj.getProperty()}.
it_it: In generale qualsiasi espressione nella forma #{obj.property} è identica all'espressione #{obj.getProperty()}.
ja_jp: 一般的には #{obj.property} 形式の表現は #{obj.getProperty()} 形式とまったく同一となります。

source: Parameters are also allowed. The following example calls the <literal>productsByColorMethod</literal> with a literal string argument:
fr_fr: Les paramètres sont aussi permis. L'exemple suivant appelle <literal>productsByColorMethod</literal> avec un argument chaine de caractère litérale:
it_it: Sono consentiti anche i parametri. Il seguente esempio chiama <literal>productsByColorMethod</literal> con un argomento stringa letterale:
ja_jp: パラメータを使うこともできます。 次の例では文字列リテラルの引数を持つ <literal>productsByColorMethod</literal> を呼び出しています。

source: Limitations and Hints
fr_fr: Les limitations et les astuces
it_it: Limitazioni e suggerimenti
ja_jp: 制約とヒント

source: When using JBoss EL you should keep the following points in mind:
fr_fr: Avec l'utilisation de JBoss EL, vous devriez garder les points suivants en tête:
it_it: Nell'uso di JBoss EL dovresti tenere presente i seguenti punti:
ja_jp: JBoss EL を使用する際には次の点に留意してください。

source: <emphasis>Incompatibility with JSP 2.1</emphasis> &#8212; JBoss EL can't currently be used with JSP 2.1 as the compiler rejects expressions with parameters in. So, if you want to use this extension with JSF 1.2, you will need to use Facelets. The extension works correctly with JSP 2.0.
fr_fr: <emphasis>Incompatibilité avec JSP 2.1</emphasis> &#8212; JBoss EL ne peut actuellement pas être utilisé avec JSP 2.1 car le compilateur rejette les epxressions avec des paramètres. Donc, si vous voulez utiliser cette extension avec JSF 1.2, vous allez devoir utiliser les Facelets. L'extension fonctionne correctement avec JSP 2.0.
it_it: <emphasis>Incompatibilità con JSP 2.1</emphasis> &#8212; JBoss EL non può attualmente essere utilizzato con JSP 2.1 poiché il compilatore rifiuta espressioni con paramentri al suo interno. Quindi per usare quest'estensione con JSF 1.2, si dovranno utilizzare Facelets. Quest'estensione funziona correttamente con JSP 2.0.
ja_jp: <emphasis>JSP 2.1 との非互換性</emphasis> &#8212; JBoss EL は現在 JSP 2.1 との併用はできません。 コンパイラがパラメータ付きの式を拒否するためです。 JSF 1.2 でこの拡張を使用したい場合は Facelets を使用する必要があります。 この拡張は JSP 2.0 では正常に動作します。

source: <emphasis>Use inside iterative components</emphasis> &#8212; Components like <literal>&lt;c:forEach /&gt;</literal> and <literal>&lt;ui:repeat /&gt;</literal>iterate over a List or array, exposing each item in the list to nested components. This works great if you are selecting a row using a <literal>&lt;h:commandButton /&gt;</literal> or <literal>&lt;h:commandLink /&gt;</literal>:
fr_fr: <emphasis>Utilisation de composants itératif à l'intérieur</emphasis> &#8212; Les composants comme <literal>&lt;c:forEach /&gt;</literal> et <literal>&lt;ui:repeat /&gt;</literal>itérate au travers d'une List ou d'un tableau, exposant chaque élément de la liste au composant lié. Cela fonctionne bien si vous avez sélectionné une ligne en utilisant <literal>&lt;h:commandButton /&gt;</literal> ou <literal>&lt;h:commandLink /&gt;</literal>:
it_it: <emphasis>Utilizzo all'interno di componenti iterativi</emphasis> &#8212; Componenti quali <literal>&lt;c:forEach /&gt;</literal> e <literal>&lt;ui:repeat /&gt;</literal>iterano su una lista o un array, esponendo ogni item della lista ai componenti innestati. Questo funziona bene selezionando una riga con <literal>&lt;h:commandButton /&gt;</literal> o <literal>&lt;h:commandLink /&gt;</literal>:
ja_jp: <emphasis>反復コンポーネント内での使用</emphasis> &#8212; <literal>&lt;c:forEach /&gt;</literal> や <literal>&lt;ui:repeat /&gt;</literal> といったコンポーネントは List またはアレイに渡って反復し一覧内の各アイテムをネストされるコンポーネントに公開します。 <literal>&lt;h:commandButton /&gt;</literal> や <literal>&lt;h:commandLink /&gt;</literal> を使った列を選択している場合に非常に便利です。

source: However if you want to use <literal>&lt;s:link /&gt;</literal> or <literal>&lt;s:button /&gt;</literal> you <emphasis>must</emphasis> expose the items as a <literal>DataModel</literal>, and use a <literal>&lt;dataTable /&gt;</literal> (or equivalent from a component set like <literal>&lt;rich:dataTable /&gt;</literal> ). Neither <literal>&lt;s:link /&gt;</literal> or <literal>&lt;s:button /&gt;</literal> submit the form (and therefore produce a bookmarkable link) so a "magic" parameter is needed to recreate the item when the action method is called. This magic parameter can only be added when a data table backed by a <literal>DataModel</literal> is used.
fr_fr: Cependant si vous voulez utiliser <literal>&lt;s:link /&gt;</literal> ou <literal>&lt;s:button /&gt;</literal> vous <emphasis>devez</emphasis> exposer les élements au <literal>DataModel</literal>, et utiliser une <literal>&lt;dataTable /&gt;</literal> (ou une équivalence d'un composant défini comme <literal>&lt;rich:dataTable /&gt;</literal> ). Ni <literal>&lt;s:link /&gt;</literal> ou <literal>&lt;s:button /&gt;</literal> soumettent le formulaire (et ainsi produisent un lien capable d'être en favori) donc un paramètre "magique" est nécéssaire pour recréer l'élement quand la méthode d'action est appelée. Ce paramètre magique peut seuelement êrte ajouté quand le tableau de donnée liée avec un un <literal>DataModel</literal> est utilisé.
it_it: Comunque si voglia usare <literal>&lt;s:link/&gt;</literal> o <literal>&lt;s:button/&gt;</literal> si <emphasis>deve</emphasis> esporre gli item come <literal>DataModel</literal> e usare <literal>&lt;dataTable /&gt;</literal> (o equivalente da componente impostato come <literal>&lt;rich:dataTable /&gt;</literal> ). Né <literal>&lt;s:link /&gt;</literal> né <literal>&lt;s:button /&gt;</literal> eseguono il submit della form (e quindi producono un bookmarkable link) quindi serve un parametro "magico" per ricreare l'item quando viene chiamato l'action method. Questo parametro magico può essere aggiunto soltanto quando viene usata una data table con dietro un <literal>DataModel</literal>.
ja_jp: ただし、 <literal>&lt;s:link /&gt;</literal> や <literal>&lt;s:button /&gt;</literal> を使用したい場合はアイテムを <literal>DataModel</literal> として公開して <literal>&lt;dataTable /&gt;</literal> (または <literal>&lt;rich:dataTable /&gt;</literal> のようなコンポーネントセットからの同等) を使用 <emphasis>しなければなりません</emphasis>。 <literal>&lt;s:link /&gt;</literal> あるいは <literal>&lt;s:button /&gt;</literal> のいずれもフォームをサブミットしない (したがってリンクがブックマーク可能となる) ためアクションメソッドが呼び出された場合にそのアイテムを再度作成するためのマジックパラメータが必要となります。 <literal>DataModel</literal> で支えられるデータテーブルが使用されるとこのマジックパラメータのみが追加可能となります。

source: <emphasis>Calling a <literal>MethodExpression</literal> from Java code</emphasis> &#8212; Normally, when a <literal>MethodExpression</literal> is created, the parameter types are passed in by JSF. In the case of a method binding, JSF assumes that there are no parameters to pass. With this extension, we can't know the parameter types until after the expression has been evaluated. This has two minor consequences:
fr_fr: <emphasis>L'appel à <literal>MethodExpression</literal> depuis du code Java </emphasis> &#8212; Normallement, quand une <literal>MethodExpression</literal> est crée, les types des paramètres sont passés par JSF. Dans le cas d'une liaison de méthode, JSF suppose qu'il n'y a aucun paramètres à passer. Avec cette extension, nous ne pouvons pas savoir les types de paramètres tant que l'expression n'a pas été évaluée. Ceci a deux conséquences mineures:
it_it: <emphasis>Chiamata di un <literal>MethodExpression</literal> da codice Java</emphasis> &#8212; normalmente quando una <literal>MethodExpression</literal> viene creata, i tipi di parametro sono passati tramite JSF. Nel caso di un binding di metodo, JSF presume che non ci siano parametri da passare. Con quest'estensione non è possibile sapere il tipo di parametro prima che l'espressione venga valutata. Ciò ha due conseguenze:
ja_jp: <emphasis>Java コードから <literal>MethodExpression</literal> を呼び出す</emphasis> &#8212; 通常、 <literal>MethodExpression</literal> が作成されるとパラメータタイプが JSF によって渡されます。 メソッドのバインディングの場合、 JSF は渡すパラメータがないものとみなします。 この拡張では、 式が評価され終わってからでないとパラメータタイプを知ることができません。 これにより深刻ではありませんが 2 つの結果を招くことになります。

source: When you invoke a <literal>MethodExpression</literal> in Java code, parameters you pass may be ignored. Parameters defined in the expression will take precedence.
fr_fr: Quand vous invoquez une <literal>MethodExpression</literal> dans du code Java, les paramètres que vous passez sont ignorés. Les paramètres définis dans l'expression prendront la priorité.
it_it: Quando viene invocato un <literal>MethodExpression</literal> nel codice Java, i parametri passati potrebbero essere ignorati. I parametri definiti nell'espressione avranno la precedenza.
ja_jp: Javaコードで <literal>MethodExpression</literal> を呼び出したとき、 渡したパラメータが無視される可能性があります。 式中で定義されたパラメータが優先されます。

source: Ordinarily, it is safe to call <literal>methodExpression.getMethodInfo().getParamTypes()</literal> at any time. For an expression with parameters, you must first invoke the <literal>MethodExpression</literal> before calling <literal>getParamTypes()</literal>.
fr_fr: Ordinairement, il est plus sûr it d'appeler <literal>methodExpression.getMethodInfo().getParamTypes()</literal> à chaque fois. Pour une expression avec des paramètres, vous devez en premier invoquer la <literal>MethodExpression</literal> avant l'apperl de <literal>getParamTypes()</literal>.
it_it: Solitamente è sicuro chiamare in ogni momento <literal>methodExpression.getMethodInfo().getParamTypes()</literal>. Per un'espressione con parametri occorre invocare il <literal>MethodExpression</literal> prima di chiamare <literal>getParamTypes()</literal>.
ja_jp: 通常、 <literal>methodExpression.getMethodInfo().getParamTypes()</literal> はいつでも安全に呼び出す事ができます。 パラメータを伴う式の場合、 まず <literal>MethodExpression</literal> を呼び出してから、 <literal>getParamTypes()</literal> を呼び出すようにしてください。

source: Both of these cases are exceedingly rare and only apply when you want to invoke the <literal>MethodExpression</literal> by hand in Java code.
fr_fr: Ces deux cas sont extrêmement rare et ne s'applique que quand vous voulez invoquer<literal>MethodExpression</literal> à la main dans du code Java.
it_it: Entrambi questi casi sono estremamente rari e si applicano solo quando si vuole invocare manualmente <literal>MethodExpression</literal> nel codice Java.
ja_jp: 上記のようなケースは非常に稀であり、 Java コードで <literal>MethodExpression</literal> を手作業で呼び出す必要が有る場合にのみ適用されます。

source: Projection
fr_fr: La projection
it_it: Proiezione
ja_jp: プロジェクション

source: JBoss EL supports a limited projection syntax. A projection expression maps a sub-expression across a multi-valued (list, set, etc...) expression. For instance, the expression:
fr_fr: JBoss EL supporte une syntaxe de projection limitée. Une expression de projection correspond une sous-expression au travers d'expression de multiples valeurs (list, set, etc...). Par exemple, l'expression:
it_it: JBoss EL supporta una limitata sintassi di proiezione. Un'espressione di proiezione mappa una sotto-espressione attraverso un'espressione a valori multipli (lista, set, ecc...). Per esempio, l'espressione:
ja_jp: JBoss EL は限られたプロジェクション構文に対応します。 プロジェクション式はサブとなる式を複数値 (リスト、 セットなど) の式全体にマッピングします。 以下が例です。

source: might return a list of departments. If you only need a list of department names, your only option is to iterate over the list to retrieve the values. JBoss EL allows this with a projection expression:
fr_fr: doit retourner une liste de département. Si vous avez seulement besoin d'une liste de noms de département, votre seule option est d'itérer au travers de la liste pour retrouver les valeurs. JBoss EL permet cela avec une expression de projection:
it_it: potrebbe restituire una lista di dipartimenti. Se occorresse una lista di nomi di dipartimento, l'unica opzione è quella di iterare sulla lista per recuperare i valori. JBoss EL permette questo con l'espressione di proiezione:
ja_jp: この式は部署の一覧を返します。 部署名の一覧のみが必要な場合はその値を検索する一覧全体を反復させることが唯一のオプションとなります。 JBoss EL ではプロジェクション式を使うと行うことができます。

source: The subexpression is enclosed in braces. In this example, the expression <literal>d.name</literal> is evaluated for each department, using <literal>d</literal> as an alias to the department object. The result of this expression will be a list of String values.
fr_fr: La sous-expression est entouré par des accolades. Dans cet exemple, l'expression <literal>d.name</literal> est évalué pour chaque département, en utilisant <literal>d</literal> comme un alias sur l'objet département. Le résultat de cette expression est une liste de valeurs String.
it_it: La sotto-espressione è racchiusa da parentesi. In quest'esempio l'espressione <literal>d.name</literal> viene valutata per ogni dipartimento, usando <literal>d</literal> come alias per l'oggetto dipartimento. Il risultato di quest'espressione sarà una lista di valori Stringa.
ja_jp: サブとなる式は中括弧で囲みます。 この例では各部署ごとに <literal>d.name</literal> 式が評価され、 <literal>d</literal> を部署のオブジェクトへのエイリアスとして使っています。 この式の結果は文字列値の一覧となります。

source: Any valid expression can be used in an expression, so it would be perfectly valid to write the following, assuming you had a use for the lengths of all the department names in a company:
fr_fr: Toute expression valide peut être utilisée comme une expression, ainsi il est parfaitement valide d'écrire ce qui suit, en supposant que vous avez une utilisation de la longeurs de tous les noms de département dans une entreprise:
it_it: Qualsiasi espressione valida può essere usata in un'espressione, e quindi sarebbe perfettamente valido scrivere la seguente, assumendo che venga usata per le lunghezze di tutti i nomi di dipartimento in un'azienda:
ja_jp: 式中に有効な式ならいずれの式でも使用できるため次の記述は完全に有効です。 ある会社の全部署の部署名の長さ (サイズ) を知りたい場合には次のように問い合わせることができます。

source: Projections can be nested. The following expression returns the last names of every employee in every department:
fr_fr: Les projections peuvent être liée. L'expression suivante retourne les noms de familles de chaque employé dans chaque département:
it_it: Le proiezioni possono essere annidate. La seguente espressione ritorna gli ultimi nomi di ciascun impiegato in ogni dipartimento:
ja_jp: プロジェクションはネストさせることが可能です。 次の式は各部署内のそれぞれの社員のラストネームを返します。

source: Nested projections can be slightly tricky, however. The following expression looks like it returns a list of all the employees in all the departments:
fr_fr: Les projections liées peuvent être légèrement épineuse, toutefois. L'expression suivante devrait faire comme si elle retourne une liste de tous les employés dans tous les départements:
it_it: Le proiezioni annidate possono comunque rivelarsi un pò difficoltose. La seguente espressione sembra ritornare una lista di tutti gli impiegati in tutti i dipartimenti:
ja_jp: ただしプロジェクションのネストは若干の注意が必要です。 次の式は全部署の全社員一覧を返すように見えます。
