Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Framework.po
Languages: fr_fr, it_it, ja_jp

source: The final step is to add validation functionality to the page, using <literal>&lt;s:validateAll&gt;</literal> and <literal>&lt;s:decorate&gt;</literal>, but I'll leave that for you to figure out.
fr_fr: L'étape finale est d'ajouter la fonctionnalité de validation à la page, en utilisant <literal>&lt;s:validateAll&gt;</literal> et <literal>&lt;s:decorate&gt;</literal>, mais je vais vous laisser trouver.
it_it: Il passo finale è aggiungere alla pagina la funzionalità di validazione, usando <literal>&lt;s:validateAll&gt;</literal> e <literal>&lt;s:decorate&gt;</literal>, ma verrà lasciato al lettore come esercizio.
ja_jp: 最後のステップは<literal>&lt;s:validateAll&gt;</literal> と<literal>&lt;s:decorate&gt;</literal>を使って、ページにバリデーション機能を追加することですが、これは皆さんへの宿題としておきましょう。

source: Query objects
fr_fr: Le objets Query
it_it: Oggetti Query
ja_jp: Queryオブジェクト

source: If we need a list of all <literal>Person</literal> instance in the database, we can use a Query object. For example:
fr_fr: Si nous avons besoin d'une liste de toutes les instance de <literal>Person</literal> dans la base de données, nous pouvons utiliser un objet Query object. Par exemple:
it_it: Se occorre una lista di tutte le istanze <literal>Person</literal> nel database, si può usare un oggetto Query. Per esempio:
ja_jp: データベース中の<literal>Person</literal>のすべてのインスタンスのリストが必要な場合、Queryオブジェクトを使って、下のようにすることができます。

source: We can use it from a JSF page:
fr_fr: Nous pouvons l'utiliser dans une page JSF:
it_it: E' possibile usarlo da una pagina JSF:
ja_jp: また、これ（この結果）をJSFページから使うことができます。

source: We probably need to support pagination:
fr_fr: Nous avons probablement besoin de supporter la pagination:
it_it: Probabilmente occorre un supporto per la paginazione:
ja_jp: 量の多いページを処理するためにページングも必要でしょう。

source: We'll use a page parameter to determine the page to display:
fr_fr: Nous allons utiliser un paramètre de page pour déterminer la page à afficher:
it_it: Si userà un parametro di pagina per determinare la pagina da mostrare:
ja_jp: 表示するページを決めるためにページパラメータを使います。

source: The JSF code for a pagination control is a bit verbose, but manageable:
fr_fr: Le code JSF pour le contrôle de la pagination est un peu verbeux mais gérable:
it_it: Il codice JSF per il controllo della paginazione è un pò verboso, ma gestibile:
ja_jp: ページングを管理するJSFのコードは若干繁雑ですが、許容範囲内です。

source: Real search screens let the user enter a bunch of optional search criteria to narrow the list of results returned. The Query object lets you specify optional "restrictions" to support this important usecase:
fr_fr: Les écrans de recherche réel permettent à l'utilisateur d'entrer un tas de critères de recherches optionnels pour réduire la liste des résultats retournés. L'objet Query vous permet d'indiquer les "restrictions" optionneles pour supporter ce cas d'utilisation important:
it_it: Le schermate di ricerca consentono all'utente di inserire una serie di criteri di ricerca per restringere la lista dei risultati restituiti. L'oggetto Query consente di specificare delle "restrizioni" opzionali per supportare quest'importante caso d'uso:
ja_jp: 実用的な検索スクリーンでは、絞りこんだ検索結果を得るために、多くの検索のクライテリアをユーザーに入力してもらう必要があります。 この重要なユースケースをサポートするために、Queryオブジェクトはオプションとして制約を設定することができます。

source: Notice the use of an "example" object.
fr_fr: Notez l'utilisation d'un objet "exemple".
it_it: Si noti l'uso di un oggetto "esempio".
ja_jp: 上記の例ではexampleオブジェクトの使用について留意してください。

source: To refresh the query when the underlying entities change we observe the <literal>org.jboss.seam.afterTransactionSuccess</literal> event:
fr_fr: Pour rafraichir la requête quand les entitées sousjacentes changent, nous oberservons l'évènement <literal>org.jboss.seam.afterTransactionSuccess</literal>:
it_it: Per fare il refresh della query qualora cambino le entità sottostanti, si può osservare l'evento <literal>org.jboss.seam.afterTransactionSuccess</literal>:
ja_jp: 基礎となるエンティティが変化する場合にリフレッシュするには <literal>org.jboss.seam.afterTransactionSuccess</literal> イベントを監視します。

source: Or, to just refresh the query when the person entity is persisted, updated or removed through <literal>PersonHome</literal>:
fr_fr: Ou juste pour rafraichir la requête quand l'entité personne est peristée, mise-à-jours ou retirée au travers de <literal>PersonHome</literal>:
it_it: O semplicemente per fare il refresh della query quando l'entity person viene persistita, aggiornata o rimossa attraverso <literal>PersonHome</literal>:
ja_jp: または、 <literal>PersonHome</literal> で person エンティティの永続化、 更新、 あるいは削除が行われた場合にクエリーをリフレッシュするだけなら次のようにします。

source: Unfortunately Query objects don't work well with <emphasis>join fetch</emphasis> queries - the use of pagination with these queries is not recommended, and you'll have to implement your own method of calculating the total number of results (by overriding <literal>getCountEjbql()</literal>.
fr_fr: Malheureusement, les objets Query ne fonctionnent pas bien avec les reuqêtes <emphasis>join fetch</emphasis> - l'utilisation de la pagination avec ces requêtes n'est pas recommandée, et vous allez devoir implémenter votre propre méthode pour calculer le nombre total de résultats (en surchargeant <literal>getCountEjbql()</literal>).
it_it: Sfortunatamente gli oggetti Query non funzionano bene con query <emphasis>join fetch</emphasis> - non è consigliato l'uso della paginazione con queste query, ed occorrerà implementare un proprio metodo di calcolo del numero totale di risultati (con l'override di <literal>getCountEjbql()</literal>).

source: The examples in this section have all shown reuse by configuration. However, reuse by extension is equally possible for Query objects.
fr_fr: Les exemples de cette section qui ont été montré utilisent la configuration. Cependant les utiliser par l'extension est égale possible pour les objets Query.
it_it: Gli esempi in questa sezione hanno mostrato tutti il riuso tramite configurazione. Comunque per gli oggetti Query il riuso tramite estensione è ugualmente possibile.
ja_jp: このセクションの例では構成による再利用を示していますが、Queryオブジェクトの再利用は機能を拡張して行う事も同様に可能です。

source: Controller objects
fr_fr: Les objets Controleur
it_it: Oggetti controllori
ja_jp: Controllerオブジェクト

source: A totally optional part of the Seam Application Framework is the class <literal>Controller</literal> and its subclasses <literal>EntityController</literal> <literal>HibernateEntityController</literal> and <literal>BusinessProcessController</literal>. These classes provide nothing more than some convenience methods for access to commonly used built-in components and methods of built-in components. They help save a few keystrokes (characters can add up!) and provide a great launchpad for new users to explore the rich functionality built in to Seam.
fr_fr: Une partie complètement optionnelle du Serveur d'Application Seam est la classe <literal>Controller</literal> et ses sousclasses <literal>EntityController</literal> <literal>HibernateEntityController</literal> et <literal>BusinessProcessController</literal>. Ces classes ne fournissent rien de plus que des méthodes pratiques pour acceder aux composants livré utilisé communément. Ils permettent de d'éviter quelques frappes au claviers (les touches peuvent se reposer) et fournissent une bonne base de lancement pour les nouveaux utilisateurs afin qu'ils explorent les fonctionnalités riches livrées dans Seam.
it_it: Una parte totalmente opzionale del framework Seam è la classe <literal>Controller</literal> e le sue sottoclassi <literal>EntityController</literal>, <literal>HibernateEntityController</literal> e <literal>BusinessProcessController</literal>. Queste classi forniscono nient'altro che alcuni metodi di convenienza per l'accesso a componenti predefiniti comunemente usati e a metodi di componenti predefiniti. Essi aiutano a risparmiare alcuni colpi di tastiera ed a fornire un trampolino di lancio ai nuovi utenti per esplorare le ricche funzionalità definite in Seam.
ja_jp: Seamアプリケーションフレームワークのオプショナルなクラスとして、<literal>Controller</literal>と、そのサブクラスとして、 <literal>EntityController</literal>、 <literal>HibernateEntityController</literal> と<literal>BusinessProcessController</literal>があります。 よく使用される組み込みのコンポーネントへのアクセスに便利なメソッドや組み込みコンポーネントのメソッドを提供しています。これらは、新しいユーザーがSeamに組み込まれた豊富な機能を探検するための出発点を提供し、また若干のコード量の削減に貢献します。

source: For example, here is what <literal>RegisterAction</literal> from the Seam registration example would look like:
fr_fr: Par exemple, ici c'est le <literal>RegisterAction</literal> de l'exemple de reservation de Seam devrait ressemble :
it_it: Per esempio, qua è come appare <literal>RegisterAction</literal> dell'esempio Registrazione:
ja_jp: 例として、SeamのRegistrationの例の<literal>RegisterAction</literal>をSeamアプリケーションフレームワークで書き直すと以下のようになります。

source: As you can see, its not an earthshattering improvement...
fr_fr: Comme vous pouvez le voir, ce n'est pas une ammélioration stupéfiante...
it_it: Come si può vedere, non è un miglioramento sconvolgente...
ja_jp: ご覧のように、びっくりするような改善にはなりません。
