Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Framework.po
Languages: fr_fr, it_it, ja_jp

source: The Seam Application Framework
fr_fr: Le serveur d'application Seam
it_it: Seam Application Framework
ja_jp: Seamアプリケーションフレームワーク

source: Seam makes it really easy to create applications by writing plain Java classes with annotations, which don't need to extend any special interfaces or superclasses. But we can simplify some common programming tasks even further, by providing a set of pre-built components which can be re-used either by configuration in <literal>components.xml</literal> (for very simple cases) or extension.
fr_fr: Seam rends vraiment plus simple de créer des applications en écrivant les pures-classes Java avec les annotations, qui n'ont pas besoin d'être étendue avec des interfaces spéciales ou des super-classes. Mais nous pouvons simplifier beaucoup plus des tâches communes de programmation en fournissant un groupe de composant pré-livrés qui peuvent être réutilisés en les configurant dans <literal>components.xml</literal> (pour les cas très simple) ou par extention.
it_it: Seam semplifica la creazione di applicazioni tramite la scrittura di classi Java semplici con annotazioni, che non hanno bisogno di estendere speciali interfacce o superclassi. Ma è possibile semplificare ulteriormente alcuni comuni compiti di programmazione, fornendo un set di componenti predefiniti che possono essere riutilizzati o tramite configurazione in <literal>components.xml</literal> (per casi molto semplici) o tramite estensione.
ja_jp: Seam は特殊なインタフェースやスーパークラスを拡張することなく、 純粋な Java クラスにアノテーションを付記することにより簡単にアプリケーションを作成することができます。 しかし、 <literal>components.xml</literal>の設定 (簡単な場合には) や機能の拡張により再利用する事ができる既成のコンポーネントを提供することで、 お決まりのプログラムについてさらに簡単に作成できるようにすることができます。

source: The <emphasis>Seam Application Framework</emphasis> can reduce the amount of code you need to write when doing basic database access in a web application, using either Hibernate or JPA.
fr_fr: Le <emphasis>Serveur d'Application Seam</emphasis> peut réduire la quantité de code que vous avez besoin d'écrire quand vous voulez faire les accès classiques à la base de données dans une application web, en utilisant aussi bien Hibernate ou JPA.
it_it: <emphasis>Seam Application Framework</emphasis> può ridurre la quantità di codice da scrivere nel fornire l'accesso ai database nelle applicazioni web, usando Hibernate o JPA.
ja_jp: <emphasis>Seamアプリケーションフレームワーク</emphasis>は、 JPA やHibernae を使ったデータベースへのアクセスに関わる基本的なプログラムのコード量を削減することができます。

source: We should emphasize that the framework is extremely simple, just a handful of simple classes that are easy to understand and extend. The "magic" is in Seam itself &#8212; the same magic you use when creating any Seam application even without using this framework.
fr_fr: Vous devriez apprécier que le serveur d'application soit extrèmement simple, juste un bagage de classes simples qui sont faciles à comprendre et à étendre. La "magie" est dans Seam lui-même &#8212; la même magie que vous utiliser quand vous créez tout application Seam même sans utiliser le serveur d'application.
it_it: Sottolineiamo che il framework è estremamente semplice, solamente una manciata di classi molto semplici, facili da capire e da estendere. La "magia" è in Seam stesso &#8212; la stessa magia che si usa nel creare un'applicazione Seam anche senza usare questo framework.

source: Introduction
it_it: Introduzione
ja_jp: はじめに

source: The components provided by the Seam application framework may be used in one of two different approaches. The first way is to install and configure an instance of the component in <literal>components.xml</literal>, just like we have done with other kinds of built-in Seam components. For example, the following fragment from <literal>components.xml</literal> installs a component which can perform basic CRUD operations for a <literal>Person</literal> entity:
fr_fr: Les composants fournies par le serveur d'application de Seam peuvent être utilisés d'une ou de deux manières différentes. La première façon est d'installer et de configurer une instance de composant dans <literal>components.xml</literal>, tout comme nous avons fait avec les autres types de composants livrés par Seam. Par exemple, le fragment suivant de <literal>components.xml</literal> installe un composant qui va réaliser les opérations basiques de CRUD pour l'entité <literal>Person</literal>:
it_it: I componenti forniti dal framework Seam possono essere usati secondo due differenti approcci. Il primo modo è installare e configurare un'istanza del componente in <literal>components.xml</literal>, come si è fatto con altri tipi di componenti Seam predefiniti. Per esempio, il seguente frammento da <literal>components.xml</literal> installa un componente che esegue semplici operazioni CRUD per un'entità <literal>Person</literal>:
ja_jp: Seam アプリケーションフレームワークの提供するコンポーネントは、 二つの使い方のいずれかで利用することができます。 第一の方法は、 他の Seam の組み込みコンポーネントで行っているように、 <literal>components.xml</literal> でコンポーネントのインスタンスをインストールし設定する方法です。 たとえば、 以下の <literal>components.xml</literal> 設定の一部では <literal>Person</literal> エンティティに対する基本的な CRUD 操作を実行できる 1 コンポーネントをインストールしています。

source: If that looks a bit too much like "programming in XML" for your taste, you can use extension instead:
fr_fr: i cela ressemble un peu beaucoup à "programmation en XML" à votre goût, vous pouvez utiliser une extention à la place:
it_it: Se per i propri gusti tutto questo sembra troppo "programmare in XML", è possibile altrimenti usare l'estensione:
ja_jp: 上記が「XML でのプログラミング」に偏重しているように思える場合は、 代りにコードを拡張して使用することもできます。

source: The second approach has one huge advantage: you can easily add extra functionality, and override the built-in functionality (the framework classes were carefully designed for extension and customization).
fr_fr: La seconde approche a un énorme avantage; vous pouvez facilement ajouter des fonctionnalités additionnelles, et surcharger les fonctionnalitées livrées par défaut (les classes du serveurd'applications sont précisément conçues pour l'extention et la personalisation).
it_it: Il secondo approccio ha un vantaggio enorme: si possono facilmente aggiungere funzionalità extra ed eseguire l'override di funzionalità predefinite (le classi del framework sono state attentamente progettate per l'estensione e la personalizzazione).
ja_jp: 第二の方法 (機能の拡張を使う) は大きなメリットとして、簡単に拡張したり、内蔵された機能をオーバーライドすることができます。 (このフレームワークの提供するクラスは、拡張や、カスタム化に対応できるよう、注意深く作成されています。)

source: A second advantage is that your classes may be EJB stateful session beans, if you like. (They do not have to be, they can be plain JavaBean components if you prefer.) If you are using JBoss AS, you'll need 4.2.2.GA or later:
fr_fr: Un deuxième avantage est que vos classes peuvent être des beans de session EJB avec état, si vous préférez (Ils ne sont pas obligés de l'être, ils peuvent être de pur composants JavaBean si vous préférez.) Si vous utiliser JBoss AS, vous allez avoir besoin de la 4.2.2GA ou supérieure:
it_it: Un secondo vantaggio è che le classi possono essere bean di sessione stateful EJB, se si vuole. (Non devono per forza esserlo, se si vuole possono essere componenti JavaBean semplici.) Se si sta usando JBoss AS, serve la versione 4.2.2.GA o successive:
ja_jp: また、 必要に応じてクラスを EJB のステートフルセッション Bean にできるというメリットもあります。 (必ずEJBにする必要はなく、好みで、プレーンなJavaBeanとすることもできます。) JBoss AS を使用される場合、4.2.2.GAあるいはそれ以降のバージョンが必須です。

source: You can also make your classes stateless session beans. In this case you <emphasis>must</emphasis> use injection to provide the persistence context, even if it is called <literal>entityManager</literal>:
fr_fr: Vous pouvez aussi faire de vos classes des beans de sessions sans état. Dans ce cas, vous <emphasis>devez</emphasis> utiliser l'injection pour fournir le contexte de persistance, meême s'il ya un appel à <literal>entityManager</literal>:
it_it: Si possono rendere le proprie classi bean di sessione stateless. In questo caso <emphasis>occorre</emphasis> usare l'injection per fornire il contesto di persistenza, anche se viene chiamato l'<literal>entityManager</literal>:
ja_jp: クラスをステートレスセッション Bean にすることもできます。 この場合、 その名前が <literal>entityManager</literal> であってもインジェクションを使って永続コンテキストを<emphasis>提供しなければなりません</emphasis>。

source: At this time, the Seam Application Framework provides four main built-in components: <literal>EntityHome</literal> and <literal>HibernateEntityHome</literal> for CRUD, along with <literal>EntityQuery</literal> and <literal>HibernateEntityQuery</literal> for queries.
fr_fr: A cette étape, le Serveur d'application de Seam fourni tout juste quatre composants livrés: <literal>EntityHome</literal>et <literal>HibernateEntityHome</literal> pour le CRUD, avec <literal>EntityQuery</literal> et <literal>HibernateEntityQuery</literal> pour les requêtes.
it_it: Attualmente Seam fornisce quattro componenti predefiniti: <literal>EntityHome</literal> e <literal>HibernateEntityHome</literal> per le operazioni CRUD, assieme a <literal>EntityQuery</literal> e <literal>HibernateEntityQuery</literal> per le query.
ja_jp: 現時点で、Seamアプリケーションフレームワークは、CRUD 用に<literal>EntityHome</literal> と<literal>HibernateEntityHome</literal>、それにQueryのための<literal>EntityQuery</literal> と <literal>HibernateEntityQuery</literal>の4つの組み込みメインコンポーネントを提供しています。

source: The Home and Query components are written so that they can function with a scope of session, event or conversation. Which scope you use depends upon the state model you wish to use in your application.
fr_fr: es composants Home et Query sont écris de façon qu' ils puissent fonctionner dans une étendue de session, d'évènement ou de conversation. L'étendue que vous utiliserez dépendra du modèle à état que vous souhaiterez utiliser dans votre application.
it_it: I componenti Home e Query sono scritti per funzionare con scope di sessione, evento o conversazione. Quale scope usare dipende dal modello di stato che si desidera usare nella propria applicazione.
ja_jp: HomeとQueryはセッション、イベント、それに対話スコープで機能するように作成されています。 どのスコープを使用するかは、アプリケーションのステートモデルに依存します。

source: The Seam Application Framework only works with Seam-managed persistence contexts. By default, the components will look for a persistence context named <literal>entityManager</literal>.
fr_fr: Le Serveur d'application de Seam fonctionnement seulement dans les contextes de persistances gérés par Seam. Par défaut, les composants vont chercher un contexte de persistance nommé <literal>entityManager</literal>.
it_it: Seam Application Framework funziona solo con contesti di persistenza gestiti da Seam. Di default i componenti cercano un contesto di persistenza chiamato <literal>entityManager</literal>.
ja_jp: SeamアプリケーションフレームワークはSeamが管理している永続性コンテキストでのみ動作します。 デフォルトで、<literal>entityManager</literal>という名前の永続性コンテキストを探します。

source: Home objects
fr_fr: Les objets Home
it_it: Oggetti Home
ja_jp: Homeオブジェクト

source: A Home object provides persistence operations for a particular entity class. Suppose we have our trusty <literal>Person</literal> class:
fr_fr: Un objet Home fourni les opérations de persistance pour une classe d'entité particulière. Supposons que nous avons notre classe valide <literal>Person</literal> class:
it_it: Un oggetto Home fornisce operazioni per la persistenza per una particolare classe entity. Si supponga di avere una classe <literal>Person</literal>:
ja_jp: Homeオブジェクトは、特定のエンティティクラスに対する永続性操作を提供します。<literal>Person</literal>クラスについて考えてみましょう。

source: We can define a <literal>personHome</literal> component either via configuration:
fr_fr: Nous pouvons définir un composant <literal>personHome</literal> via la configuration suivante:
it_it: E' possibile definire un componente <literal>personHome</literal> o via configurazione:
ja_jp: 構成ファイルで、下のように<literal>personHome</literal>コンポーネントを定義することができます。

source: Or via extension:
fr_fr: Ou via une extension:
it_it: O tramite estensione:
ja_jp: また、機能を拡張して下のように、同様のことができます。

source: A Home object provides the following operations: <literal>persist()</literal>, <literal>remove()</literal>, <literal>update()</literal> and <literal>getInstance()</literal>. Before you can call the <literal>remove()</literal>, or <literal>update()</literal> operations, you must first set the identifier of the object you are interested in, using the <literal>setId()</literal> method.
fr_fr: Un objet Home fourni les opérations suivantes: <literal>persist()</literal>, <literal>remove()</literal>, <literal>update()</literal> et <literal>getInstance()</literal>. Avant que vous puissiez appeler les opérations <literal>remove()</literal>, ou <literal>update()</literal> vous devez en premier définir l'identification de l'objet dont vous êtes en train de vous intéresser en utilisant la méthode s <literal>setId()</literal>.
it_it: Un oggetto Home fornisce le seguenti operazioni: <literal>persist()</literal>, <literal>remove()</literal>, <literal>update()</literal> e <literal>getInstance()</literal>. Prima di chiamare le operazioni <literal>remove()</literal>, o <literal>update()</literal>, occorre impostare l'identificatore dell'oggetto interessato, usando il metodo <literal>setId()</literal>.
ja_jp: Home オブジェクトは <literal>persist()</literal>、 <literal>remove()</literal>、 <literal>update()</literal>、 <literal>getInstance()</literal> の オペレーションを提供します。 <literal>remove()</literal>、あるいは <literal>update()</literal> を呼び出す前にまず <literal>setId()</literal> メソッドを用いて対象のオブジェクトの識別子をセットする必要があります。

source: We can use a Home directly from a JSF page, for example:
fr_fr: Vous pouvez utiliser un Home directement depuis une page JSF, pour exemple:
it_it: Si può usare un Home direttamente da una pagina JSF, per esempio:
ja_jp: Home は JSF ページから、下のように直接利用することができます。

source: Usually, it is much nicer to be able to refer to the <literal>Person</literal> merely as <literal>person</literal>, so let's make that possible by adding a line to <literal>components.xml</literal>:
fr_fr: Habituellement, il est plus jolie d'être capable de se référer à la <literal>Person</literal>presque comme une <literal>person</literal>, rendons cela possible en ajoutant une ligne à <literal>components.xml</literal>:
it_it: Di solito è più comodo poter fare riferimento a <literal>Person</literal> semplicemente come <literal>person</literal>, e quindi si aggiunga una linea a <literal>components.xml</literal>:
ja_jp: 通常、<literal>Person</literal>は<literal>person</literal>で参照できた方が便利ですので、<literal>components.xml</literal>に下のように一行加えて、そのようにしましょう。

source: (If we are using configuration.) Or by adding a <literal>@Factory</literal> method to <literal>PersonHome</literal>:
fr_fr: (Si nous utilisons la configuration). Ou en ajoutant la méthode <literal>@Factory</literal> a <literal>PersonHome</literal>:
it_it: (Se si usa la configurazione.) O si aggiunga un metodo <literal>@Factory</literal> a <literal>PersonHome</literal>:
ja_jp: (構成ファイルを使用している場合、) <literal>PersonHome</literal> に <literal>@Factory</literal> を追加します。

source: (If we are using extension.) This change simplifies our JSF page to the following:
fr_fr: (Si vous utilisons l'extention.) Cette modification simplifie notre page JSF comme ci-dessous:
it_it: (Se si usa l'estensione.) Questo cambiamento semplifica le pagine JSF come segue:
ja_jp: (機能を拡張している場合) これで、下のように JSF ページの記述が簡単になります。

source: Well, that lets us create new <literal>Person</literal> entries. Yes, that is all the code that is required! Now, if we want to be able to display, update and delete pre-existing <literal>Person</literal> entries in the database, we need to be able to pass the entry identifier to the <literal>PersonHome</literal>. Page parameters are a great way to do that:
fr_fr: Et bien, cela nous permet de créer de nouvelles entrées <literal>Person</literal> . Oui, c'est bien tout le code nécéssaire! Maintenant, si vous voulont être capable d'afficher, de modifier, d'éffacer des <literal>Person</literal> préexistantes dans la base de données, nous avons besoin de passer l'identifiant de l'entrée à <literal>PersonHome</literal>. Les paramètres de pages sont une excelente manière de faire cela:
it_it: Bene, questo crea nuove entry per <literal>Person</literal>. Esatto, questo è tutto il codice che serve! Ora se si vuole mostrare, aggiornare e cancellare le entry di <literal>Person</literal> già esistenti nel database, occorre passare l'identificatore delle entry a <literal>PersonHome</literal>. I parametri di pagina sono un eccezionale modo per farlo:
ja_jp: これで、<literal>Person</literal>の新しいエントリを作成することができるようになります。 はい、これですべてです。 次に、表示、更新、それに削除機能を既存のデータベースの <literal>Person</literal>エントリ操作に追加するためには、<literal>PersonHome</literal>に対象のエントリを特定する識別子を伝える必要があります。 下のように、ページパラメータを使って、これを行います。

source: Now we can add the extra operations to our JSF page:
fr_fr: Maintenant, nous pouvons ajouter les opérations additionnelles à notre page JSF:
it_it: Ora possiamo aggiungere operazioni extra alle pagine JSF:
ja_jp: これで、JSFページにこれらの機能を追加することができます。

source: When we link to the page with no request parameters, the page will be displayed as a "Create Person" page. When we provide a value for the <literal>personId</literal> request parameter, it will be an "Edit Person" page.
fr_fr: Quand nous lions notre page sans paramètres de requêtes, la page va être affiché comme une page "Création d'une personne". Quand nous fournissons une valeur au paramètre de requête <literal>personId</literal>, cela va être une page "Edition d'une personne".
it_it: Quando ci si collega alla pagina senza parametri di richiesta, la pagina verrà mostrata come una pagina "Create Person". Quando si fornisce un valore per il parametro di richiesta <literal>personId</literal>, sarà una pagina "Edit Person".
ja_jp: 要求パラメータ無しでページにリンクした場合、「Person作成」としてページが表示され、<literal>personId</literal> を要求パラメータとして渡した場合には、「Person編集」としてページが表示されます。

source: Suppose we need to create <literal>Person</literal> entries with their nationality initialized. We can do that easily, via configuration:
fr_fr: Supposons que nous avons besoin de créer une entrée <literal>Person</literal> avec sa nationnalité initialisée. Nous pouvons faire cela facilement via la configuration:
it_it: Si supponga di dover creare entry di <literal>Person</literal> con la nazionalità inizializzata. E' possibile farlo semplicemente via configurazione:
ja_jp: <literal>Person</literal> エントリの nationality を初期化して作成しなければならない場合を考えてみましょう。これも簡単にできます。 構成ファイルを使う場合は；

source: Or by extension:
fr_fr: Ou par extention:
it_it: O tramite estensione:
ja_jp: また、機能を拡張して行う場合は下の様になります。

source: Of course, the <literal>Country</literal> could be an object managed by another Home object, for example, <literal>CountryHome</literal>.
fr_fr: Bien sur, le <literal>Country</literal> peut être un objet géré par un autre objet Home, par exemple, <literal>CountryHome</literal>.
it_it: Certamente <literal>Country</literal> può essere un oggetto gestito da un altro oggetto Home, per esempio, <literal>CountryHome</literal>.
ja_jp: もちろん、<literal>Country</literal>オブジェクトは、例えば<literal>CountryHome</literal>という別の Home オブジェクトの管理下のオブジェクトとすることもできます。

source: To add more sophisticated operations (association management, etc), we can just add methods to <literal>PersonHome</literal>.
fr_fr: Pour ajouter des opérations plus sophistiquées (gestion d'association, etc.), nous pouvons juste ajouter les méthodes à <literal>PersonHome</literal>.
it_it: Per aggiungere altre operazioni sofisticate (gestione dell'associazione, ecc.) si possono aggiungere dei metodi a <literal>PersonHome</literal>.
ja_jp: アソシエーションの管理など、 より洗練された操作を実現するのも <literal>PersonHome</literal> にメソッドを追加するだけでできるようになります。

source: The Home object raises an <literal>org.jboss.seam.afterTransactionSuccess</literal> event when a transaction succeeds (a call to <literal>persist()</literal>, <literal>update()</literal> or <literal>remove()</literal> succeeds). By observing this event we can refresh our queries when the underlying entities are changed. If we only want to refresh certain queries when a particular entity is persisted, updated or removed we can observe the <literal>org.jboss.seam.afterTransactionSuccess.&lt;name&gt;</literal> event (where <literal>&lt;name&gt;</literal> is the simple name of the entity, e.g. an entity called "org.foo.myEntity" has "myEntity" as simple name).
fr_fr: L'objet Home déclenche un évènement <literal>org.jboss.seam.afterTransactionSuccess</literal> quand une transaction réussie (quand un appel à <literal>persist()</literal>, <literal>update()</literal> ou <literal>remove()</literal> réussit). En observant cet évènement nous pouvons rafraichir nos requêtes quand une entitées sousjacentes se modifie. Si nous voulons seulement rafraichir certains requêtes quand un entité particulière est persistée, mise-à-jour ou retirée, nous pouvons observer l'évènement <literal>org.jboss.seam.afterTransactionSuccess.&lt;name&gt;</literal> (avec <literal>&lt;name&gt;</literal> qui est le nom simple de l'entité par exemple une entité appelée "org.foo.myEntity" a comme nom simple "myEntity").
it_it: L'oggetto Home solleva un'evento <literal>org.jboss.seam.afterTransactionSuccess</literal> quando una transazione ha successo (una chiamata a <literal>persist()</literal>, <literal>update()</literal> o <literal>remove()</literal> ha successo). Osservando questo evento si può fare il refresh delle query quando cambiano le entità sottostanti. Se si vuole solo eseguire il refresh quando una particolare entità viene persistita, aggiornata o rimossa, si può osservare l'evento <literal>org.jboss.seam.afterTransactionSuccess.&lt;name&gt;</literal> (dove <literal>&lt;name&gt;</literal> è il nome semplice dell'entity, es. un entity chiamata "org.foo.myEntity" ha nome semplice "myEntity").

source: The Home object automatically displays faces messages when an operation is successful. To customize these messages we can, again, use configuration:
fr_fr: L'objet Home affiche automatiquement les messages faces quand une opération est réussit. Pour personnaliser ces messages, nous pouvons, encore, utiliser la configuration:
it_it: L'oggetto Home mostra automaticamente i messaggi faces quando un'operazione ha successo. Per personalizzare questi messaggi si può ancora usare la configurazione:
ja_jp: Homeオブジェクトは操作が成功したときに自動的にフェースメッセージを表示します。 これを、カスタマイズするには、下のように構成を設定します。

source: Or extension:
fr_fr: Ou l'extension:
it_it: O estensione:
ja_jp: あるいは、機能を拡張して下のようにすることもできます。

source: But the best way to specify the messages is to put them in a resource bundle known to Seam (the bundle named <literal>messages</literal>, by default).
fr_fr: Mais la meilleure façon pour spécifier le message est de le mettre dans le lot de ressource connu par Seam (le lot nommé <literal>messages</literal>, par défaut).
it_it: Ma il modo migliore per specificare i messaggi è metterli in un resource bundle noto a Seam (di default, il nome del bundle è <literal>messages</literal>).
ja_jp: しかし、メッセージ定義における最良の方法は (デフォルトで <literal>messages</literal> という名前の) Seam に対して既知のリソースバンドルに定義することでしょう。

source: This enables internationalization, and keeps your code and configuration clean of presentation concerns.
fr_fr: Cela active l'internationnalisation et converse votre code et votre configuration propre de ce qui concerne la présentation.
it_it: Questo abilita l'internazionalizzazione e mantiene il codice e la configurazione puliti dagli elementi di presentazione.
ja_jp: この方法を使えば、国際化に対応することができますし、コードや構成ファイルとプレゼンテーション層とを切り離すことができます。
