Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Gettingstarted.po
Languages: fr_fr, it_it, ja_jp

source: Getting started with Seam, using seam-gen
fr_fr: Démarrage avec Seam en utilisant seam-gen
it_it: Iniziare con Seam usando seam-gen
ja_jp: seam-gen を使って Seam を始めよう

source: The Seam distribution includes a command line utility that makes it really easy to set up an Eclipse project, generate some simple Seam skeleton code, and reverse engineer an application from a preexisting database.
fr_fr: La distribution Seam inclus un utilitaire en ligne de commande qui permet facilement de configurer un projet Eclipse, de générer un squelette de code simple Seam et de réaliser une ingénierie inverse sur une base de données pré existante.
it_it: La distribuzione Seam comprende una utility da linea di comando che facilita la configurazione di un progetto eclipse, la generazione di un semplice codice skeleton Seam, ed il reverse engineer di un'applicazione da un database esistente.
ja_jp: Seam ディストリビューションはコマンドラインユーティリティを含んでおり、 Eclipse プロジェクトのセットアップ、 Seam のスケルトンコードの生成、 既存データベースからアプリケーションのリバースエンジニアリングをとても簡単にします。

source: This is the easy way to get your feet wet with Seam, and gives you some ammunition for next time you find yourself trapped in an elevator with one of those tedious Ruby guys ranting about how great and wonderful his new toy is for building totally trivial applications that put things in databases.
fr_fr: C’est une façon simple de garder les pieds au sec avec Seam, et de vous donnez des munitions pour la prochaine fois que vous vous trouverez enfermer dans un ascenseur avec un de ces gars tordus de Ruby vous taquinant sur le fait que leur jouet est génial et merveilleux pour construire des applications triviales qui mettent des choses dans les base de données.
it_it: Questo è il modo più semplice di sporcarti le mani con Seam e di preparare il colpo in canna per la prossima volta che ti troverai intrappolato in ascensore con uno di quei noiosi tipi di Ruby-on-Rail che farneticano quanto magnifico e meraviglioso sia l'ultimo giochino che hanno scoperto per realizzare applicazioni completamente banali che schiaffano delle cose nel database.
ja_jp: これは、Seam 入門として良い方法です。 そして、状態をデータベースに保管するとてもつまらないアプリケーションを構築するために、 新しいおもちゃがどれほどすばらしいかを大げさに話す退屈な Ruby 野郎の一人に次にエレベータの中で捕まったとわかった時のために、 攻撃材料を与えてくれます。

source: In this release, seam-gen works best for people with JBoss AS. You can use the generated project with other J2EE or Java EE 5 application servers by making a few manual changes to the project configuration.
fr_fr: Dans cette version, seam-gen fonctionne mieux pour tous avec JBoss AS. Vous pouvez utiliser le projet généré avec d’autre serveurs d’application J2EE ou Java EE5. en réalisant plusieurs modifications à la main à la configuration du projet.
it_it: In questa relase, seam-gen funziona meglio per coloro che hanno JBoss AS. Si può usare il progetto generato con altri server J2EE o Java EE 5 facendo alcuni cambiamenti alla configurazione del progetto.
ja_jp: このリリースでは、seam-gen は JBoss AS で使用するのが最良です。 プロジェクト設定をマニュアルで少し変更するだけで、生成されたプロジェクトを他の J2EE や Java 5 アプリケーションサーバー用にも使用可能です。

source: You <emphasis>can</emphasis> use seam-gen without Eclipse, but in this tutorial, we want to show you how to use it in conjunction with Eclipse for debugging and integration testing. If you don't want to install Eclipse, you can still follow along with this tutorial—all steps can be performed from the command line.
fr_fr: Vous <emphasis>pouvez</emphasis> utiliser seam-gen sans Eclipse, mais dans ce tutoriel, nous voulons vous montrer comment l’utiliser en conjonction avec Eclipse pour le débogage ou l’intégration des test. Si vous ne voulez pas installer Eclipse vous pouvez quand même suivre ce tutoriel—toutes les étapes peuvent être réalisées depuis la ligne de commande.
it_it: Si <emphasis>può</emphasis> usare seam-gen senza Eclipse, ma in questo tutorial, si vuole mostrare l'uso assieme ad Eclipse per il debugging ed i test. Se non si vuole installare Eclipse, si può seguire comunque questo tutorial - tutti i passi possono essere eseguiti da linea di comando.
ja_jp: Eclipse がなくても seam-gen は<emphasis>使用可能</emphasis>ですが、このチュートリアルでは Eclipse を使用してデバッグや統合テストを行う方法を示したいと思います。 Eclipse をインストールしたくない方も、 このチュートリアルを続けることができます — コマンドラインからすべてのステップは実行可能です。

source: seam-gen is basically just an intricate Ant script wrapped around Hibernate Tools, together with some templates. That makes it easy to customize if you need to.
fr_fr: Seam-gen est simplement un gros script Ant bien déguelasse utilisant des outils Hibernate, liant ensemble des patrons. Ce qui rends facile la personnalisation cela vos besoins.
it_it: Seam-gen è essenzialmente uno script Ant avvolto attorno a Hibernate Tools, assieme a qualche template. Questo facilita la sua personalizzazione in caso di bisogno.

source: Before you start
fr_fr: Avant de démarrer
it_it: Prima di iniziare
ja_jp: 始める前に

source: Make sure you have JDK 5 or JDK 6 (see <xref linkend="jdk_dependencies"/> for details), JBoss AS 4.2 or 5.0 and Ant 1.7.0, along with recent versions of Eclipse, the JBoss IDE plugin for Eclipse and the TestNG plugin for Eclipse correctly installed before starting. Add your JBoss installation to the JBoss Server View in Eclipse. Start JBoss in debug mode. Finally, start a command prompt in the directory where you unzipped the Seam distribution.
fr_fr: Soyez sur d’avoir JDK5 ou JDK6 (voir <xref linkend="jdk_dependencies"/> pour les détails), JBoss AS 4.2 ou 5.0 et Ant 1.7.0, avec des versions récentes d’Eclipse, de Jboss IDE plugin pour Eclipse et de TestNG plugin pour Eclipse correctement installés avant le démarrage. Ajoutez votre installation JBoss a la vue Server JBoss dans Eclipse. Démarrer JBoss en mode debug. Enfin, démarrez un interpréteur de commande dans le dossier où vous avez dézipper la distribution de Seam.
it_it: Assicurarsi di avere JDK 5 o JDK 6 (vedere <xref linkend="jdk_dependencies"/> per maggiori dettagli), JBoss AS 4.2 o 5.0 e Ant 1.7.0, con una versione recente di Eclipse, il plugin JBoss IDE di Eclipse ed il plugin TestNG per Eclipse correttamente installati prima di avviare. Aggiungere l'installazione di JBoss alla vista di JBoss Server in Eclipse. Avviare JBoss in modalità debug. Infine, avviare da comando all'interno della directory dove si è scompattato la distribuzione Seam.

source: JBoss has sophisticated support for hot re-deployment of WARs and EARs. Unfortunately, due to bugs in the JVM, repeated redeployment of an EAR—which is common during development—eventually causes the JVM to run out of perm gen space. For this reason, we recommend running JBoss in a JVM with a large perm gen space at development time. If you're running JBoss from JBoss IDE, you can configure this in the server launch configuration, under "VM arguments". We suggest the following values:
fr_fr: Jboss dispose d’un support sophistiquer pour le redéploiement à chaud des WARs et des EARs. Malheureusement, à cause de bugs dans la JVM, le redéploiement répété de EAR—ce qui est habituel dans la phase de développement—peut éventuellement entrainer la JVM a être à cours d’espace perm gen. Pour cette raison, nous recommandons d’exécuter JBoss dans une JVM avec un large espace perm gen pendant la période de développement. Si vous exécuter Jboss depuis JBoss IDE, vous pouvez configurer cela dans la configuration de lancement du serveur, dans "VM arguments". Nous vous conseillons les valeurs suivantes :
it_it: JBoss ha un supporto sofisticato per l'hot re-deploy di WAR e EAR. Sfortunatamente, a causa di bug alla JVM, ripetuti redeploy di un EAR—situazione frequente durante lo sviluppo—causano un perm gen space della JVM. Per questa ragione, in fase di sviluppo si raccomanda di eseguire JBoss in una JVM avente parecchio perm gen space. Se si esegue JBoss da JBoss IDE, si può configurare questo nella configurazione di lancio del server, sotto "VM arguments". Si suggeriscono i seguenti valori:
ja_jp: JBoss は WAR や EAR の優れたホット再デプロイメントをサポートします。 残念ながら、 JVM にバグがあるため、 — 開発段階では一般的な — EAR の再デプロイメントを繰り返すと最終的には JVM が perm gen スペースを使い果たしてしまうことになります。 この理由により、デプロイメント時に perm gen space を大きく確保した JVM で JBoss を稼動させることを推奨します。 JBoss IDE から JBoss を稼動させる場合は、 「VM 引数」の下にあるサーバ起動設定でこれを設定することができます。 以下のような値を推奨します。

source: If you don't have so much memory available, the following is our minimum recommendation:
fr_fr: Si vous ne disposez pas d’assez de mémoire, ce qui suit est notre recommandation minimale :
it_it: Se non si ha molta memoria disponibile, si raccomanda come minimo:
ja_jp: 十分なメモリがない場合には、以下が最小の推奨値です。

source: If you're running JBoss from the command line, you can configure the JVM options in <literal>bin/run.conf</literal>.
fr_fr: vous exécuter JBoss depuis la ligne de commande, vous pouvez configurer les options de la JVM dans <literal>bin/run.conf</literal>.
it_it: Se si esegue JBoss da linea di comando, si possono configurare le opzioni JVM in <literal>bin/run.conf</literal>.
ja_jp: コマンドラインから JBoss を起動しているならば、 <literal>bin/run.conf</literal> の JVM オプション設定が可能です。

source: If you don't want to bother with this stuff now, you don't have to—come back to it later, when you get your first <literal>OutOfMemoryException</literal>.
fr_fr: Si vous ne voulez pas vous inquiéter de ce truc pour l’instant, nous n’êtes pas obligé, revenez y plus tard quand vous rencontrer votre premier <literal>OutOfMemoryException</literal>..
it_it: Se non si vuole avere a che fare con queste cose adesso, si lasci stare—ce ne si occuperà quando capiterà la prima <literal>OutOfMemoryException</literal>.
ja_jp: 今すぐに変更を行いたくない場合は特に行う必要はありません — <literal>OutOfMemoryException</literal> が発生した時点で対処してください。

source: Setting up a new project
fr_fr: Configurer un nouveau projet Eclipse
it_it: Comfigurare un nuovo progetto

source: The first thing we need to do is configure seam-gen for your environment: JBoss AS installation directory, project workspace, and database connection. It's easy, just type:
fr_fr: La première chose que vous avez besoin de faire est de configurer seam-gen pour votre environnement : le dossier d’installation de JBoss AS, l'espace de travail d’Eclipse et connexion à la base de données. C'est simple, entrez juste :
it_it: La prima cosa da fare è configurare seam-gen per il proprio ambiente: la directory di installazione JBoss AS, il workspace, e la connessione del database. E' facile, si digiti:

source: And you will be prompted for the needed information:
fr_fr: Et vous allez être interrogé pour un complément d’information :
it_it: E verranno richieste le informazioni necessarie:
ja_jp: 以下のように必要な情報の入力を要求されるでしょう。

source: The tool provides sensible defaults, which you can accept by just pressing enter at the prompt.
fr_fr: Cet outil fourni des valeurs par défaut judicieuses que vous pouvez accepter juste en appuyant sur la couche enter à la demande.
it_it: Il tool fornisce dei valori di default, che possono essere accettati semplicemente premendo Invio alla richiesta.
ja_jp: このツールは気の利いたデフォルト値を提供します。 プロンプトに対して単に enter を押すだけで大丈夫です。

source: The most important choice you need to make is between EAR deployment and WAR deployment of your project. EAR projects support EJB 3.0 and require Java EE 5. WAR projects do not support EJB 3.0, but may be deployed to a J2EE environment. The packaging of a WAR is also simpler to understand. If you installed an EJB3-ready application server like JBoss, choose <literal>ear</literal>. Otherwise, choose <literal>war</literal>. We'll assume that you've chosen an EAR deployment for the rest of the tutorial, but you can follow exactly the same steps for a WAR deployment.
fr_fr: Le choix le plus important que vous devez faire est entre un déploiement EAR et un déploiement WAR pour votre projet. Les projets EAR supportent EJB 3.0 et nécessite Java EE5. Les projets WAR ne supportent pas EJB 3.0 mais peuvent être déployés dans un environnement J2EE. Le conditionnement en WAR est aussi plus simple à comprendre. Si vous avez installé un server d’application opérationnel EJB3 comme JBoss, choisissez <literal>ear</literal>. Sinon, choississez <literal>war</literal>. Nous allons partir du principe que vous avez choisi un déploiement EAR pour le reste du tutoriel, mais vous pouvez suivre exactement les même étapes pour un déploiement WAR.
it_it: La scelta più importante da fare è tra il deploy EAR e il deploy WAR del progetto. I progetti EAR supportano EJB 3.0 e richiedono Java EE 5. I progetti WAR non supportano EJB 3.0, ma possono essere deployati in ambienti J2EE. L'impacchettamento di un WAR è più semplice da capire. Se si installa un application server predisposto per EJB3, come JBoss, si scelga <literal>ear</literal>. Altrimenti si scelga <literal>war</literal>. Assumeremo per il resto del tutorial che la scelta sia il deploy EAR, ma si potranno compiere gli stessi passi per il deploy WAR.
ja_jp: 決める必要がある重要な選択は、プロジェクトとして EAR 形式デプロイと WAR 形式デプロイのどちらにするかです。 EAR プロジェクトは EJB 3.0 に対応し Java EE 5 が必要です。 WAR プロジェクトは EJB 3.0 には対応しませんが J2EE 環境にデプロイ可能になります。 WAR は EAR に比べシンプルで理解しやすいパッケージです。 JBoss のような EJB3 が実行可能なアプリケーションサーバーにインストールする場合は <literal>ear</literal> を選択してください。 これ以外は <literal>war</literal> を選択してください。 以降、 このチュートリアルでは EAR デプロイメントが選択されたと仮定しますが、 WAR デプロイメントの場合もまったく同じステップで進むことができます。

source: If you are working with an existing data model, make sure you tell seam-gen that the tables already exist in the database.
fr_fr: Si vous travaillez avec un modèle de données déjà existant, soyez sur d’indiquer à seam-gen que des tables existent déjà dans la base de données.
it_it: Se si sta lavorando con un modello di dati esistente, ci si assicuri di dire a seam-ger che le tabelle esistono già nel database.
ja_jp: 既存のデータモデルで作業をしている場合、 データベースに既にテーブルが存在していることを seam-gen に必ず知らせてください。

source: The settings are stored in <literal>seam-gen/build.properties</literal>, but you can also modify them simply by running <literal>seam setup</literal> a second time.
fr_fr: Les régleages sont stockés dans <literal>seam-gen/build.properties</literal>, mais vous pouvez aussi les modifier simplement en relançant <literal>seam setup</literal> une seconde fois.
it_it: Le impostazioni vengono memorizzate in <literal>seam-gen/build.properties</literal>, ma si possono anche modificare eseguendo semplicemente una seconda volta <literal>seam setup</literal>.
ja_jp: 設定は <literal>seam-gen/build.properties</literal> に格納されていますが、 二度目に <literal>seam setup</literal> を実行することで変更することも可能です。

source: Now we can create a new project in our Eclipse workspace directory, by typing:
fr_fr: Maintenant vous pouvez créer un nouveau projet dans le dossier de votre espace de travail d’Eclipse, en entrant :
it_it: Ora è possibile creare un nuovo progetto nella directory di workspace di Eclipse, digitando:
ja_jp: 以下のようにタイプすることで、Eclipse ワークスペースディレクトリに、 新規プロジェクトの生成が可能です。

source: This copies the Seam jars, dependent jars and the JDBC driver jar to a new Eclipse project, and generates all needed resources and configuration files, a facelets template file and stylesheet, along with Eclipse metadata and an Ant build script. The Eclipse project will be automatically deployed to an exploded directory structure in JBoss AS as soon as you add the project using <literal>New -&gt; Project... -&gt; General -&gt; Project -&gt; Next</literal>, typing the <literal>Project name</literal> (<literal>helloworld</literal> in this case), and then clicking <literal>Finish</literal>. Do not select <literal>Java Project</literal> from the New Project wizard.
fr_fr: Cela recopie les jars de Seam, les jars nécéssaires et le jar du pilote JDBC dans un nouveau projet Eclipse et génère tout les fichiers de configuration et les ressources requises, le fichier modèle facelets et la feuille de style, ainsi que les metadata Eclipse et le script de construction Ant. Le projet Eclipse va être automatiquement déployé dans une structure de dossiers transférer dans JBoss AS dès que vous ajouterez le projet en utilisant <literal>New -&gt; Project... -&gt; General -&gt; Project -&gt; Next</literal>, entrez le <literal>Project name</literal> ( <literal>helloworld</literal> dans notre cas), et alors cliquez sur <literal>Finish</literal>. Ne sélectionnez pas <literal>Java Project</literal> dans l'assistant de Nouveau Projet.
it_it: Questo copia i jar Seam, i jar dipendenti ed il driver JDBC nel nuovo progetto Eclipse, e genera tutte le risorse necessarie ed il file di configurazione, i file template di facelets ed i fogli di stile, assieme ai metadati di Eclipse e allo script per il build di Ant. Il progetto Eclipse verrà automaticamente deployato in una struttura di directory esplosa in JBoss AS non appena si aggiungerà il progetto usando <literal>New -&gt; Project... -&gt; General -&gt; Project -&gt; Next</literal>, digitando <literal>Project name</literal> (<literal>helloworld</literal> in questo caso), e poi cliccando <literal>Finish</literal>. Non selezionare <literal>Java Project</literal> dallo wizard New Project.
ja_jp: Seam jar、依存する jar そして JDBC ドライバ jar を新しい Eclipse プロジェクトにコピーし、 Eclipse メタデータおよび Ant ビルドスクリプトに従って必要となるすべてのリソースと設定ファイル群、 facelets テンプレートファイル、 スタイルシートを生成します。 <literal>新規 -&gt; プロジェクト... -&gt; 一般 -&gt; プロジェクト -&gt; 次へ</literal> の手順でプロジェクトを追加し、 <literal>プロジェクト名</literal> (この場合、 <literal>helloworld</literal>) を入力して、 <literal>完了</literal> をクリックすれば、 Eclipse プロジェクトは自動的に展開された JBoss AS ディレクトリ構造にデプロイされます。 新規プロジェクトウィザードから <literal>Java プロジェクト</literal> は選択しないでください。

source: If your default JDK in Eclipse is not a Java SE 5 or Java SE 6 JDK, you will need to select a Java SE 5 compliant JDK using <literal>Project -&gt; Properties -&gt; Java Compiler</literal>.
fr_fr: Si votre JDK par défaut dans Eclipse n’est pas un SDK Java SE 5 ou Java SE 6, vous allez devoir sélectionner un JDK compatible Java SE 5 en faisant <literal>Project -&gt; Properties -&gt; Java Compiler</literal>.
it_it: Se in Eclipse la JDK di default non è Java SE 5 o Java SE 6 JDK, occorre selezionare un JDK compatibile Java SE 5 usando <literal>Project -&gt; Properties -&gt; Java Compiler</literal>.
ja_jp: Eclipse のデフォルト JDK が Java SE 5 あるいは Java SE 6 の JDK でなければ、 <literal>プロジェクト -&gt; プロパティ -&gt; Java コンパイラ</literal> の手順で、Java SE 5 互換の JDK を選ぶ必要があります。

source: Alternatively, you can deploy the project from outside Eclipse by typing <literal>seam explode</literal>.
fr_fr: utre alternative, vous pouvez déployer le projet hors d’Eclipse en entrant <literal>seam explode</literal>.
it_it: in alternativa, si può eseguire il deploy del progetto dal di fuori di Eclipse digitando <literal>seam explode</literal>.
ja_jp: 別の方法として、Eclise の外部から <literal>seam explode</literal> とタイプすることでプロジェクトのデプロイが可能です。

source: Go to <literal>http://localhost:8080/helloworld</literal> to see a welcome page. This is a facelets page, <literal>view/home.xhtml</literal>, using the template <literal>view/layout/template.xhtml</literal>. You can edit this page, or the template, in Eclipse, and see the results <emphasis>immediately</emphasis>, by clicking refresh in your browser.
fr_fr: Allez sur <literal>http://localhost:8080/helloworld</literal> pour voir la page d’accueil. C’est une page facelets, <literal>view/home.xhtml</literal>, l, en utilisant le modèle <literal>view/layout/template.xhtml</literal>. Vous pouvez éditer cette page, ou le modèle dans Eclipse et voir le résultat <emphasis>immediately</emphasis>, en appuyant sur le bouton actualiser de votre navigateur.
it_it: Si vada in <literal>http://localhost:8080/helloworld</literal> per vedere la pagina di benvenuto. Questa è una pagina facelets, <literal>view/home.xhtml</literal>, che utilizza il template <literal>view/layout/template.xhtml</literal>. In Eclipse si può modificare questa pagina, oppure il template, e vedere <emphasis>immediatamente</emphasis> i risultati, cliccando il pulsante aggiorna del browser.

source: Don't get scared by the XML configuration documents that were generated into the project directory. They are mostly standard Java EE stuff, the stuff you need to create once and then never look at again, and they are 90% the same between all Seam projects. (They are so easy to write that even seam-gen can do it.)
fr_fr: Ne soyez pas effrayé par les documents de configuration XML qui ont été généré dans le dossier du projet. Ils sont pour la plus part des trucs standards Java EE, un truc créé une fois et plus jamais consulté ensuite et ceci est le cas dans 90% des projets Seam. ( ils sont si facile à écrire que même seam-gen peut le faire.)
it_it: Non si abbia paura dell'XML, i documenti di configurazione generati nella directory di progetto. Per la maggiore parte delle volte sono standard per Java EE, parti che servono per creare la prima volta e poi non si guarderanno più, ed al 90% sono sempre le stesse per ogni progetto Seam. (Sono così facili da scrivere che anche seam-gen può farlo.)
ja_jp: プロジェクトディレクトリに XML 設定ドキュメントが生成されますがびっくりしないでください。 これらのほとんどが標準 Java EE に関するもので、 一度生成したら 二度と見る必要のないものです。 全 Seam プロジェクトで 90% は同じものです。 (seam-gen ができるほどですから記述が非常に簡単なドキュメントです。)
