Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Getting_Started_With_JBoss_Tools.po
Languages: fr_fr, ja_jp

source: Getting started with Seam, using JBoss Tools
fr_fr: Démarrer avec Seam en utilisant JBoss Tools
ja_jp: JBoss Tools を使って Seam を始めよう

source: JBoss Tools is a collection of Eclipse plugins. JBoss Tools a project creation wizard for Seam, Content Assist for the Unified Expression Language (EL) in both facelets and Java code, a graphical editor for jPDL, a graphical editor for Seam configuration files, support for running Seam integration tests from within Eclipse, and much more.
fr_fr: JBoss Toolsest une collection de plugins Eclipse. JBoss Tools est un projet de d'assistant de création de Seam, Content Assist pour Unified Expression Language (EL) à la fois en facelets et en code Java, un editeur graphique pour le jPDL, un editeur graphique pour les fichiers de configuration de Seam, le support pour l'exécution des tests d'intégration de Seam depuis Eclipse, et bien plus.
ja_jp: JBoss Tools は Eclipse プラグインを集めたものです。 JBoss Tools は Seam プロジェクト作成ウィザード、facelets と Java コードの Unified Expression Language (EL) のための入力補助、jPDLのためのグラフィックエディタ、Seam 設定ファイルのためのグラフィックエディタ、Eclipse から Seam 統合テストの実行サポートなどです。

source: In short, if you are an Eclipse user, then you'll want JBoss Tools!
fr_fr: Pour faire simple, si vous ête un utilisateur d'Eclipse, alors vous allez vouloirs JBoss Tools!
ja_jp: 端的にいえば、Eclipse ユーザーであれば、JBoss Tools を必要とするでしょう。

source: JBoss Tools, as with seam-gen, works best with JBoss AS, but it's possible with a few tweaks to get your app running on other application servers. The changes are much like those described for seam-gen later in this reference manual.
fr_fr: JBoss Tools, avec seam-gen, fonctionne mieux avec le JBoss AS, mais si c'est pas possible avec quelques trucs d'avoir votre application qui s'exécute sur les autres seveurs d'applications. Le changement est surtout pour ce qui est décrit plus loin pour seam-gen dans ce manueld e référence.
ja_jp: seam-gen 同様 JBoss Tools は JBoss AS と動作させるのが好ましいのですが、わずかに変更することで他のアプリケーションサーバーでも動作させることが可能です。 変更はこのリファレンスマニュアル中の seam-gen の記述と似ています。

source: Before you start
fr_fr: Avant de commencer
ja_jp: 始める前に

source: Make sure you have JDK 5, JBoss AS 4.2 or 5.0, Eclipse 3.3, the JBoss Tools plugins (at least Seam Tools, the Visual Page Editor, jBPM Tools and JBoss AS Tools) and the TestNG plugin for Eclipse correctly installed before starting.
fr_fr: Vérifiez que vous avez JDK 5, JBoss AS 4.2 ou 5.0, Eclipse 3.3, le JBoss Tools plugins (à minima Seam Tools, le Visual Page Editor, jBPM Tools et JBoss AS Tools) et le plugin TestNG pour Eclipse correctement installé avant de commencer.

source: Please see the official <ulink url="http://www.jboss.org/tools/download/installation">JBoss Tools installation</ulink> page for the quickest way to get JBoss Tools setup in Eclipse. You can also check out the <ulink url="http://www.jboss.org/community/wiki/InstallingJBossTools">Installing JBoss Tools</ulink> page on the JBoss community wiki for the gory details and a set of alternative installation approaches.
fr_fr: Merci de consulter la page officielle <ulink url="http://www.jboss.org/tools/download/installation">JBoss Tools installation</ulink> pour la plus rapide façon d'avoir l'installation de JBoss Tools dans Eclipse. Vous pouvez aussi consulter la page <ulink url="http://www.jboss.org/community/wiki/InstallingJBossTools">Installing JBoss Tools</ulink> sur le wiki de la communauté JBoss pour les détails les plus extrèmes et une suite d'approches alternatives.

source: Setting up a new Seam project
fr_fr: Configuration d'un nouveau projet Seam
ja_jp: 新しい Eclipse プロジェクトのセットアップ

source: Start up Eclipse and select the <emphasis>Seam</emphasis> perspective.
fr_fr: Démarrez Eclipse et sélectionnez la perspective <emphasis>Seam</emphasis>.
ja_jp: Eclipse を起動して <emphasis>Seam</emphasis> パースペクティブを選択してください。

source: Go to <emphasis>File</emphasis> -> <emphasis>New</emphasis> -> <emphasis>Seam Web Project</emphasis>.
fr_fr: Allez dans <emphasis>File</emphasis> -> <emphasis>New</emphasis> -> <emphasis>Seam Web Project</emphasis>.
ja_jp: <emphasis>File</emphasis> -> <emphasis>New</emphasis> -> <emphasis>Seam Web Project</emphasis> とすすめます。

source: First, enter a name for your new project. For this tutorial, we're going to use <literal>helloworld</literal> .
fr_fr: En premier lieu, entrez un nom pour votre nouveau projet. Pour ce tutoriel, nous allons utiliser<literal>helloworld</literal> .
ja_jp: 最初に、プロジェクト名を登録します。 このチュートリアルでは <literal>helloworld</literal> とします。

source: Now, we need to tell JBoss Tools about JBoss AS. In this example we are using JBoss AS 4.2, though you can certainly use JBoss AS 5.0 as well. Selecting JBoss AS is a two step process. First we need to define a runtime. Again, we'll choose JBoss AS 4.2 in this case:
fr_fr: Maintenant, vous devez indiquer à JBoss Tools où est JBoss AS. Dans cet exemple, nous utilisons JBoss AS, pensez que vous pouvez certainement utiliser JBoss AS 5.0 tout aussi bien. La sélection de JBoss AS est un processus en deux étapes. En premier vous avez besoin de le définir à l'exécution. Ensuite, vous allez choisir JBoss AS, dasn ce cas:

source: Enter a name for the runtime, and locate it on your hard drive:
fr_fr: Entrez le nom à l'exécution, et localisez le sur votre disque dur:
ja_jp: ランタイムの名前を登録し、ハードディスク上の位置を指定します。

source: Next, we need to define a server JBoss Tools can deploy the project to. Make sure to again select JBoss AS 4.2, and also the runtime you just defined:
fr_fr: Ensuite, vous devez définir un serveur pour que JBoss Tools puisse y déployer le projet. Soyez sur de sélectionner encore une fois JBoss AS et aussi à l'exéuction vous devez juste définir:
ja_jp: 次に、JBoss Tools がプロジェクトをデプロイ可能なサーバを定義する必要があります。 ここでも JBoss AS 4.2 と直前で定義したランタイムを選択してください。

source: On the next screen give the server a name, and hit <emphasis>Finish</emphasis>:
fr_fr: Sur l'écran suivant donnez au serveur un nom, et appuyez sur <emphasis>Finish</emphasis>:
ja_jp: 次のサーバに名前をつける画面では、<emphasis>Finish</emphasis> を押してください。

source: Make sure the runtime and server you just created are selected, select <emphasis>Dynamic Web Project with Seam 2.0 (technology preview)</emphasis> and hit <emphasis>Next</emphasis>:
fr_fr: Soyez sur qu'à l'exécution et que le server que vous avez juste créez sont sélectionné, sélectionnez <emphasis>Dynamic Web Project with Seam 2.0 (technology preview)</emphasis> et appuyez sur <emphasis>Next</emphasis>:
ja_jp: いま作成と選択をしたランタイムとサーバを確認して、<emphasis>Dynamic Web Project with Seam 2.0 (technology preview)</emphasis> を選択して <emphasis>Next</emphasis> を押してください。

source: The next 3 screens allow you to further customize your new project, but for us the defaults are fine. So just hit <emphasis>Next</emphasis> until you reach the final screen.
fr_fr: Les 3 écrans suivants vous permettent de personnalisé votre nouveau projet, mais pour nous les réglages par défaut seront très bien. Donc appuyez juste sur <emphasis>Next</emphasis> tant que vous n'avez pas atteind l'écran final.

source: The first step here is to tell JBoss Tools about the Seam download you want to use. <emphasis>Add</emphasis> a new <emphasis>Seam Runtime</emphasis> - make sure to give it a name, and select <emphasis>2.0</emphasis> as the version:
fr_fr: La première étape ici est de dire à JBoss Tools où se trouve le Seam téléchargé que vous voulez utiliser. <emphasis>Add</emphasis> un nouveau <emphasis>Seam Runtime</emphasis> - soyez sur d'indiquer le nom , et sélectionez <emphasis>2.0</emphasis> comme version:
ja_jp: 最初のステップは JBoss Tools を使用する上で必要な Seam ランタイムを指定します。 新しい <emphasis>Seam Runtime</emphasis> を<emphasis>追加</emphasis>します。 - 名前をつけて、バージョンとして <emphasis>2.0</emphasis> を選択してください。

source: The most important choice you need to make is between EAR deployment and WAR deployment of your project. EAR projects support EJB 3.0 and require Java EE 5. WAR projects do not support EJB 3.0, but may be deployed to a J2EE environment. The packaging of a WAR is also simpler to understand. If you installed an EJB3-ready application server like JBoss, choose <emphasis>EAR</emphasis>. Otherwise, choose <emphasis>WAR</emphasis>. We'll assume that you've chosen a WAR deployment for the rest of the tutorial, but you can follow exactly the same steps for a EAR deployment.
fr_fr: La choix le plus important que vous devez faire est entre un déploiement EAR ou un déploiement WAR de votre projet. Les projets EAR supportent les EJB 3.0 et nécéssitent Java EE5. Les projets WAR ne supportent pas les EJB3.0 mais peuvent être déployés dans un environement J2EE. L'empaquetage d'un WAR est aussi plus simple à comprendre. Si vous installez un serveur d'application prêt pour EJB3, choissisez <emphasis>EAR</emphasis>. Sinon choississez <emphasis>WAR</emphasis>. Nous allons supposez que vous avez choisi un déploiement WAR pour le reste du tutoriel, mais vous pouvez suivre exactement les mêmes étapes pour un déploiement de EAR.
ja_jp: 決める必要がある重要な選択は、プロジェクトとして EAR 形式デプロイと WAR 形式デプロイのどちらにするかです。 EAR プロジェクトは EJB 3.0 に対応し Java EE 5 が必要です。 WAR プロジェクトは EJB 3.0 には対応しませんが、く J2EE 環境にデプロイ可能です。 WAR は EAR に比べシンプルで理解しやすいパッケージです。 JBoss のような EJB3 が実行可能なアプリケーションサーバーにインストールする場合は <literal>EAR</literal> を選択してください。 これ以外は <literal>WAR</literal> を選択してください。 以降、 このチュートリアルでは WAR デプロイメントが選択されたと仮定しますが、 EAR デプロイメントの場合もまったく同じステップで進むことができます。

source: Next, select your database type. We'll assume you have MySQL installed, with an existing schema. You'll need to tell JBoss Tools about the database, select <emphasis>MySQL</emphasis> as the database, and create a new connection profile. Select <emphasis>Generic JDBC Connection</emphasis>:
fr_fr: Ensuite, sélectionnez votre type de base de données. Nous allons supposé que vous installé MySQL avec un schéma de base de données existant Vous allez devir indiquer à JBoss Tools où est la base de données, selectionnez <emphasis>MySQL</emphasis> comme base de données, et créez un nouveau profil de connection. Sélectionnez <emphasis>Generic JDBC Connection</emphasis>:
ja_jp: 次に、データベースのタイプを選択します。 ここでは既存のスキーマを持つ MySQL がインストールされていることを前提とします。 JBoss Tools にデータベースについて指定する必要があります、データベースとして <emphasis>MySQL</emphasis> を選択して、新たにコネクションプロファイルを作成してください。 <emphasis>Generic JDBC Connection</emphasis> を選択してください。

source: Give it a name:
fr_fr: Indiquez lui un nom:
ja_jp: 名前をつけてください。

source: JBoss Tools doesn't come with drivers for any databases, so you need to tell JBoss Tools where the MySQL JDBC driver is. Tell it about the driver by clicking <emphasis>...</emphasis>.
fr_fr: JBoss Tolls n'est pas fourni avec des pilotes pour les bases de données, vous devez dire à JBoss Tools où se trouve le pilote MySQL JDBC. Indiquez lui où se trouve le pilote en cliquant sur <emphasis>...</emphasis>.
ja_jp: JBoss Tools はデータベースドライバを持っていないので、JBoss Tools にどこに MySQL JDBC があるかを指定する必要があります。 クリックしてドライバに関して指定してください。

source: Locate MySQL 5, and hit <emphasis>Add...</emphasis>:
fr_fr: Localisez le MySQL 5, et appuyez sur<emphasis>Add...</emphasis>:
ja_jp: MySQL 5 の場所で、<emphasis>Add...</emphasis> を押してください。

source: Choose the <emphasis>MySQL JDBC Driver</emphasis> template:
fr_fr: Choississez le modèle de <emphasis>MySQL JDBC Driver</emphasis>:
ja_jp: <emphasis>MySQL JDBC Driver</emphasis> テンプレートを選択してください。

source: Locate the jar on your computer by choosing <emphasis>Edit Jar/Zip</emphasis>:
fr_fr: Localisez le jar sur votre ordinateur en choissisant <emphasis>Edit Jar/Zip</emphasis>:
ja_jp: <emphasis>Edit Jar/Zip</emphasis> を選択することでコンピュータ上の jar の位置を指定してください。

source: Review the username and password used to connect, and if correct, hit <emphasis>Ok</emphasis>.
fr_fr: Indiquez votre nom d'utilisateur et votre mode passe à utiliser pour se connecter, et si c'est correcte, appuyez sur <emphasis>Ok</emphasis>.
ja_jp: 接続のためのユーザー名とパスワードを確認して正しければ、<emphasis>Ok</emphasis> を押してください。

source: Finally, choose the newly created driver:
fr_fr: AU final, choississez le pilote nouvellement créer:
ja_jp: 最後に新規に作成されたドライバを選択してください。

source: If you are working with an existing data model, make sure you tell JBoss Tools that the tables already exist in the database.
fr_fr: Si vous travaillez avec un modèle de données existant, soyez sur de dire à JBoss Tools que des tables existent déjà dans la base de données.
ja_jp: 既存のデータモデルで作業をしている場合、 データベースに既にテーブルが存在していることを JBoss Tools に必ず知らせてください。

source: Review the username and password used to connect, test the connection using the <emphasis>Test Connection</emphasis> button, and if it works, hit <emphasis>Finish</emphasis>:
fr_fr: Indiquez le nom d'utilisateur et le mot de passe utilisé pour se connecter, testez la connection en utilisant le bouton <emphasis>Test Connection</emphasis> , et si cela fonctionne, appuyez sur <emphasis>Finish</emphasis>:
ja_jp: 接続のためのユーザー名とパスワードを確認して、<emphasis>Test Connection</emphasis> ボタンを使用して接続をテストします。 動作したならば、<emphasis>Finish</emphasis> を押します。

source: Finally, review the package names for your generated beans, and if you are happy, click <emphasis>Finish</emphasis>:
fr_fr: Au final, vérifiez les noms des paquet de vos beans générés et si vous en êtes content, cliquez sur <emphasis>Finish</emphasis>:
ja_jp: 最後に、生成された Bean のパッケージ名を確認して、問題なければ、<emphasis>Finish</emphasis> をクリックします。

source: JBoss has sophisticated support for hot re-deployment of WARs and EARs. Unfortunately, due to bugs in the JVM, repeated redeployment of an EAR—which is common during development—eventually causes the JVM to run out of perm gen space. For this reason, we recommend running JBoss in a JVM with a large perm gen space at development time. We suggest the following values:
fr_fr: JBoss dispose d'un support sophistiqué pour le re-déploiement à chaud des EARs et des WARs. Malheureusement, à cause de bugs dans la JVM, le redéploiement d'un EAR—ce qui est common pendant le développement—peut éventuellement déclencher un épuisement de l'espace perm gen. Pour cette raison, nous recommendons d'exécuter JBoss dans une JVM avec un espace perm gen important pendant la phase de développement. Nous sudgerons les valeurs suivantes:
ja_jp: JBoss は WAR や EAR の優れたホット再デプロイメントをサポートします。 残念ながら、 JVM にバグがあるため、 — 開発段階では一般的な — EAR の再デプロイメントを繰り返すと最終的には JVM が perm gen スペースを使い果たしてしまうことになります。 この理由により、デプロイメント時に perm gen space を大きく確保した JVM で JBoss を稼動させることを推奨します。 以下のような値を推奨します。

source: If you don't have so much memory available, the following is our minimum recommendation:
fr_fr: Si vous navez pas autant de mémoire disponible, les valeurs suivantes sont notre recommendation minimale:
ja_jp: 十分なメモリがない場合には、以下が最小の推奨値です。

source: Locate the server in the <emphasis>JBoss Server View</emphasis>, right click on the server and select <emphasis>Edit Launch Configuration</emphasis>:
fr_fr: Localisez le serveur dans le <emphasis>JBoss Server View</emphasis>, clic droit sur le server et selectionnez <emphasis>Edit Launch Configuration</emphasis>:
ja_jp: <emphasis>JBoss Server View</emphasis> にサーバを配置し、サーバの上で右クリックして <emphasis>Edit Launch Configuration</emphasis> を選択してください。

source: Then, alter the VM arguements:
fr_fr: Ensuite, modifier les arguments de la VM:
ja_jp: そして、VM 引数を変更してください。

source: If you don't want to bother with this stuff now, you don't have to—come back to it later, when you get your first <literal>OutOfMemoryException</literal>.
fr_fr: SI vous ne voulez pas vous inquietes avec tout ce bidule maintenant, vous n'avez pas à le faire—revennez plus tard, quand vous aurez votre premier <literal>OutOfMemoryException</literal>.
ja_jp: 今すぐに変更を行いたくない場合は特に行う必要はありません — <literal>OutOfMemoryException</literal> が発生した時点で対処してください。

source: To start JBoss, and deploy the project, just right click on the server you created, and click <emphasis>Start</emphasis>, (or <emphasis>Debug</emphasis> to start in debug mode):
fr_fr: Pour démarrer JBoss, et deployez votre projet, clic droit sipplement sur le server que vous avez créés et clic sur <emphasis>Start</emphasis>, (ou sur <emphasis>Debug</emphasis> pour démarrer en mode debogage):
ja_jp: JBoss の起動、プロジェクトのデプロイのためには、作成したサーバの上の右クリックして <emphasis>Start</emphasis> をクリックしてください。 また、デバッグモードで起動するには <emphasis>Debug</emphasis> をクリックしてください。

source: Don't get scared by the XML configuration documents that were generated into the project directory. They are mostly standard Java EE stuff, the stuff you need to create once and then never look at again, and they are 90% the same between all Seam projects.
fr_fr: Ne soyez pas appeuré par les documents de configuration en XML qui sont générés dans le dossier du projet. Ils sont pour la plus par des trucs de Java EE standards, le genre de truc que vous avez besoin de créer une fois et ensuite de ne jamais plus le regarder, et ils sont dans 90% des cas les même entre tous les projets Seam.
ja_jp: プロジェクトディレクトリに XML 設定ドキュメントが生成されますがびっくりしないでください。 これらのほとんどが標準 Java EE に関するもので、 一度生成したら 二度と見る必要のないものです。 すべての Seam プロジェクトで 90% は同じものです。

source: Creating a new action
fr_fr: Création d'une nouvelle action
ja_jp: 新規のアクションを生成する

source: If you're used to traditional action-style web frameworks, you're probably wondering how you can create a simple web page with a stateless action method in Java.
fr_fr: SI vous utilisez un serveur d'application web de style action traditionnel, vous vous inquiétez surement de comment créer une simple page web avec des méthode d'action sans état en Java.
ja_jp: 従来のアクションスタイルの Web フレームワークに慣れている場合、 おそらくどのように Java のステートレスアクションメソッドを持つ簡単な Web ページが生成されるのだろうかと思われるでしょう。

source: First, select <emphasis>New</emphasis> -> <emphasis>Seam Action</emphasis>:
fr_fr: En premier, sélectonnez <emphasis>New</emphasis> -> <emphasis>Seam Action</emphasis>:
ja_jp: 最初に、<emphasis>New</emphasis> -> <emphasis>Seam Action</emphasis> と選択してください。

source: Now, enter the name of the Seam component. JBoss Tools selects sensible defaults for other fields:
fr_fr: Maintenant, entrez le nom du composant de Seam. JBoss Tools sélectionne des valeurs par défauts judicieuses pour les autres champs:
ja_jp: ここでは、Seam コンポーネント名を登録してください。 JBoss Tools は他のフィールドのために気の利いたデフォルトを選択します。

source: Finally, hit <emphasis>Finish</emphasis>.
fr_fr: Au final, appuyez sur <emphasis>Finish</emphasis>.
ja_jp: 最後に <emphasis>Finish</emphasis> を押します。

source: Now go to <literal>http://localhost:8080/helloworld/ping.seam</literal> and click the button. You can see the code behind this action by looking in the project <literal>src</literal> directory. Put a breakpoint in the <literal>ping()</literal> method, and click the button again.
fr_fr: Maintenant allez sur <literal>http://localhost:8080/helloworld/ping.seam</literal> et cliquez sur le bouton. Vous pouvez voir le code derrière cette action en regardant dans le dossier <literal>src</literal> du projet. Metez un point d'arrêt dans la méthode <literal>ping()</literal> et cliquez de nouveau sur le bouton.
ja_jp: さあ、<literal>http://localhost:8080/helloworld/ping.seam</literal> に進んで、クリックボタンを押してください。 プロジェクトの <literal>src</literal> directory ディレクトリを見れば、このアクションに隠されたコードを見ることができます。 <literal>ping()</literal> メソッドにブレークポイントを置いて、 クリックボタンを押してください。

source: Finally, open the <literal>helloworld-test</literal> project, locate <literal>PingTest</literal> class, right click on it, and choose <emphasis>Run As</emphasis> -> <emphasis>TestNG Test</emphasis>:
fr_fr: Au final, ouvrez le projet <literal>helloworld-test</literal>, localisez la classe <literal>PingTest</literal>, clic droit sur elle et choisissez <emphasis>Run As</emphasis> -> <emphasis>TestNG Test</emphasis>:
ja_jp: 最後に、<literal>helloworld-test</literal> プロジェクトを開いて、<literal>PingTest</literal> クラスを指定して、それを右クリックして、<emphasis>Run As</emphasis> -> <emphasis>TestNG Test</emphasis> と選択してください。

source: Creating a form with an action
fr_fr: La création d'un formulaire avec une action
ja_jp: アクションのあるフォームを生成する

source: The first step is to create a form. Select <emphasis>New</emphasis> -> <emphasis>Seam Form</emphasis>:
fr_fr: La première étape pour créer un formulaire. Sélectionnez <emphasis>New</emphasis> -> <emphasis>Seam Form</emphasis>:
ja_jp: 最初のステップはフォームを生成することです。 <emphasis>New</emphasis> -> <emphasis>Seam Form</emphasis> と選択してください。

source: Go to <literal>http://localhost:8080/helloworld/hello.seam</literal>. Then take a look at the generated code. Run the test. Try adding some new fields to the form and Seam component (note, you don't need to restart the app server each time you change the code in <literal>src/action</literal> as Seam hot reloads the component for you <xref linkend="gettingstartedwithjbosstools.hotdeployment"/>).
fr_fr: Allez sur <literal>http://localhost:8080/helloworld/hello.seam</literal>. Ensuite, regardez comment est le code généré. Exécutez le test. Essayez d'ajouter de nouveaux champs au formulaire et au composant de Seam (notez, vous n'avez pas à redémarrer le serveur d'application à chaque fois que vous modifier le code dans <literal>src/action</literal> car Seam recharge à chaud le composant pour vous <xref linkend="gettingstartedwithjbosstools.hotdeployment"/>).
ja_jp: <literal>http://localhost:8080/helloworld/hello.seam</literal> と進んでください。 そして生成されたコードを見てください。 テストを起動してください。 フォームと Seam コンポーネントに新しいフィールドを追加してみてください。(Seam がコンポーネントをホットリロード <xref linkend="gettingstartedwithjbosstools.hotdeployment"/> するので、 <literal>src/hot</literal> のコードを変更するたびにアプリケーションサーバーをリスタートする必要がないことに留意してください。)

source: Generating an application from an existing database
fr_fr: La génération d'une application depuis une base de données existante
ja_jp: 既存のデータベースからアプリケーションを自動生成する

source: Manually create some tables in your database. (If you need to switch to a different database, create a new project, and select the correct database). Then, select <emphasis>New</emphasis> -> <emphasis>Seam Generate Entities</emphasis>:
fr_fr: Manuellement, créez quelques tables dans votre base de données. (Si vous avez besoin de basculer vers une base de données différente, créez une nouveau projet et sélectionnez la base de données correcte. Ensuite, sélectionnez <emphasis>New</emphasis> -> <emphasis>Seam Generate Entities</emphasis>:
ja_jp: 手動でデータベースの中にテーブルを生成します。 (別のデータベースに切り替える必要がある場合、新たなプロジェクトを作成して、正しいデータベースを選択してください。) そして、<emphasis>New</emphasis> -> <emphasis>Seam Generate Entities</emphasis> と選択します。

source: JBoss Tools gives you the option to either reverse engineer entities, components and views from a database schema or to reverse engineer components and views from existing JPA entities. We're going to do <emphasis>Reverse engieneer from database</emphasis>.
fr_fr: JBoss Tools vous offre aussi l'option de réaliser une ingénieurie inverse des entitées, composants et des vues depuis votre schéma de base de données ou depuis les composants et les vues des entitées JPA existantes. Nous allonrs réaliser <emphasis>une ingénieurie inverse depuis une abase de données</emphasis>.
ja_jp: JBoss Tools には、データベーススキーマからエンティティ、コンポーネント、ビューのリバースエンジニアリングをするか、あるいは既存 JPA エンティティからコンポーネントとビューのリバースエンジニアリングをするかのオプションがあります。 ここでは<emphasis>データベースからのリバースエンジニアリング</emphasis>を行います。

source: Restart the deployment:
fr_fr: Redémarrer le déploiement:
ja_jp: デプロイメントの再起動：
