Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Gettingstarted.po
Languages: fr_fr, it_it, ja_jp

source: The generated project includes three database and persistence configurations. The <literal>persistence-test.xml</literal> and <literal>import-test.sql</literal> files are used when running the TestNG unit tests against HSQLDB. The database schema and the test data in <literal>import-test.sql</literal> is always exported to the database before running tests. The <literal>myproject-dev-ds.xml</literal>, <literal>persistence-dev.xml</literal>and <literal>import-dev.sql</literal> files are for use when deploying the application to your development database. The schema might be exported automatically at deployment, depending upon whether you told seam-gen that you are working with an existing database. The <literal>myproject-prod-ds.xml</literal>, <literal>persistence-prod.xml</literal>and <literal>import-prod.sql</literal> files are for use when deploying the application to your production database. The schema is not exported automatically at deployment.
fr_fr: Le projet généré inclu trois bases de données et des configurations de persistance. Les fichiers <literal>persistence-test.xml</literal>, persistence-test.xml et <literal>import-test.sql</literal> sont utilisés quand vous exécutez les tests unitaires testNG avec HSQLDB. Le schéma de base de données et les données de test dans <literal>import-test.sql</literal> sont toujours exportés vers la base de données avant l’exécution des tests. Les fichiers <literal>myproject-dev-ds.xml</literal>, <literal>persistence-dev.xml</literal> et <literal>import-dev.sql</literal> ont utilisés pendant le déploiement de l’application vers la base de données de développement. Le schéma peut être exporté automatiquement pendant le déploiement, cela dépend si vous avez indiqué à seam-gen que vous travaillez avec une base de données déjà existante. Les fichiers <literal>myproject-prod-ds.xml</literal>, <literal>persistence-prod.xml</literal> et <literal>import-prod.sql</literal> sont utilisés pendant le déploiement de l’application vers la base de données de production. Le schema n’est pas exporté automatiquement pendant le déploiement.
it_it: Il progetto generato include tre database e le configurazioni per la persistenza. I file <literal>persistence-test.xml</literal> e <literal>import-test.sql</literal> vengono usati quando di eseguono i test di unità TestNG con HSQLDB. Lo schema del database ed i dati di test in <literal>import-test.sql</literal> vengono sempre esportati nel database prima dell'esecuzione dei test. I file <literal>myproject-dev-ds.xml</literal>, <literal>persistence-dev.xml</literal> e <literal>import-dev.sql</literal> sono usati per il deploy dell'applicazione nel database di sviluppo. Lo schema può essere esportato automaticamente durante il deploy, a seconda che si sia detto a seam-gen che si sta lavorando con un database esistente. I file <literal>myproject-prod-ds.xml</literal>, <literal>persistence-prod.xml</literal> e <literal>import-prod.sql</literal> sono usati per il deploy dell'applicazione nel database di produzione. Lo schema non viene esportato automaticamente durante il deploy.
ja_jp: 生成されたプロジェクトは三つのデータベースと永続性設定を含んでいます。 HSQLDB に対して TestNG ユニットテストを実行するときに <literal>persistence-test.xml</literal> と <literal>import-test.sql</literal> ファイルが使用されます。 <literal>import-test.sql</literal> 中のデータベーススキーマとテストデータは常にテストが実行される前にデータベースにエキスポートされます。 <literal>myproject-dev-ds.xml</literal>、<literal>persistence-dev.xml</literal> と <literal>import-dev.sql</literal> はアプリケーションを開発データベースにデプロイするときに使用します。 seam-gen に既存データベースで作業しているかを伝えるかどうかによってスキーマはデプロイ時に自動的にエキスポートされる場合があります。 <literal>myproject-prod-ds.xml</literal>、 <literal>persistence-prod.xml</literal> と <literal>import-prod.sql</literal> ファイルは、 本番環境データベースにアプリケーションをデプロイするときに使用します。 デプロイ時にスキーマは自動的にエキスポートされません。

source: Creating a new action
fr_fr: Création d'une nouvelle action
it_it: Creazione di una nuova azione
ja_jp: 新規のアクションを生成する

source: If you're used to traditional action-style web frameworks, you're probably wondering how you can create a simple web page with a stateless action method in Java. If you type:
fr_fr: Si vous avez l’habitude de serveur d’application web de style action traditionnel, vous vous demandez comment créer une simple page web avec un méthode d’action sans état en Java. Si vous entrez :
it_it: Se si è abituati ad usare un framework web action-style, ci si domanderà come in Java sia possibile creare una semplice pagina web con un metodo d'azione stateless. Se si digita:
ja_jp: 従来のアクションスタイルの Web フレームワークに慣れている場合、 おそらくどのように Java のステートレスアクションメソッドを持つ簡単な Web ページが生成されるのだろうかと思われるでしょう。 以下のようにタイプしてください。

source: Seam will prompt for some information, and generate a new facelets page and Seam component for your project.
fr_fr: Seam va vous demander des informations, et génèrer une nouvelle page facelets ainsi qu’un composant Seam pour votre projet.
it_it: Seam chiederà alcune informazioni, e genererà per il progetto una nuova pagina facelets ed i componenti Seam.
ja_jp: Seam は情報のために質問をしてきます。そして、プロジェクトのための新しい facelets page や Seam コンポーネントを生成します。

source: Because we've added a new Seam component, we need to restart the exploded directory deployment. You can do this by typing <literal>seam restart</literal>, or by running the <literal>restart</literal> target in the generated project <literal>build.xml</literal> file from inside Eclipse. Another way to force a restart is to edit the file <literal>resources/META-INF/application.xml</literal> in Eclipse. <emphasis>Note that you do not need to restart JBoss each time you change the application.</emphasis>
fr_fr: Vue que nous avons ajouté un nouveau composant Seam, nous devons redémarrer le déploiement de la structure du dossier. Vous pouvez faire cela en entrant <literal>seam restart</literal>, en en execution la cible <literal>restart</literal> qui se trouve dans le fichier <literal>build.xml</literal> avec Eclipse. Une autre façon de forcer un redémarrage est d’éditer le fichier <literal>resources/META-INF/application.xml</literal> dans Eclipse. <emphasis>Notez que vous navez pas à redémarrer JBoss à chaque vois que vous modifier votre application</emphasis>.
it_it: Poiché è stato aggiunto un nuovo componente Seam, occorre riavviare il deploy della directory esplosa. E' possibile farlo digitando <literal>seam restart</literal>, od eseguendo il target <literal>restart</literal> nel file <literal>build.xml</literal> del progetto generato all'interno di Eclipse. Un altro modo per forzare il riavvio è editare in Eclipse il file <literal>resources/META-INF/application.xml</literal>. <emphasis>Si noti che non occorre riavviare JBoss ogni volta che cambia l'applicazione.</emphasis>
ja_jp: 新しい Seam コンポーネントを追加したので、 展開したディレクトリのデプロイを再起動する必要があります。 <literal>seam restart</literal> と入力するか、 Eclipse 内から生成されたプロジェクト build.xml ファイル の <literal>restart</literal> ターゲットを実行することで行うことができます。 再起動を強制する別の方法は Eclipse の <literal>resources/META-INF/application.xml</literal> ファイルを編集することです。 <emphasis>アプリケーションを変更するたびに JBoss を再起動する必要はないことに留意してください。 </emphasis>

source: Now go to <literal>http://localhost:8080/helloworld/ping.seam</literal> and click the button. You can see the code behind this action by looking in the project <literal>src</literal> directory. Put a breakpoint in the <literal>ping()</literal> method, and click the button again.
fr_fr: Maintenant allez à <literal>http://localhost:8080/helloworld/ping.seam</literal> et cliquez sur le bouton. Vous pouvez voir le code ci-dessous en action en regardant dans le dossier <literal>src</literal>. Placez un point d’arrêt dans la méthode <literal>ping()</literal> et cliquez sur le bouton de nouveau.
it_it: Adesso si vada in <literal>http://localhost:8080/helloworld/ping.seam</literal> e si clicchi il pulsante. Si può vedere il codice sottostante l'azione guardando il progetto nella directory <literal>src</literal>. Si metta un breakpoint nel metodo <literal>ping()</literal>, e si clicchi nuovamente il pulsante.
ja_jp: さあ、<literal>http://localhost:8080/helloworld/ping.seam</literal> に進んで、クリックボタンを押してください。 プロジェクトの <literal>src</literal> directory ディレクトリを見れば、このアクションに隠されたコードを見ることができます。 <literal>ping()</literal> メソッドにブレークポイントを置いて、 クリックボタンを押してください。

source: Finally, locate the <literal>PingTest.xml</literal> file in the test package and run the integration tests using the TestNG plugin for Eclipse. Alternatively, run the tests using <literal>seam test</literal> or the <literal>test</literal> target of the generated build.
fr_fr: Finalement, localisez le fichier <literal>PingTest.xml</literal> dans le package de test et lancez les tests d’intégration en utilisant le plugin testNG pour Eclipse. Autre alternative, lancez les tests en utilisant <literal>seam test</literal> ou via la cible du fichier généré <literal>test</literal>.
it_it: Infine si cerchi il file <literal>PingTest.xml</literal> nel pacchetto dei test e si eseguano i test d'integrazione usando il plugin TestNG di Eclipse. In alternativa, si eseguano i test usando <literal>seam test</literal> od il target <literal>test</literal> del build generato.
ja_jp: 最後に、<literal>PingTest.xml</literal> ファイルを test パッケージに配置し、 Eclipse の TestNG プラグインを使用して統合テストを実行します。 別な方法として、 <literal>seam test</literal> を使用してテストを起動するか、 生成されたビルドから <literal>test</literal> ターゲットを起動します。

source: Creating a form with an action
fr_fr: Création d'un formulaire avec une action
it_it: Creazione di una form con un'azione
ja_jp: アクションのあるフォームを生成する

source: The next step is to create a form. Type:
fr_fr: L’étape suivante est de créer un formulaire Entrez :
it_it: Il prossimo passo è creare una form. Si digiti:
ja_jp: 次のステップは、以下のようにフォームを生成することです。

source: Restart the application again, and go to <literal>http://localhost:8080/helloworld/hello.seam</literal>. Then take a look at the generated code. Run the test. Try adding some new fields to the form and Seam component (remember to restart the deployment each time you change the Java code).
fr_fr: Relancer l’application encore et allez sur <literal>http://localhost:8080/helloworld/hello.seam</literal>. Ensuite, jetez un coup d’œil sur le code généré. Lancez le test. Essayez d’ajouter de nouveau champs dans le formulaire et dans le composant Seam (rappelez vous de redémarrer le deploiement chaque fois que vous modifiez le code Java).
it_it: Si riavvii di nuovo l'applicazione e si vada in <literal>http://localhost:8080/helloworld/hello.seam</literal>. Quindi si guardi il codice generato. Avviare i test. Si aggiungano nuovi campi alla form e al componente Seam (ricordarsi di riavviare il deploy ad ogni cambiamento del codice Java).
ja_jp: 再びアプリケーションを再起動させ、 <literal>http://localhost:8080/helloworld/hello.seam</literal> に進みます。 生成されたコードを見てみましょう。 テストを実行します。 何か新しいフィールドをフォームと Seam コンポーネントに追加してみましょう。 (Java コードを変更したら常にデプロイを再起動することを忘れないようにしてください。)

source: Generating an application from an existing database
fr_fr: Generation d'une application depuis une base de données existante
it_it: Generazione di un'applicazione da database esistente
ja_jp: 既存のデータベースからアプリケーションを自動生成する

source: Manually create some tables in your database. (If you need to switch to a different database, just run <literal>seam setup</literal> again.) Now type:
fr_fr: Manuellement créez plusieurs tables dans votre base de données. (Si vous devez basculer vers une autre base de données, relancez juste encore une fois <literal>seam setup</literal>.) Maintenant entrez :
it_it: Si creino manualmente le tabelle nel database. (Se occorre passare ad un database diverso, si esegua di nuovo <literal>seam setup</literal>.) Adesso si digiti:
ja_jp: 手動でデータベースの中にテーブルを生成します。 (別のデータベースに切り替える必要がある場合はもう一度 <literal>seam setup</literal> を実行します。) ここで次のように入力します。

source: Restart the deployment, and go to <literal>http://localhost:8080/helloworld</literal>. You can browse the database, edit existing objects, and create new objects. If you look at the generated code, you'll probably be amazed how simple it is! Seam was designed so that data access code is easy to write by hand, even for people who don't want to cheat by using seam-gen.
fr_fr: Relancez le déploiement et allez sur <literal>http://localhost:8080/helloworld</literal>. Vous pouvez naviguer dans la base de données, éditer les objets existants et créez de nouveaux objets. Si vous allez jeter un coup d’œil au code généré, vous être probablement émerveillé par sa simplicité ! Seam a été prévu pour que le code d’accès aux données soit simple à écrire à la main, même pour les gens qui ne veulent pas tricher en utilisant seam-gen.
it_it: Riavviare il deploy ed andare in <literal>http://localhost:8080/helloworld</literal>. Si può sfogliare il database, modificare gli oggetti esistenti e creare nuovi oggetti. Se si guarda al codice generato, probabilmente ci si meraviglierà di quanto è semplice! Seam è stato progettato affiché sia semplice scrivere a mano il codice d'accesso ai dati, anche per persone che non vogliono barare usando seam-gen.
ja_jp: デプロイを再起動して、 <literal>http://localhost:8080/helloworld</literal> に進んでください。 データベースの参照、 既存オブジェクトの編集、 新しいオブジェクトの生成が可能です。 生成されたコードを見ると、おそらくあまりに簡単なのに驚かれたと思います。 Seam はデータアクセスコードが手作業で簡単に記述できるように設計されているからです。 また seam-gen を使用したずるをしたくない人でも大丈夫です。

source: Generating an application from existing JPA/EJB3 entities
fr_fr: Génération d'une application depuis des entitées JPA/EJB3 existantes
it_it: Generazione di un'applicazione da entity JPA/EJB3 già esistenti
ja_jp: 既存の JPA/EJB3 エンティティからアプリケーションを自動生成する

source: Place your existing, valid entity classes inside the <literal>src/main</literal>. Now type
fr_fr: Placez votre existant, les classes entitées valides dans <literal>src/main</literal>. Ensuite entrez
it_it: Si mettano le classi entity esistenti dentro <literal>src/main</literal>. Ora si digiti:
ja_jp: 既存の有効なエンティティクラスを <literal>src/main</literal> に置いて、以下をタイプしてください。

source: Restart the deployment, and go to <literal>http://localhost:8080/helloworld</literal>.
fr_fr: Redémarrez le déploiement, et allez sur <literal>http://localhost:8080/helloworld</literal>.
it_it: Si avvi il deploy, e si vada alla pagina <literal>http://localhost:8080/helloworld</literal>.
ja_jp: デプロイメントをリスタートして、<literal>http://localhost:8080/helloworld</literal> に進んでください。

source: Deploying the application as an EAR
fr_fr: Déploiement d'une application avec un EAR
it_it: Eseguire il deploy dell'applicazione come EAR
ja_jp: EAR 形式でアプリケーションをデプロイする

source: Finally, we want to be able to deploy the application using standard Java EE 5 packaging. First, we need to remove the exploded directory by running <literal>seam unexplode</literal>. To deploy the EAR, we can type <literal>seam deploy</literal> at the command prompt, or run the <literal>deploy</literal> target of the generated project build script. You can undeploy using <literal>seam undeploy</literal> or the <literal>undeploy</literal> target.
fr_fr: Au final, nous voulons être capable de déployer l'application en utilisant l'empaquetage standard de Java EE. En premier, vous avons besoin de retirer le dossier fabriqué en exécutant <literal>seam unexplode</literal>. Pour déployer le EAR, nous pouvons entrer <literal>seam deploy</literal> à l'invite de commande, ou exécuter la cible <literal>deploy</literal> du script généré de construction du projet. Vous pouvez le désinstaller en utilisant <literal>seam undeploy</literal> ou la cible <literal>undeploy</literal>.
it_it: Infine si vuole essere in grado di eseguire il deploy dell'applicazione usando l'impacchettamento standard di Java EE 5. In primo luogo occorre rimuovere la directory esplosa eseguendo <literal>seam unexplode</literal>. Per fare il deploy dell'EAR, si può digitare da linea di comando <literal>seam deploy</literal>, od eseguire il target <literal>deploy</literal> dello script di build del progetto generato. L'undeploy può essere eseguito usando <literal>seam undeploy</literal> od il target <literal>undeploy</literal>.
ja_jp: 最後に、 標準の Java EE 5 パッケージングを使用してアプリケーションをデプロイできるようにしたいと思います。 まず、 <literal>seam unexplode</literal> を実行して展開したディレクトリを削除する必要があります。 EAR をデプロイするには、 コマンドプロンプトで <literal>seam deploy</literal> を入力するか、 あるいは生成されたプロジェクトの build スクリプトの <literal>deploy</literal> ターゲットを実行します。 <literal>seam undeploy</literal> または <literal>undeploy</literal> ターゲットを使うとアンデプロイができます。

source: By default, the application will be deployed with the <emphasis>dev profile</emphasis>. The EAR will include the <literal>persistence-dev.xml</literal> and <literal>import-dev.sql</literal> files, and the <literal>myproject-dev-ds.xml</literal> file will be deployed. You can change the profile, and use the <emphasis>prod profile</emphasis>, by typing
fr_fr: Par défaut, l'application sera déployée avec le <emphasis>dev profile</emphasis>. Le EAR inclura les fichiers <literal>persistence-dev.xml</literal> et <literal>import-dev.sql</literal>, et le fichier <literal>myproject-dev-ds.xml</literal> sera déployé. Vous pouvez modifier le profil et utilisez le <emphasis>prod profile</emphasis>, en entrant
it_it: Di default l'applicazione verrà deployata con il <emphasis>profile dev</emphasis>. L'EAR includerà i file <literal>persistence-dev.xml</literal> e <literal>import-dev.sql</literal>, e verrà deployato il file <literal>myproject-dev-ds.xml</literal>. Si può cambiare il profilo ed usare il <emphasis>profile prod</emphasis>, digitando:
ja_jp: デフォルトでは、アプリケーションは <emphasis>dev profile</emphasis> でデプロイされます。 EAR は <literal>persistence-dev.xml</literal> ファイルと <literal>import-dev.sql</literal> ファイルを含み、 <literal>myproject-dev-ds.xml</literal> ファイルがデプロイされます。 プロファイルは変更可能で、 以下のように入力して <emphasis>prod profile</emphasis> を使用します。

source: You can even define new deployment profiles for your application. Just add appropriately named files to your project—for example, <literal>persistence-staging.xml</literal>, <literal>import-staging.sql</literal> and <literal>myproject-staging-ds.xml</literal>—and select the name of the profile using <literal>-Dprofile=staging</literal>.
fr_fr: Vous pouvez même définir de nouveaux profils de déploiement pour votre application. Ajoutez juste les fichier dénommés de manière appropriés à votre projet —par exemple, <literal>persistence-staging.xml</literal>, <literal>import-staging.sql</literal> et <literal>myproject-staging-ds.xml</literal>—et sélectionnez le nom du profil en utilisant <literal>-Dprofile=staging</literal>.
it_it: Si possono anche definire nuovi profili di deploy per l'applicazione. Basta aggiungere file al progetto—per esempio, <literal>persistence-staging.xml</literal>, <literal>import-staging.sql</literal> e <literal>myproject-staging-ds.xml</literal>—e selezionare il nome del profile usando <literal>-Dprofile=staging</literal>.
ja_jp: アプリケーション用に新しいデプロイメントプロファイルを定義することもできます。 プロジェクトに適切な名前が付いたファイルを追加します — 例えば、<literal>persistence-staging.xml</literal>、<literal>import-staging.sql</literal> と <literal>myproject-staging-ds.xml</literal> などです。 <literal>-Dprofile=staging</literal> を使ってプロファイルの名前を選択します。

source: Seam and incremental hot deployment
fr_fr: Seam et le déploiement incrémental à chaud
it_it: Seam e hot deploy incrementale
ja_jp: Seam と増分ホットデプロイメント

source: When you deploy your Seam application as an exploded directory, you'll get some support for incremental hot deployment at development time. You need to enable debug mode in both Seam and Facelets, by adding this line to <literal>components.xml</literal>:
fr_fr: Quand vous déployez votre application Seam dans un dossier complet, vous allez avoir un peu d'indications pour le déploiement incrémental à chaud au moment du développement. Vous avez besoin d'activer le mode debug à la fois dans Seam et Facelets, en ajoutant cette ligne à <literal>components.xml</literal>:
it_it: Quando si fa il deploy di un'applicazione Seam come directory esplosa, si ottiene il supporto al deploy a caldo (hot deploy) durante il deploy. Occorre abilitare la modalità debug sia in Seam sia in Facelets, aggiungendo questa linea a <literal>components.xml</literal>:
ja_jp: 展開形式のディレクトリで Seam アプリケーションをデプロイする場合、 開発時に増分ホットデプロイのサポートを受けるでしょう。 <literal>components.xml</literal> に以下の行を追加することで、 Seam と Facelets の両方でデバッグモードを有効にする必要があります。

source: Now, the following files may be redeployed without requiring a full restart of the web application:
fr_fr: Maintenant, les fichiers suivants devraient être redéployés sans nécéssiter un rédémarrage complet de l'application web:
it_it: Ora i seguenti file potranno essere rideployati senza riavviare l'applicazione:
ja_jp: 以下のファイルは、 Webアプリケーションを完全に再起動することなく置き換えがされるかもしれません。

source: any facelets page
fr_fr: toutes les pages facelets
it_it: qualsiasi pagina facelets
ja_jp: facelets ページ

source: any <literal>pages.xml</literal> file
fr_fr: et tout fichier <literal>pages.xml</literal>
it_it: qualsiasi file <literal>pages.xml</literal>
ja_jp: <literal>pages.xml</literal> ファイル

source: But if we want to change any Java code, we still need to do a full restart of the application. (In JBoss this may be accomplished by touching the top level deployment descriptor: <literal>application.xml</literal> for an EAR deployment, or <literal>web.xml</literal> for a WAR deployment.)
fr_fr: Mais si nous voulons changer le code Java, nous continuons à avoir besoin de réaliser un redémarrage complet de l’application.( Dans JBoss, cela peut être accompli en changeant le descripteur de déploiement de plus haut niveau <literal>application.xml</literal> pour un déploiement d'un EAR ou <literal>web.xml</literal> pour un déploiement d'un WAR.)
it_it: Ma se si vuole cambiare il codice Java, occorre comunque riavviare nuovamente l'applicazione. (In JBoss questo può essere ottenuto toccando il descrittore di deploy: <literal>application.xml</literal> per un deploy con EAR, oppure <literal>web.xml</literal> per un deploy WAR.)
ja_jp: ただし、 いずれかの Java コードを変更する必要がある場合は、 アプリケーションを完全に再起動する必要があります。 (JBoss ではトップレベルのデプロイメント記述子を更新することでこれを行えます。 EAR デプロイメントなら <literal>application.xml</literal>、 WAR デプロイメントなら <literal>web.xml</literal> です。)

source: But if you really want a fast edit/compile/test cycle, Seam supports incremental redeployment of JavaBean components. To make use of this functionality, you must deploy the JavaBean components into the <literal>WEB-INF/dev</literal> directory, so that they will be loaded by a special Seam classloader, instead of by the WAR or EAR classloader.
fr_fr: Mais si vous voulez réellement un cycle rapide d'édition/compilation/test, Seam supporte un redéploiement incrémental des composants JavaBeans. Pour utiliser cette fonctionnalité, vous devez déployer les composants JavaBeans dans le dossier <literal>WEB-INF/dev</literal>, donc il vont être rechargé par un chargeur de classes spécialisé de Seam au lieu du chargeur de classes WAR ou EAR.
it_it: Ma se si vuole velocizzare il ciclo modifica/compila/testa, Seam supporta il redeploy incrementale dei compoenti JavaBean. Per usarlo occorre fare il deploy dei componenti JavaBean nella directory <literal>WEB-INF/dev</literal>, cosicché vengano caricati da uno speciale classloader di Seam, invece del classloader WAR o EAR.
ja_jp: しかし、 早いペースの編集/コンパイル/テストのサイクルを望むならば、 Seam は JavaBean コンポーネントの増分再デプロイメントをサポートしています。 この機能を有効にするためには、 JavaBean コンポーネントを <literal>WEB-INF/dev</literal> ディレクトリにデプロイする必要があります。 その結果、コンポーネントは WAR あるいは EAR クラスローダではなく、 特殊な Seam クラスローダによってロードされるようになります。

source: You need to be aware of the following limitations:
fr_fr: Vous devez être au courrant sur les limitations suivantes:
it_it: Occorre essere consapevoli delle seguenti limitazioni:
ja_jp: 以下の制約を知っている必要があります。
