Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Getting_Started_With_JBoss_Tools.po
Languages: fr_fr, ja_jp

source: Then go to <literal>http://localhost:8080/helloworld</literal>. You can browse the database, edit existing objects, and create new objects. If you look at the generated code, you'll probably be amazed how simple it is! Seam was designed so that data access code is easy to write by hand, even for people who don't want to cheat by using reverse engineering.
fr_fr: Ensuite, allez vers <literal>http://localhost:8080/helloworld</literal>. Vous pouvez naviguer dans la base de données, editer des objets existants, et créez de nouveaux objets. Si vous regardez dans le code généré, vous allez probablement être impréssionné par sa simplicité! Seam a été conçu pour que le code d'accès aux données soit simple à écrire à la main, même par des gens qui ne veulent pas tricher en utilisant l'ingénieurie inverse.
ja_jp: <literal>http://localhost:8080/helloworld</literal> にすすんでください。 データベースをブラウズ、既存オブジェクトの編集、そして新規オブジェクトの作成が可能です。 生成されたコードを見ると、何てシンプルなんだと驚かれるはずです！ Seam はマニュアルで簡単にデータアクセスコードが書けるよう設計されています。 リバースエンジニアリングを使用したカンニングをしたくない人にも簡単です。

source: Seam and incremental hot deployment with JBoss Tools
fr_fr: Seam et le déploiement incrémental à chaud avec JBoss Tools
ja_jp: Seam と JBoss Tools を使用した増分ホットデプロイメント

source: JBoss Tools supports incremental hot deployment of:
fr_fr: JBoss Tools permet le déploiement incrémental à chaud de :
ja_jp: JBoss Tools は以下について増分ホットデプロイメントをサポートします。

source: any facelets page
fr_fr: toute page facelets
ja_jp: facelets ページ

source: any <literal>pages.xml</literal> file
fr_fr: tout fichier <literal>pages.xml</literal>
ja_jp: <literal>pages.xml</literal> ファイル

source: out of the box.
fr_fr: au déballage de la boite.

source: But if we want to change any Java code, we still need to do a full restart of the application by doing a <emphasis>Full Publish</emphasis>.
fr_fr: Mais si nous voulons modifier n'importe quel code Java, nous avons toujours besoin de faire un redémarrage complet de l'application en faisant un <emphasis>Full Publish</emphasis>.
ja_jp: ただし Java コードを変更したいのならば、<emphasis>Full Publish</emphasis> することでアプリケーションを再起動する必要があります。

source: But if you really want a fast edit/compile/test cycle, Seam supports incremental redeployment of JavaBean components. To make use of this functionality, you must deploy the JavaBean components into the <literal>WEB-INF/dev</literal> directory, so that they will be loaded by a special Seam classloader, instead of by the WAR or EAR classloader.
fr_fr: Mais si vous voulez un cycle rapide d'édition/compilation/test, Seam permet de redéploiement incrémental des composants JavaBean. Pour vous permetre d'utilisez cette fonctionnalité, vous devez déploiyer les composants JavaBean dans le dossier<literal>WEB-INF/dev</literal> , ainsi ils sont recharger par le classloader spécial de Seam, au lieu du classloader WAR ou EAR.
ja_jp: しかし、 早いペースの編集/コンパイル/テストのサイクルを望むならば、 Seam は JavaBean コンポーネントの増分再デプロイメントをサポートしています。 この機能を有効にするためには、 JavaBean コンポーネントを <literal>WEB-INF/dev</literal> ディレクトリにデプロイする必要があります。 その結果、コンポーネントは WAR あるいは EAR クラスローダではなく、 特殊な Seam クラスローダによってロードされるようになります。

source: You need to be aware of the following limitations:
fr_fr: Vous devez être au courrant des limitations suivantes:
ja_jp: 以下の制約を知っている必要があります。

source: the components must be JavaBean components, they cannot be EJB3 beans (we are working on fixing this limitation)
fr_fr: les composants doivent être des composants JavaBean, il ne peuvent pas être des beans EJB3 (nous travaillons pour corriger cette limitation)
ja_jp: コンポーネントは JavaBean コンポーネントでなければならず、 EJB3 Bean は不可です。 (この制約は修正中です。)

source: entities can never be hot-deloyed
fr_fr: les entités ne peuvent jamais être déploiyées à chaud.
ja_jp: エンティティはホットデプロイできません。

source: components deployed via <literal>components.xml</literal> may not be hot-deployed
fr_fr: les composants déployés via <literal>components.xml</literal> ne peuvent pas être rechargés à chaud.
ja_jp: <literal>components.xml</literal> でデプロイされたコンポーネントはホットデプロイできない場合があります。

source: the hot-deployable components will not be visible to any classes deployed outside of <literal>WEB-INF/dev</literal>
fr_fr: les composants rechargés à chaud ne seront pas visible pour toute les classes déployés à l'extérieur de <literal>WEB-INF/dev</literal>
ja_jp: ホットデプロイ可能なコンポーネントは、 <literal>WEB-INF/dev</literal> の外部にデプロイされたクラスからは見えません。

source: Seam debug mode must be enabled and <literal>jboss-seam-debug.jar</literal> must be in <literal>WEB-INF/lib</literal>
fr_fr: Le mode de débogage de Seam doit être actif et <literal>jboss-seam-debug.jar</literal> doit être dans <literal>WEB-INF/lib</literal>
ja_jp: Seam デバッグモードは有効で <literal>jboss-seam-debug.jar</literal> は <literal>WEB-INF/lib</literal> になければなりません。

source: You must have the Seam filter installed in web.xml
fr_fr: Vous devez avoir le filtre Seam installé dans web.xml
ja_jp: web.xml に Seam フィルタをインストールしなければなりません。

source: You may see errors if the system is placed under any load and debug is enabled.
fr_fr: Vous pouvez voir des erreurs si le système est situé pendant le chargement ou le débogage est activé.
ja_jp: ロードとデバッグが有効な環境のシステムであればエラーが発生するかもしれません。

source: If you create a WAR project using JBoss Tools, incremental hot deployment is available out of the box for classes in the <literal>src/action</literal> source directory. However, JBoss Tools does not support incremental hot deployment for EAR projects.
fr_fr: Si vous créez un projet WAR en utilisant JBoss Tools, le déploiement incrémental à chaud est disponible immédiatement pour les classes se trouvant dans le dossier des sources <literal>src/action</literal>. Cependant, JBoss Tools ne fourni pas de déploiement incrémental à chaud pour les projets EAR.
ja_jp: JBoss Tools を使用して WAR プロジェクトを生成する場合、 増分ホットデプロイメントは、<literal>src/hot</literal> ソースディレクトリにあるクラスはそのまま使用可能です。 しかし、 JBoss Tools は EAR プロジェクトに対する増分ホットデプロイに対応していません。
