Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Gettingstarted.po
Languages: fr_fr, it_it, ja_jp

source: the components must be JavaBean components, they cannot be EJB3 beans (we are working on fixing this limitation)
fr_fr: les composants doivent être des composants JavaBeans, ils ne peuvent pas être des beans EJB3 (nous travaillons pour régler cette limitation)
it_it: i componenti devono essere componenti JavaBean, non possono essere bean EJB3 (stiamo lavorando per sistemare questa limitazione)
ja_jp: コンポーネントは JavaBean コンポーネントでなければならず、 EJB3 Bean は不可です。 (この制約は修正中です。)

source: entities can never be hot-deployed
fr_fr: les entités ne peuvent pas être déployées à chaud
it_it: gli entity non possono mai essere deployati a caldo (hot deployment)
ja_jp: エンティティはホットデプロイされることはありません。

source: components deployed via <literal>components.xml</literal> may not be hot-deployed
fr_fr: les composants déployés via <literal>components.xml</literal> ne devraient pas être déployées à chaud
it_it: i componenti deployati via <literal>components.xml</literal> non possono essere deployati a caldo
ja_jp: <literal>components.xml</literal> でデプロイされたコンポーネントはホットデプロイできない場合があります。

source: the hot-deployable components will not be visible to any classes deployed outside of <literal>WEB-INF/dev</literal>
fr_fr: les composants déployables à chaud ne seront pas visibles dans les classes déployées hors de <literal>WEB-INF/dev</literal>
it_it: i componenti deployabili a caldo non saranno visibili alle classi deployate fuori da <literal>WEB-INF/dev</literal>
ja_jp: ホットデプロイ可能なコンポーネントは、 <literal>WEB-INF/dev</literal> の外部にデプロイされたクラスからは見えません。

source: Seam debug mode must be enabled and <literal>jboss-seam-debug.jar</literal> must be in <literal>WEB-INF/lib</literal>
fr_fr: e mode de debug de Seam doit être activé et <literal>jboss-seam-debug.jar</literal> doit être dans <literal>WEB-INF/lib</literal>
it_it: La modalità di debug di Seam deve essere abilitata e <literal>jboss-seam-debug.jar</literal> deve trovarsi in <literal>WEB-INF/lib</literal>
ja_jp: Seam デバッグモードは有効で <literal>jboss-seam-debug.jar</literal> は <literal>WEB-INF/lib</literal> になければなりません。

source: You must have the Seam filter installed in web.xml
fr_fr: Vous devez avoir le filtre de Seam installé dans web.xml
it_it: Occorre avere installato in web.xml il filtro Seam.
ja_jp: web.xml に Seam フィルタをインストールしなければなりません。

source: You may see errors if the system is placed under any load and debug is enabled.
fr_fr: Vous pouvez avoir des erreurs si le systèm est placé en chargement et débogage est actif.
it_it: Si possono vedere errori se il sistema è messo sotto carico ed è abilitato il debug.
ja_jp: ロードとデバッグが有効な環境のシステムであればエラーが発生するかもしれません。

source: If you create a WAR project using seam-gen, incremental hot deployment is available out of the box for classes in the <literal>src/hot</literal> source directory. However, seam-gen does not support incremental hot deployment for EAR projects.
fr_fr: Si vous créé un projet WAR en utilisant seam-gen, le déploiement incrémental à chaud est disponible automatiquement pour les classes placées dans le dossier source <literal>src/hot</literal>. Mais, sean-gen ne permet le support du déploiement incrémental à chaud pour les projets EAR.
it_it: Se si crea un progetto WAR usando seam-gen, il deploy incrementale a caldo è già abilitato per le classi collocate nella directory dei sorgenti <literal>src/hot</literal>. Comunque seam-gen non supporta il deploy incrementale a caldo per i progetti EAR.
ja_jp: seam-gen を使用して WAR プロジェクトを生成する場合、 増分ホットデプロイメントは、<literal>src/hot</literal> ソースディレクトリにあるクラスにそのまま使用可能です。 しかしながら、 seam-gen は EAR プロジェクトに対する増分ホットデプロイに対応していません。

source: Using Seam with JBoss 4.0
fr_fr: Utilisation de Seam avec JBoss 4.0
it_it: Uso di Seam con JBoss 4.0
ja_jp: JBoss 4.0 で Seam を使用する

source: Seam 2 was developed for JavaServer Faces 1.2. When using JBoss AS, we recommend using JBoss 4.2 or JBoss 5.0, both of which bundle the JSF 1.2 reference implementation. However, it is still possible to use Seam 2 on the JBoss 4.0 platform. There are two basic steps required to do this: install an EJB3-enabled version of JBoss 4.0 and replace MyFaces with the JSF 1.2 reference implementation. Once you complete these steps, Seam 2 applications can be deployed to JBoss 4.0.
fr_fr: Seam 2 a été développé pour JavaServer Faces 1.2. Avec l’utilisation de JBoss AS, nous vous recommandons d’utiliser JBoss 4.2 ou JBoss 5.0 les deux sont liés avec l'implémentation de référence JSF 1.2. Malgré tout, il est toujours possible d’utiliser Seam 2 sur une plateforme JBoss 4.0. il y a deux étapes de bases pour faire cela : installer une version de JBoss 4.0 avec EJB3 activé et remplacer MyFaces par l’implémentation de référence JSF 1.2. Une fois que ces étapes sont faites, l’application Seam 2 peut être déployé sur JBoss 4.0.
it_it: Seam 2 è stato sviluppato per JavaServer Faces 1.2. Usando JBoss AS, si raccomanda di usare JBoss 4.2 o JBoss 5.0, che incorpora l'implementazione di riferimento JSF 1.2. Comunque è possibile usare Seam 2 su piattaforma JBoss 4.0. Ci sono due passi base richiesti per farlo: installare la versione JBoss 4.0 con EJB3 abilitato e sostituire MyFaces con l'implementazione di riferimento JSF 1.2. Una volta completati questi passi, le applicazioni Seam 2.0 possono essere deployate in JBoss 4.0.

source: Install JBoss 4.0
fr_fr: Installation de JBoss 4.0
ja_jp: JBoss 4.0 のインストール

source: JBoss 4.0 does not ship a default configuration compatible with Seam. To run Seam, you must install JBoss 4.0.5 using the JEMS 1.2 installer with the ejb3 profile selected. Seam will not run with an installation that doesn't include EJB3 support. The JEMS installer can be downloaded from <ulink url="http://www.jboss.org/jbossas/downloads">http://www.jboss.org/jbossas/downloads</ulink>.
fr_fr: JBoss 4.0 ne propose pas une configuration par défaut compatible avec Seam. Pour exécuter Seam, vous devez installer JBoss 4.0.5 en utilisant l’installateur JEMS 1.2 avec le profil ejv3 sélectionné. Seam ne va pas s’exécuter avec une installation qui n’inclu pas le support EJB3. L’installateur JEMS peut être téléchargé depuis <ulink url="http://www.jboss.org/jbossas/downloads">http://www.jboss.org/jbossas/downloads</ulink>.
it_it: JBoss 4.0 non porta con sé una configurazione di default compatibile con Seam. Per eseguire Seam, occorre installare JBoss 4.0.5 usando l'installer JEMS 1.2 con il profile ejb3 selezionato. Seam non funzionerà con un'installazione che non include il supporto EJB3. L'installer JEMS può essere scaricato da <ulink url="http://www.jboss.org/jbossas/downloads">http://www.jboss.org/jbossas/downloads</ulink>.

source: Install the JSF 1.2 RI
fr_fr: Installation de JSF 1.2 RI
it_it: Installare JSF 1.2 RI
ja_jp: JSF 1.2 RI のインストール

source: The web configuration for JBoss 4.0 can be found in the <literal>server/default/deploy/jbossweb-tomcat55.sar</literal>. You'll need to delete <literal>myfaces-api.jar</literal> any <literal>myfaces-impl.jar</literal> from the <literal>jsf-libs </literal>directory. Then, you'll need to copy <literal>jsf-api.jar</literal>, <literal>jsf-impl.jar</literal>, <literal>el-api.jar</literal>, and <literal>el-ri.jar</literal> to that directory. The JSF JARs can be found in the Seam <literal>lib</literal> directory. The el JARs can be obtained from the Seam 1.2 release.
fr_fr: La configuration de JBoss 4.0 peut être trouvée dans <literal>server/default/deploy/jbossweb-tomcat55.sar</literal>. Vous allez avoir besoin d'effacer <literal>myfaces-api.jar</literal> et <literal>myfaces-impl.jar</literal> du dossier <literal>jsf-libs</literal>. Ensuite, vous allez devoir copier <literal>jsf-api.jar</literal>, <literal>jsf-impl.jar</literal>, <literal>el-api.jar</literal>, et <literal>el-ri.jar</literal> dans ce même dossier. Les JARs de JSF peuvent être trouvés dans le dossier <literal>lib</literal> de Seam. Les JARs EL peuvent être obtenue depuis la version 1.2 de Seam.
it_it: La configurazione web per JBoss 4.0 può essere trovata in <literal>server/default/deploy/jbossweb-tomcat55.sar</literal>. Occorre cancellare <literal>myfaces-api.jar</literal> e <literal>myfaces-impl.jar</literal> dalla directory <literal>jsf-libs</literal>. Poi occorre copiare <literal>jsf-api.jar</literal>, <literal>jsf-impl.jar</literal>, <literal>el-api.jar</literal>, e <literal>el-ri.jar</literal> in questa directory. I JAR JSF possono essere trovati nella directory <literal>lib</literal> di Seam. I JAR EL possono essere ottenuti dalla release Seam 1.2.
ja_jp: JBoss 4.0 の Web 設定は <literal>server/default/deploy/jbossweb-tomcat55.sar</literal> にあります。 <literal>jsf-libs </literal> ディレクトリから <literal>myfaces-api.jar</literal> と <literal>myfaces-impl.jar</literal> を削除する必要があります。 そして、ディレクトリに <literal>jsf-api.jar</literal>、<literal>jsf-impl.jar</literal>、<literal>el-api.jar</literal> と <literal>el-ri.jar</literal> をコピーする必要があります。 JSF の JAR は Seam <literal>lib</literal> ディレクトリにあります。 el の JAR は Seam 1.2 リリースから取得可能です。

source: You'll also need to edit the <literal>conf/web.xml</literal>, replacing <literal>myfaces-impl.jar</literal> with <literal>jsf-impl.jar</literal>.
fr_fr: Vous allez aussi devoir éditer le fichier <literal>conf/web.xml</literal>, en remplaçant<literal>myfaces-impl.jar</literal> par <literal>jsf-impl.jar</literal>.
it_it: Occorre modificare il <literal>conf/web.xml</literal>, sostituendo <literal>myfaces-impl.jar</literal> con <literal>jsf-impl.jar</literal>.
ja_jp: さらに <literal>conf/web.xml</literal> を編集する必要があります。 <literal>myfaces-impl.jar</literal> を <literal>jsf-impl.jar</literal> に交換してください。

source: JBoss 4.0 does not ship a default configuration compatible with Seam. To run Seam, you must install JBoss 4.0.5 using the JEMS 1.2 installer with the ejb3 profile selected. Seam will not run with an installation that doesn't include EJB3 support. The JEMS installer can be downloaded from <ulink url="http://www.jboss.org/jbossas/downloads">http://labs.jboss.com/jemsinstaller/downloads</ulink>.
ja_jp: JBoss 4.0 は Seam 互換のデフォルト設定で出荷されていません。 Seam を実行するために EJB3 プロファイルを選択して JEMS 1.2 インストーラ を使用してインストールしなければなりません。 Seam は EJB3 サポートを含まないインストールでは動作しません。 JEMS インストーラは <ulink url="http://labs.jboss.com/jemsinstaller/downloads">http://www.jboss.org/jbossas/downloads</ulink> からダウンロード可能です。
