Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Groovy.po
Languages: fr_fr, it_it, ja_jp

source: Groovy integration
fr_fr: L'intégration avec Groovy
it_it: Integrazione con Groovy
ja_jp: Groovy インテグレーション

source: One aspect of JBoss Seam is its RAD (Rapid Application Development) capability. While not synonymous with RAD, one interesting tool in this space is dynamic languages. Until recently, choosing a dynamic language was required choosing a completely different development platform (a development platform with a set of APIs and a runtime so great that you would no longer want to use you old legacy Java [sic] APIs anymore, which would be lucky because you would be forced to use those proprietary APIs anyway). Dynamic languages built on top of the Java Virtual Machine, and <ulink url="http://groovy.codehaus.org">Groovy</ulink> in particular broke this approach in silos.
fr_fr: Un des aspects de JBoss Seam est dans sa capacité RAD (Rapid Application Development, NdT Développement d'Application Rapide). Sans synonimie avec RAD, l'outil intéréssant dans ce cas est dans les langages dynamiques. Jusqu'à présent, choisir un langage dynamique était un choix qui été requis par une plateforme de développement complètement différente (une plateforme de développement avec un groupe d'APIs et un runtime si génial que vous ne devriez plus vouloir utiliser vos bonnes vieille APIs Java [sic] après, ce qui est une chance car vous ne devriez plus être forcé d'utiliser ces APIs propriétaire maintenant). Les langages dynamiques sont construis au dessus de la Machine Virtuelle Java et <ulink url="http://groovy.codehaus.org">Groovy</ulink> en particulier brise cette approche en silos.
it_it: Uno degli aspetti di JBoss Seam è la caratteristica RAD (Rapid Application Development). Benché i linguaggi dinamici non siano un sinonimo di RAD, in questo ambito essi sono uno degli aspetti più interessanti. Fino a poco tempo fa scegliere un linguaggio dinamico richiedeva anche di scegliere una piattaforma di sviluppo completamente differente (una piattaforma di sviluppo con un insieme di API ed un ambiente runtime così conveniente da non voler più tornare ad usare le vecchie API Java, con la fortuna di essere costretti ad usare in ogni caso quelle API proprietarie). I linguaggi dinamici costruiti sulla Java Virtual Machine, e <ulink url="http://groovy.codehaus.org">Groovy</ulink> in particolare, hanno rotto questo approccio alla grande.
ja_jp: JBoss Seamのもう一つの特徴として、RAD（高速アプリケーション開発）機能があります。RADと意味は異なりますが、ここで一つ興味深いのは動的言語です。最近まで、動的言語を取り入れるにはまったく異なる開発プラットフォームが必要でした。（そうした開発プラットフォームは使いやすいAPI一式とランタイムを備えているため、もはや古いレガシーJava[原文のまま]の APIを使う気にはなりませんでした。こうしてユーザーは開発プラットフォームごとに独自のAPIを使わざるを得ず、それは開発プラットフォーム側としては幸いな話でした。） Java バーチャルマシンの最上位に構築された動的言語の中でも、特に<ulink url="http://groovy.codehaus.org">Groovy</ulink>は、これまでの縦割り型手法を一新するものです。

source: JBoss Seam now unites the dynamic language world with the Java EE world by seamlessly integrating both static and dynamic languages. JBoss Seam lets the application developer use the best tool for the task, without context switching. Writing dynamic Seam components is exactly like writing regular Seam components. You use the same annotations, the same APIs, the same everything.
fr_fr: JBoss Seam unifie maintenant le monde des langages dynamiques avec le monde Java EE en intégrant sans couture les deux langages statique et dynamique. JBoss Seam permet au développer d'application d'utiliser le meilleur outil pour la tâche, sans basculer de contexte. Ecrire les composants dynamiques de Seam est exactement comme écrire des composants classiques de Seam. Vous utilisez les même annotations, les même APIs, les mêmes tout.
it_it: Oggi JBoss Seam unisce il mondo dei linguaggi dinamici con il mondo Java EE integrando perfettamente sia i linguaggi statici che quelli dinamici. JBoss Seam lascia che lo sviluppatore scelga il migliore strumento per ciò che deve fare, senza cambiare contesto. Scrivere componenti Seam dinamici è esattamente come scrivere componenti Seam normali. Si usano le stesse annotazioni, le stesse API, lo stesso di tutto.
ja_jp: JBoss Seam は静的言語と動的言語をシームレスに融合することで、Java EE の世界と動的言語の世界を一体化させています。JBoss Seam によって、アプリケーション開発者はコンテキストを切り替えることなく、最良のツールを使う使い開発することができます。動的な Seam コンポーネントを書くことは、従来のSeam コンポーネントを書くのとまったく同じようなものです。アノテーション、APIなど、これまでとすべて同じものを使うことができます。

source: Groovy introduction
fr_fr: Introduction à Groovy
it_it: Introduzione a Groovy
ja_jp: はじめに

source: Groovy is an agile dynamic language based on the Java language but with additional features inspired by Python, Ruby and Smalltalk. The strengths of Groovy are twofold:
fr_fr: Groovy est un langage dynamique agile basé sur le langage Java avec des fonctionnalité additionnelles inspirée par Python, Ruby et Smalltalk. La force de Groovy est dans deux points:
it_it: Groovy è un linguaggio dinamico agile basato sul linguaggio Java, ma con alcune caratteristiche addizionali ispirate da Python, Ruby e Smalltalk. Il punto di forza di Groovy è duplice:
ja_jp: Groovy は、Java言語をベースにしたアジャイル動的言語ですが、Python、Ruby、Smalltalkによって影響を受けた特徴も取り入れています。Groovy が持つ長所は、次の2点です。

source: Java syntax is supported in Groovy: Java code is Groovy code, making the learning curve very smooth
fr_fr: La syntaxe Java est supportée dans Groovy: le code Java est le code Groovy, ce qui rend la courbe d'apprentissage très douce
it_it: La sintassi Java è supportata in Groovy: il codice Java è codice Groovy, e ciò rende il processo di apprendimento molto semplice.
ja_jp: Java シンタックスをサポートしているので、GroovyのコードはJavaと同じですので、スムースに習得できます。

source: Groovy objects are Java objects, and Groovy classes are Java classes: Groovy integrates smoothly with existing Java libraries and frameworks.
fr_fr: Les objets Groovy sont des objets Java, et les classes Groovy sont des classes Java: Groovy s'intègre facilement avec les bibliothèques Java et les serveurs d'applications.
it_it: Gli oggetti Groovy sono oggetti Java e le classi Groovy sono classi Java: Groovy si integra semplicemente con le librerie e i framework Java esistenti.
ja_jp: Groovy のオブジェクトとクラスはJavaと同じなので、既存のJavaのライブラリやフレームワークをスムースに統合できます。

source: TODO: write a quick overview of the Groovy syntax add-on
fr_fr: A FAIRE: ecrire un rapide apperçu de l'ajout de syntaxe Groovy
it_it: TODO: scrivere un breve riassunto delle caratteristiche specifiche della sintassi Groovy.
ja_jp: TODO:Groovy シンタックスアドオンの概要を説明

source: Writing Seam applications in Groovy
fr_fr: L'écriture d'applications Seam en Groovy
it_it: Scrivere applicazioni Seam in Groovy
ja_jp: Groovy による Seam アプリケーションの記述

source: There is not much to say about it. Since a Groovy object is a Java object, you can virtually write any Seam component, or any class for what it worth, in Groovy and deploy it. You can also mix Groovy classes and Java classes in the same application.
fr_fr: Il n'y a pas grand chose à dire à propos de cela. Si un objet Groovy est un objet Java, vous pouvez virtuellement écrire tout composant Seam, ou toute classe pour ce qui est prévu, en Groovy et la déployer. Vous pouvez aussi mélanger les classes Groovy et Java dans la même application.
it_it: Non c'è molto da dire su questo. Poiché un oggetto Groovy è un oggetto Java, è virtualmente possibile scrivere qualsiasi componente Seam, così come qualsiasi altra classe del resto, in Groovy e metterla in funzione. E' anche possibile fare un misto di classi Groovy e classi Java nella stessa applicazione.
ja_jp: これについては、あまり説明する必要はありません。Groovyオブジェクト は Java オブジェクトであるため、Seam コンポーネントや必要なクラスをそのままGroovyで記述し、デプロイすることができます。同じアプリケーション中でGroovyのクラスとJavaのクラスを一緒に使うこともできます。

source: Writing Groovy components
fr_fr: Ecriture de composants en Groovy
it_it: Scrivere componenti Groovy
ja_jp: Groovy コンポーネントの記述

source: As you should have noticed by now, Seam uses annotations heavily. Be sure to use Groovy 1.1 or above for annotation support. Here are some example of groovy code used in a Seam application.
fr_fr: Comme vous devriez avoir noté maintenant, Seam utilise lourdement les annotations. Soyez sûr d'utiliser Groovy 1.1 ou supérieur pour le support des annotations. Voici un exemple de code en groovy utilisé dans une application Seam.
it_it: Come è stato possibile notare finora, Seam usa pesantemente le annotazioni. Assicurarsi di usare Groovy 1.1 o una versione successiva per avere il supporto delle annotazioni. Di seguito ci sono alcuni esempi di codice Groovy utilizzato in una applicazione Seam.
ja_jp: ここまででお分かりのように、Seamではアノテーションを多用しています。従って、アノテーションをサポートしているGroovy 1.1 以上のバージョンをお使いください。以下はSeamアプリケーションで使われているGroovyコードの例です。

source: Entity
fr_fr: Entité
it_it: Entità
ja_jp: エンティティ

source: Groovy natively support the notion of properties (getter/setter), so there is no need to explicitly write verbose getters and setters: in the previous example, the hotel class can be accessed from Java as <code>hotel.getCity()</code>, the getters and setters being generated by the Groovy compiler. This type of syntactic sugar makes the entity code very concise.
fr_fr: Groovy supporte nativement la notion de propriété (asseseurs), donc il n'y a pas besoin d'écrire de verbeux assesseurs: dans l'exemple précédent, la classe hotel peut être accédé depuis Java comme <code>hotel.getCity()</code>, les asseseurs peuvent être générés par le compilateur Groovy. Le type de la syntaxe pur sucre rends le code de l'entité très concise.
it_it: Groovy supporta nativamente il concetto di proprietà (getter/setter), perciò non c'è bisogno di scrivere esplicitamente il ripetitivo codice dei getter e setter: nell'esempio precedente, la classe hotel può essere utilizzata da Java come <code>hotel.getCity()</code>, i metodi getter e setter vengono generati dal compilatore Groovy. Questo tipo di facilitazione sintattica rende il codice delle entità molto conciso.
ja_jp: Groovyではもともとプロパティ(getter/setter)の概念をサポートしています。そのため、冗長なgetterやsetterを明示的に記述する必要はありません。上の例では、hotelクラスはJavaからhotel.getCity()でアクセスできますが、このgetterやsetterはGroovyのコンパイラが生成したものです。こうした簡略構文を使えば、エンティティコードは非常に簡潔になります。

source: Seam component
fr_fr: Le composant Seam
it_it: Componenti Seam
ja_jp: Seam コンポーネント

source: Writing Seam components in Groovy is in no way different than in Java: annotations are used to mark the class as a Seam component.
fr_fr: Ecrire les composants Seam en Groovy n'est pas vraiment différent qu'en Java: les annotations sont utilisées pour marquer la classe comme un composant de Seam.
it_it: Scrivere componenti Seam in Groovy non è diverso da farlo in Java: le annotazioni sono utilizzate per marcare la classe come un componente Seam.
ja_jp: SeamコンポーネントをGroovyで記述するのは、Javaで記述するのと同じです。Seamコンポーネントとしてクラスに目印をつけるために、アノテーションを使います。

source: Seam gen has a transparent integration with Groovy. You can write Groovy code in seam-gen backed projects without any additional infrastructure requirement. When writing a Groovy entity, simply place your <filename>.groovy</filename> files in <filename>src/main</filename>. Unsurprisingly, when writing an action, simply place your <filename>.groovy</filename> files in <filename>src/hot</filename>.
fr_fr: Seam-gen as une intégration transparente avec Groovy. Vous pouvez écrire le code Groovy dans un projet géré par seam-gen sans aucun prérequis d'infrastructure additionnel. Quand à écrire une entité Groovy, placez simplement vos fichiers <filename>.groovy</filename> dans <filename>src/main</filename>. Sans surprise, avec l'écriture d'une action, placez simplement vos fichiers <filename>.groovy</filename> dans <filename>src/hot</filename>.
it_it: Seam gen ha una integrazione trasparente rispetto a Groovy. E' possibile scrivere codice Groovy in un progetto strutturato da seam-gen senza alcun requisito infrastrutturale addizionale. Se vengono scritte entità in Groovy è sufficiente posizionare i file <filename>.groovy</filename> in <filename>src/main</filename>. Allo stesso modo, quando vengono scritte delle azioni, è sufficiente posizionare i file <filename>.groovy</filename> in <filename>src/hot</filename>.
ja_jp: seam-gen はGroovyと透過的に統合できます。seam-gen で生成されるプロジェクトでは、開発環境に一切追加することなく、Groovyコードを記述できます。Groovyエンティティを記述する場合には、<filename>.groovy</filename>ファイルを<filename>src/main</filename>に置くだけです。驚くことではないですが、アクションを記述する場合には、<filename>.groovy</filename>ファイルを<filename>src/hot</filename>に置くだけです。

source: Deployment
fr_fr: Le déploiement
it_it: Esecuzione
ja_jp: デプロイ

source: Deploying Groovy classes is very much like deploying Java classes (surprisingly, no need to write nor comply with a 3-letter composite specification to support a multi-language component framework).
fr_fr: Le déploiement des classes Groovy est assez proche du déploiement des classes Java (sans surprise, pas besoin d'écrire ni de se conformer avec la spécification composite en 3 lettres pour supportert un serveur d'application multi langage).
it_it: Eseguire classi Groovy è molto simile ad eseguire classi Java (soprendentemente non c'è bisogno di scrivere o di essere compatibili con qualche complessa specifica a 3 lettere per supportare più linguaggi nei componenti di framework).
ja_jp: Groovyクラスのデプロイは、Javaクラスのデプロイと非常によく似ています。（驚くべきことに、多言語のコンポーネントフレームワークをサポートするよう、国名3レターコードの複合仕様で記述する必要もなく、それに従う必要もありません。）

source: Beyond standard deployments, JBoss Seam has the ability, at development time, to redeploy JavaBeans Seam component classes without having to restart the application, saving a lot of time in the development / test cycle. The same support is provided for GroovyBeans Seam components when the <filename>.groovy</filename> files are deployed.
fr_fr: Au delà des déploiement standard, JBoss Seam a la capacité ,au moment du développement, de redéployer les classes de composants Seam JavaBeans sans avoir à redémarrer l'application, préservant beaucoup de temps de développement dans le cycle développement/test. Le même support est fourni par les composants de Seam de GroovyBeans quand les fichiers <filename>.groovy</filename> sont déployés.
it_it: Al di là della modalità standard di esecuzione, JBoss Seam ha l'abilità, durante lo sviluppo, di sostituire componenti Seam JavaBeans senza bisogno di riavviare l'applicazione, risparmiando molto tempo nel ciclo di sviluppo e test. Lo stesso supporto è fornito per i componenti Seam GroovyBeans quando i file <filename>.groovy</filename> vengono eseguiti.
ja_jp: 標準的なデプロイだけでなく、開発時にJavaBeansのSeamコンポーネントクラスを再デプロイする場合、JBoss Seamではアプリケーションを再起動する必要がありません。これにより、開発/テストのサイクルでかかる時間を大幅に短縮できます。<filename>.groovy</filename>ファイルをデプロイする場合には、GroovyBeansのSeamコンポーネントでも同様に再デプロイできます。

source: Deploying Groovy code
fr_fr: Le déploiement de code Groovy
it_it: Eseguire il codice Groovy
ja_jp: Groovy コードのデプロイ

source: A Groovy class <emphasis>is</emphasis> a Java class, with a bytecode representation just like a Java class. To deploy, a Groovy entity, a Groovy Session bean or a Groovy Seam component, a compilation step is necessary. A common approach is to use the <literal>groovyc</literal> ant task. Once compiles, a Groovy class is in no way different than a Java class and the application server will treat them equally. Note that this allow a seamless mix of Groovy and Java code.
fr_fr: Une classe Groovy <emphasis>est</emphasis> une classe Java avec une représentation en bytecode tout comme une classe Java. Pour déployer une entité Groovy, un bean de session Groovy ou un composant Seam Groovy, une étape de compilation est nécéssaire. Une approche commune est d'utiliser la tache ant <literal>groovyc</literal>. Une fois compilé, une classe Groovy n'est en acune manière différente d'une classe Java et le serveur d'application la traitera à équalité. Notez que cela autorise un mélange intégré de Groovy et de code Java.
it_it: Una classe Groovy <emphasis>è</emphasis> una classe Java, con una rappresentazione bytecode esattamente come una classe Java. Per eseguire un'entità Groovy, un Session Bean Groovy o un componente Seam Groovy, è necessario un passaggio di compilazione. Un approccio diffuso è quello di usare il task ant <literal>groovyc</literal>. Una volta compilata, una classe Groovy non presenta alcuna differenza rispetto ad una classe Java e l'application server le tratterà nello stesso modo. Notare che questo consente di utilizzare un misto di codice Groovy e Java.
ja_jp: GroovyのクラスはまさにJavaのクラスで、バイトコード表現はそのままJavaクラスと同じものです。GroovyエンティティやGroovyセッションbean、Groovy Seamコンポーネントでデプロイする際に必要となるコンパイル方法があります。一般的な方法は、<literal>groovyc</literal> antタスクを使うものです。一旦コンパイルすると、GroovyクラスはJavaクラスと同じになるので、アプリケーションサーバーはどちらも同じように扱うことになります。このため、GroovyとJavaのコードはシームレスに使うことができるのです。

source: Native .groovy file deployment at development time
fr_fr: Le déploiement de fichier .groovy natif au moment du déploiement
it_it: Esecuzione di file .groovy durante lo sviluppo
ja_jp: 開発時のネイティブ .groovy ファイルのデプロイ

source: JBoss Seam natively supports the deployment of <literal>.groovy</literal> files (ie without compilation) in incremental hotdeployment mode (development only). This enables a very fast edit/test cycle. To set up .groovy deployments, follow the configuration at <xref linkend="gettingstarted-hotdeployment"/> and deploy your Groovy code (<filename>.groovy</filename> files) into the <filename>WEB-INF/dev</filename> directory. The GroovyBean components will be picked up incrementally with no need to restart the application (and obviously not the application server either).
fr_fr: JBoss Seam supporte nativement le déploiement de fichier <literal>.groovy</literal> f (autrement dit sans compilation) dans le mode de redéploiement à chaud incrémental (seulement au développement). Cela rend possible un cycle edition/test très rapide. Pour configurer le déploiement de .groovy, suivez la configuration de la <xref linkend="gettingstarted-hotdeployment"/> et deploiyez votre code Groovy (les fichiers <filename>.groovy</filename>) dans le dossier <filename>WEB-INF/dev</filename>. Les composants GroovyBean vont être pris incrémentallement sans avoir besoin de redémarrer l'application (ni heureusement le serveur d'application).
it_it: JBoss Seam supporta l'esecuzione diretta di file <literal>.groovy</literal> (cioè senza compilazione) nella modalità di hot deployment incrementale (solo per lo sviluppo). Ciò consente un ciclo di modifica/test molto rapido. Per impostare l'esecuzione dei file .groovy, seguire la configurazione indicata in <xref linkend="gettingstarted-hotdeployment"/> ed eseguire il codice Groovy (i file <filename>.groovy</filename>) nella cartella <filename>WEB-INF/dev</filename>. I componenti GroovyBean verranno presi in modo incrementale senza bisogno di riavviare l'applicazione (e ovviamente neanche l'application server).
ja_jp: JBoss Seamでは元々、増分ホットデプロイメントモード（開発のみ）を使った<literal>.groovy</literal>ファイル（つまりコンパイルされていないもの）のデプロイをサポートしています。これによって、修正／テストサイクルが非常に速くなります。.groovyデプロイメントでは、<xref linkend="gettingstarted-hotdeployment"/>に従って設定し、Groovyコード(<filename>.groovy</filename> ファイル)を<filename>WEB-INF/dev</filename>ディレクトリにデプロイします。アプリケーションを再起動することなく、GroovyBeanコンポーネントが追加されます。（もちろんアプリケーションサーバーの再起動も不要です。）

source: Be aware that the native .groovy file deployment suffers the same limitations as the regular Seam hotdeployment:
fr_fr: Soyez informé que le déploiement de fichier .groovy natif souffre des limitations identique du redéploiement à chaud classique de Seam:
it_it: Fare attenzione al fatto che l'esecuzione diretta dei file .groovy soffre delle stesse limitazioni del normale hot deployment di Seam:
ja_jp: ネイティブ.groovyファイルのデプロイでは、従来のSeamホットデプロイメントと同じように以下の制約があります。

source: The components must be JavaBeans or GroovyBeans. They cannot be EJB3 bean
fr_fr: Les composants doivent être des JavaBeans ou des GroovyBeans. Ils ne peuvent pas être des beans EJB3
it_it: I componenti devono essere JavaBeans o GroovyBeans. Non possono essere componenti EJB3.
ja_jp: コンポーネントは必ずJavaBeans もしくは GroovyBeansとし、EJB3 beanを使うことはできません。

source: Entities cannot be hotdeployed
fr_fr: Les entités ne peuvent pas redéployées à chaud
it_it: Le entità non possono essere eseguite in modalità hot deploy.
ja_jp: エンティティはホットデプロイできません。

source: The hot-deployable components will not be visible to any classes deployed outside of <literal>WEB-INF/dev</literal>
fr_fr: Le déploiement à chaud des composants ne sera pas visible pour toute classes deployé à l'extérieur de <literal>WEB-INF/dev</literal>
it_it: I componenti da eseguire in modalità hotdeploy non saranno visibili ad alcuna classe posizionata al di fuori di <literal>WEB-INF/dev</literal>
ja_jp: ホットデプロイ可能なコンポーネントは、 <literal>WEB-INF/dev</literal> の外部にデプロイされたクラスからは見えません。

source: Seam debug mode must be enabled
fr_fr: Le mode debug de Seam doit être activé
it_it: La modalità debug di Seam deve essere attivata
ja_jp: Seam デバックモードを有効にしなければなりません。

source: Seam-gen transparently supports Groovy files deployment and compilation. This includes the native <filename>.groovy</filename> file deployment in development mode (compilation-less). If you create a seam-gen project of type WAR, Java and Groovy classes in <filename>src/hot</filename> will automatically be candidate for the incremental hot deployment. If you are in production mode, the Groovy files will simply be compiled before deployment.
fr_fr: Seam-gen supporte de manière transparent le déploiement et la compilation de fichiers Groovy. Cela inclus le déploiement de fichier <filename>.groovy</filename> natif dans le mode développement (sans compilation). Si vous créez un projet seam-gen de type WAR, les classes Java et Groovy dans <filename>src/hot</filename> vont être automatiquement candidate pour le déploiement à chaud incrémental. Si vous êtes en mode de production, les fichiers Groovy vont être simplement compilés avant le déploiement.
it_it: Seam-gen supporta la compilazione e l'esecuzione dei file Groovy in modo trasparente. Questo include l'esecuzione diretta dei file <filename>.groovy</filename> durante lo sviluppo (senza compilazione). Creando un progetto seam-gen di tipo WAR, le classi Java e Groovy posizionate in <filename>src/hot</filename> saranno automaticamente candidate per l'esecuzione incrementale in modalità hot deploy. In modalità di produzione, i file Groovy saranno semplicemente compilati prima dell'esecuzione.
ja_jp: Seam-gen はGroovyファイルのデプロイとコンパイルを透過的にサポートしています。これには、（コンパイル不要の）開発モードにおけるネイティブ<filename>.groovy</filename>ファイルのデプロイも含まれます。<filename>src/hot</filename>にWAR, Java, Groovyクラスで構成されたseam-genプロジェクトを作成する場合、自動的に増分ホットデプロイメントの対象になります。プロダクションモードでは、単にデプロイ前にGroovyファイルをコンパイルします。

source: You will find a live example of the Booking demo written completely in Groovy and supporting incremental hot deployment in <filename>examples/groovybooking</filename>.
fr_fr: Vous trouverez un exemple en ligne de la démonstration de la Réservation d'Hotel écrit totalement en Groovy et supportant le déploiement incrémental à chaud dans <filename>examples/groovybooking</filename>.
it_it: In <filename>examples/groovybooking</filename> è possibile trovare un esempio della demo Booking scritto completamente in Groovy con il supporto per l'esecuzione incrementale in modalità hot deploy
ja_jp: <filename>examples/groovybooking</filename>にあるGroovyで記述した予約システムの実例では、増分ホットデプロイメントに対応しています。
