Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Gwt.po
Languages: fr_fr, it_it

source: Seam and the Google Web Toolkit
fr_fr: Seam et le Google Web Toolkit
it_it: Seam e il Google Web Toolkit

source: For those that prefer to use the Google Web Toolkit (GWT) to develop dynamic AJAX applications, Seam provides an integration layer that allows GWT widgets to interact directly with Seam components.
fr_fr: Pour ceux qui p^réfère utiliser le Google Web Toolkit (GWT) pour développer des applications AJAX dynamique, Seam fourni une couche d'intégration qui permet aux widgets GWT d'interagir directement avecc les composants de Seam.
it_it: Per chi preferisce utilizzare Google Web Toolkit (GWT) per sviluppare applicazioni AJAX dinamiche, Seam fornisce uno strato di integrazione che consente ai componenti GWT di interagire direttamente con i componenti Seam.

source: To use GWT, we assume that you are already familiar with the GWT tools - more information can be found at <ulink url="http://code.google.com/webtoolkit/">http://code.google.com/webtoolkit/</ulink>. This chapter does not attempt to explain how GWT works or how to use it.
fr_fr: Pour utiliser GWT, nous allons postuler que vous êtes déjà familier avec les outils GWT - plus d'informations peut ête trouvée sur <ulink url="http://code.google.com/webtoolkit/">http://code.google.com/webtoolkit/</ulink>. Ce chapitre n'essaye pas d'expliquer comment GWT fonctionne et comment l'utiliser.
it_it: Per usare GWT, si suppone che ci sia già una certa familiarità con gli strumenti GWT. Maggiori informazioni si possono trovare in <ulink url="http://code.google.com/webtoolkit/">http://code.google.com/webtoolkit/</ulink>. Questo capitolo non cercherà di spiegare come funziona GWT o come si usa.

source: Configuration
fr_fr: La configuration
it_it: Configurazione

source: There is no special configuration required to use GWT in a Seam application, however the Seam resource servlet must be installed. See <xref linkend="configuration"/> for details.
fr_fr: Il n'y a pas de configuration spécialé nécéssaire pour utiliser GWT dans une application Seam, cependant le servlet de ressource de Seam doit être installé. Voir <xref linkend="configuration"/> pour les détails.
it_it: Non è richiesta una particolare configurazione per usare GWT in una applicazione Seam, ad ogni modo la servlet delle risorse Seam deve essere installata. Vedi <xref linkend="configuration"/> per i dettagli.

source: Preparing your component
fr_fr: La préparation de votre composant
it_it: Preparare i componenti

source: The first step in preparing a Seam component to be called via GWT, is to create both synchronous and asynchronous service interfaces for the methods you wish to call. Both of these interfaces should extend the GWT interface <literal>com.google.gwt.user.client.rpc.RemoteService</literal>:
fr_fr: La première étape dans la préparation du composant dfe Seam est d'être appelé via GWT, cela créer deux interfaces de service synchrone et assynchrone pour les méthode que vous souhaitez appeler. Ces deux interfaces devraient étendre l'interface GWT <literal>com.google.gwt.user.client.rpc.RemoteService</literal>:
it_it: Il primo passo per preparare i componenti Seam che saranno richiamati tramite GWT è di creare sia l'interfaccia per il servizio sincrono che quella per il servizio asincrono per i metodi che si desidera chiamare. Entrambe queste interfacce devono estendere l'interfaccia GWT <literal>com.google.gwt.user.client.rpc.RemoteService</literal>:

source: The asynchronous interface should be identical, except that it also contains an additional <literal>AsyncCallback</literal> parameter for each of the methods it declares:
fr_fr: L'interface asynchrone devrait être identique, à la différence qu'il doit contenir un paramètre additionnel <literal>AsyncCallback</literal> pour chaque méthode qu'il déclare:
it_it: L'interfaccia asincrona deve essere identica, salvo che contiene un parametro aggiuntivo <literal>AsyncCallback</literal> per ciascuno dei metodi che dichiara:

source: The asynchronous interface, in this example <literal>MyServiceAsync</literal>, will be implemented by GWT and should never be implemented directly.
fr_fr: L'interface assynchrone, dans cet exemple <literal>MyServiceAsync</literal>, sera implémenté par GWT et ne devrait pas être implémenté directement.
it_it: L'interfaccia asincrona, <literal>MyServiceAsync</literal> in questo esempio, sarà implementata da GWT e non dovrà mai essere implementata direttamente.

source: The next step, is to create a Seam component that implements the synchronous interface:
fr_fr: L'étape suivante, est de créer un composant de Seam qui implémente l'interface synchrone:
it_it: Il passo successivo è di creare un componente Seam che implementa l'interfaccia sincrona:

source: The name of the seam component <emphasis>must</emphasis> match the fully qualified name of the GWT client interface (as shown), or the seam resource servlet will not be able to find it when a client makes a GWT call. The methods that are to be made accessible via GWT also need to be annotated with the <literal>@WebRemote</literal> annotation.
fr_fr: Le nom du composant seam <emphasis>doit</emphasis> correspondre au nom pleinement qualifié de l'interface client GWT (comme montré), ou ne servlet de ressource de seam ne sera pas capable de le trouver quand un client fait un appel GWT. Les méthodes qui sont accéssible via GWT doivent aussi être annotées avec l'annotation <literal>@WebRemote</literal>.
it_it: Il nome del componente Seam <emphasis>deve</emphasis> corrispondere al nome completo dell'interfaccia client GWT (come illustrato), altrimento la servlet delle risorse non riuscirà a trovarlo quando un client farà una chiamata GWT. I metodi che si vogliono rendere accessibili tramite GWT devono anche essere annotati con l'annotazione <literal>@WebRemote</literal>.

source: Hooking up a GWT widget to the Seam component
fr_fr: Interception deu widget GWT vers un composant de Seam
it_it: Collegare un componente GWT ad un componente Seam

source: The next step, is to write a method that returns the asynchronous interface to the component. This method can be located inside the widget class, and will be used by the widget to obtain a reference to the asynchronous client stub:
fr_fr: La prochaine étape est d'écrire une méthode qui retourne un itnerface assynchrone vers le composant. Cette méthode est localisée dans la classe widget, et sera utilisé avec le widget pour obtenir une référence vers un squelette de client assynchrone:
it_it: Il prossimo passo è scrivere un metodo che restituisce l'interfaccia asincrona al componente. Questo metodo può essere posizionato all'interno della classe del componente GWT e sarà usato da questo per ottenere un riferimento al client di collegamento asincrono:

source: The final step is to write the widget code that invokes the method on the client stub. The following example creates a simple user interface with a label, text input and a button:
fr_fr: La dernière étape est d'écrire le code du widget qui invoque la méthode sur le squelette du client. L'exemple suivant créer un interface utilisateur simple avec un label, une zone de saisie et un bouton:
it_it: Il passo finale è scrivere il codice del componente GWT che invoca il metodo sul client di collegamento. Il seguente esempio definisce una semplice interfaccia utente con una label, un campo di input e un bottone:

source: When clicked, the button invokes the <literal>askServer()</literal> method passing the contents of the input text (in this example, validation is also performed to ensure that the input is a valid question). The <literal>askServer()</literal> method acquires a reference to the asynchronous client stub (returned by the <literal>getService()</literal> method) and invokes the <literal>askIt()</literal> method. The result (or error message if the call fails) is shown in an alert window.
fr_fr: Quand on clique, le bouton appelle la méthode <literal>askServer()</literal> en passant le contenu de la zone de saisie (dans cet exemple, la validation est aussi réalisé pour s'assurer que la zone de saiie contient une question valide). La méthode <literal>askServer()</literal> obtient une référencer vers un squelette de client assynchrone (retournée par la méthode <literal>getService()</literal>) et invoque la méthode <literal>askIt()</literal>. Le résultat (ou le message d'erreursi l'appel échoue) est affiché dans une fenètre d'alerte.
it_it: Facendo click, il bottone invoca il metodo <literal>askServer()</literal> passando il contenuto del campo input (in questo esempio viene fatta anche una validazione per assicurare che il testo inserito sia una domanda valida). Il metodo <literal>askServer()</literal> acquisisce un riferimento al client di collegamento asincrono (restituito dal metodo <literal>getService()</literal>) e invoca il metodo <literal>askIt()</literal>. Il risultato (o il messaggio di errore se la chiamata fallisce) è mostrato in una finestra di segnalazione.

source: The complete code for this example can be found in the Seam distribution in the <literal>examples/remoting/gwt</literal> directory.
fr_fr: Le code complet pour cet exemple peut être trouvé dans la distribution de Seam dans le dossier <literal>examples/remoting/gwt</literal>.
it_it: Il codice completo di questo esempio si trova nella distribuzione Seam sotto la cartella <literal>examples/remoting/gwt</literal>.

source: GWT Ant Targets
fr_fr: Les cibles Ant GWT
it_it: Target Ant per GWT

source: For deployment of GWT apps, there is a compile-to-Javascript step (which compacts and obfuscates the code). There is an ant utility which can be used instead of the command line or GUI utility that GWT provides. To use this, you will need to have the ant task jar in your ant classpath, as well as GWT downloaded (which you will need for hosted mode anyway).
fr_fr: Pour le déploiement des applications GWT, il ya une étape de compilation vers Javascript (avec compactage et cryptage du code). Il y a un utilitaire de ant qui peut être utilisé au lieu de la ligne de commande ou de l'utilitaire GUI que GWT fourni. Pour l'utiliser, vous allez avoir besoin d'avoit le jar de tâche ant dans votre classpath, tout comme le GWT téléchargé (avec ce que vous avez besoin pour votre mode hébergement).
it_it: Per eseguire applicazioni GWT c'è un passaggio di compilazione da Java a JavaScript (che compatta il codice e lo rende illeggibile). C'è uno strumento Ant che può essere utilizzato al posto della linea di comando o dello strumento grafico fornito con GWT. Per usarlo occorre avere il jar con lo strumento Ant nel classpath di Ant, e anche l'ambiente GWT scaricato (che sarebbe comunque necessario per far eseguire il componente in modalità hosted).

source: Then, in your ant file, place (near the top of your ant file):
fr_fr: Ensuite, dans votre fichier ant, mettez (presque en haut de votre fichier ant):
it_it: Quindi nel file Ant va scritto (verso l'inizio del file Ant):

source: Create a <literal>build.properties</literal> file, which has the contents:
fr_fr: Créez un fichier <literal>build.properties</literal>, qui va avoir ce contenu:
it_it: Creare un file <literal>build.properties</literal>, con il seguente contenuto:

source: This of course should point to the directory where GWT is installed. Then to use it, create a target:
fr_fr: Ceci devrait bien sûr pointer vers le dossier où GWT doit être installé. Ensuite, utilisez le pour créer une cible:
it_it: Questo naturalmente deve puntare alla cartella dove si è installato GWT. A questo punto per usarlo creare il target:

source: <![CDATA[<!-- the following are are handy utilities for doing GWT development. To use GWT, you will of course need to download GWT seperately --> <target name="gwt-compile"> <!-- in this case, we are "re homing" the gwt generated stuff, so in this case we can only have one GWT module - we are doing this deliberately to keep the URL short --> <delete> <fileset dir="view"/> </delete> <gwt:compile outDir="build/gwt" gwtHome="${gwt.home}" classBase="${gwt.module.name}" sourceclasspath="src"/> <copy todir="view"> <fileset dir="build/gwt/${gwt.module.name}"/> </copy> </target>]]>
it_it: <![CDATA[<!-- Le seguenti sono istruzioni pratiche per lo sviluppo in GWT. Per usare GWT occorre aver scaricato GWT separatamente --> <target name="gwt-compile"> <!-- in questo caso stiamo riposizionando la roba generata da gwt, perciò in questo caso possiamo avere solo un modulo GWT - facciamo in questo modo appositamente per mantenere breve l'URL --> <delete> <fileset dir="view"/> </delete> <gwt:compile outDir="build/gwt" gwtHome="${gwt.home}" classBase="${gwt.module.name}" sourceclasspath="src"/> <copy todir="view"> <fileset dir="build/gwt/${gwt.module.name}"/> </copy> </target>]]>

source: This target when called will compile the GWT application, and copy it to the specified directory (which would be in the <literal>webapp</literal> part of your war - remember GWT generates HTML and Javascript artifacts). You never edit the resulting code that <literal>gwt-compile</literal> generates - you always edit in the GWT source directory.
fr_fr: La cible quand appelée va compiler l'application GWT et la copier dans le dossier spécifiée (ce qui devrait être dans le coin <literal>webapp</literal> de votre war - n'oubliez pas GWT génère des artefactes HTML et javascript). Vous n'éditez jamais le code résultant que <literal>gwt-compile</literal> génère - vous devez toujours éditer le source dans le dossier GWT.
it_it: Quando viene chiamato, questo target compila l'applicazione GWT e la copia nella cartella indicata (che dovrebbe trovarsi nella parte <literal>webapp</literal> del war. Si ricordi che GWT genera oggetti HTML e JavaScript). Il codice risultante dalla generazione con <literal>gwt-compile</literal> non va mai modificato. Le modifiche vanno fatte sulla cartella dei sorgenti GWT.

source: Remember that GWT comes with a hosted mode browser - you should be using that if you are developing with GWT. If you aren't using that, and are just compiling it each time, you aren't getting the most out of the toolkit (in fact, if you can't or won't use the hosted mode browser, I would go far as to say you should NOT be using GWT at all - it's that valuable!).
fr_fr: N'oubliez pas que GWT vient avec un mode navigable hébergé - vous devriez l'utiliser pendant que vous développez avec GWT. Si vous ne le faite pas, et compilez à chaque fois, vous n'allez pas avoir le meilleurs de ce kit de développement (dans les fait, si vous ne voulez ou ne pouvez utiliser le mode navigable hébergé, je vous déconseille FORTEMENT d'utiliser GWT - est ce bien clair!).
it_it: Si tenga presente che GWT contiene un browser per la modalità hosted che andrebbe utilizzato se si sviluppa con GWT. Non utilizzandolo e compilando ogni volta, si rinuncia alla maggior parte del toolkit (in effetti a chi non può o non vuole usare il browser in modalità hosted, sarebbe da dirgli che NON dovrebbe usare GWT per niente, dato che quella è la cosa migliore!).
