Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Hsearch.po
Languages: fr_fr, it_it

source: Introduction
it_it: Introduzione

source: Full text search engines like Apache Lucene™ are a very powerful technology that bring full text and efficient queries to applications. Hibernate Search, which uses Apache Lucene under the covers, indexes your domain model with the addition of a few annotations, takes care of the database / index synchronization and returns regular managed objects that are matched by full text queries. Keep in mind, thought, that there are mismatches that arise when dealing with an object domain model over a text index (keeping the index up to date, mismatch between the index structure and the domain model, and querying mismatch). But the benefits of speed and efficiency far outweigh these limitations.
fr_fr: Les moteurs de recherches plein texte comme Apache Lucene™ sont une technologie très puissante qui apporte la recherche plain texte et l'efficacité des requêtes dans les applications. Hibernate Search qui utilise Apache Lucene soujacent indexe votre modèle du domaine avec quelques annotations additionnelles, prends garde à la synchronisation base de données / indexes et retourne des objets opérationnels qui correspondent aux requêtes de recherche plain texte. Gardez à l'esprit qu'il peut avoir des erreurs qui apparaisssent avec un modèle de domaine objet par dessus un index de textes (conserver l'index à jours, erreur entre la structure de l'index et le modèle du domaine, et erreurs dans les requêtes). Mais les avantages de la vitesse et de l'efficacité va au delà de ces limitations.
it_it: Motori di ricerca full text come Apache Lucene™ sono una potentissima tecnologia che fornisce alle applicazioni efficienti query full text. Hibernate Search, che utilizza Apache Lucene al suo interno, indicizza il modello di dominio con l'aggiunta di alcune annotazioni, si prende cura del database, della sincronizzazione degli indici e restituisce oggetti regolari gestiti che corrispondono alle query full text. Tuttavia si tenga presente che ci sono delle irregolarità quando si ha a che fare con un modello di dominio a oggetti sopra ad un indice di testo (mantenere l'indice aggiornato, irregolarità tra la struttura dell'indice ed il modello di dominio, e irregolarità di query). Ma i benefici di velocità ed efficienza superano di gran lunga queste limitazioni.

source: Hibernate Search has been designed to integrate nicely and as naturally as possible with JPA and Hibernate. As a natural extension, JBoss Seam provides an Hibernate Search integration.
fr_fr: Hibernate Search a été conçu pour s'intégrer facilement et naturellement que possible avec JPA et Hibernate. Comme une extension naturelle, JBoss Seam fourni une intégration avec Hibernate Search.
it_it: Hibernate Search è stato progettato per integrarsi nel modo più naturale possibile con JPA ed Hibernate. Essendo una naturale estensione, JBoss Seam fornisce l'integrazione con Hibernate Search.

source: Please refer to the <ulink url="http://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/">Hibernate Search documentation</ulink> for information specific to the Hibernate Search project.
fr_fr: Merci de vous référer à <ulink url="http://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/">Hibernate Search documentation</ulink> pour plus d'information spécifique sur le projet Hibernate Search.
it_it: Si prega di riferirsi alla <ulink url="http://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/">documentazione Hibernate Search</ulink> per informazioni sul progetto Hibernate Search.

source: Configuration
fr_fr: La configuration
it_it: Configurazione

source: Hibernate Search is configured either in the <filename>META-INF/persistence.xml</filename> or <filename>hibernate.cfg.xml</filename> file.
fr_fr: Hibernate Search est configuré aussi bien dans le fichier <filename>META-INF/persistence.xml</filename> que dans le fichier <filename>hibernate.cfg.xml</filename>.
it_it: Hibernate Search è configurato in uno dei file <filename>META-INF/persistence.xml</filename> o <filename>hibernate.cfg.xml</filename>.

source: Hibernate Search configuration has sensible defaults for most configuration parameters. Here is a minimal persistence unit configuration to get started.
fr_fr: La configuration d'Hibernate Search configuration est par défaut judicieuse pour la plus part des paramètre de configuration. Ici n configuration d'une unité de persistance minimale pour démarrer.
it_it: La configurazione di Hibernate Search ha dei valori di default impostati per la maggior parte dei parametri di configurazione. Ecco qua una configurazione minimale di persistence unit per poter iniziare.

source: <![CDATA[<persistence-unit name="sample"> <jta-data-source>java:/DefaultDS</jta-data-source> <properties> [...] <!-- use a file system based index --> <property name="hibernate.search.default.directory_provider" value="org.hibernate.search.store.FSDirectoryProvider"/> <!-- directory where the indexes will be stored --> <property name="hibernate.search.default.indexBase" value="/Users/prod/apps/dvdstore/dvdindexes"/> </properties> </persistence-unit>]]>
it_it: <![CDATA[<persistence-unit name="sample"> <jta-data-source>java:/DefaultDS</jta-data-source> <properties> [...] <!-- utilizza un file system basato su indice --> <property name="hibernate.search.default.directory_provider" value="org.hibernate.search.store.FSDirectoryProvider"/> <!-- directory dove gli indici verranno memorizzati --> <property name="hibernate.search.default.indexBase" value="/Users/prod/apps/dvdstore/dvdindexes"/> </properties> </persistence-unit>]]>

source: If you plan to target Hibernate Annotations or EntityManager 3.2.x (embedded into JBoss AS 4.2.x and later), you also need to configure the appropriate event listeners.
fr_fr: Si vous plannifier de cibler Hibernate Annotations ou EntityManager 3.2.x (embarqué dans JBoss AS 4.2.x et suppérieur), vous allez avoir besoin de configurer les écouteurs d'évènement appropriés.
it_it: Se si pensa di usare Hibernate Annotation o EntityManager 3.2.x (incorporato in JBoss AS 4.2.x e successivi), occorre configurare anche gli opportuni event listener.

source: <![CDATA[<persistence-unit name="sample"> <jta-data-source>java:/DefaultDS</jta-data-source> <properties> [...] <!-- use a file system based index --> <property name="hibernate.search.default.directory_provider" value="org.hibernate.search.store.FSDirectoryProvider"/> <!-- directory where the indexes will be stored --> <property name="hibernate.search.default.indexBase" value="/Users/prod/apps/dvdstore/dvdindexes"/> <property name="hibernate.ejb.event.post-insert" value="org.hibernate.search.event.FullTextIndexEventListener"/> <property name="hibernate.ejb.event.post-update" value="org.hibernate.search.event.FullTextIndexEventListener"/> <property name="hibernate.ejb.event.post-delete" value="org.hibernate.search.event.FullTextIndexEventListener"/> </properties> </persistence-unit>]]>
it_it: <![CDATA[<persistence-unit name="sample"> <jta-data-source>java:/DefaultDS</jta-data-source> <properties> [...] <!-- utilizza un file system basato su indice --> <property name="hibernate.search.default.directory_provider" value="org.hibernate.search.store.FSDirectoryProvider"/> <!-- directory in cui gli indici verranno memorizzati --> <property name="hibernate.search.default.indexBase" value="/Users/prod/apps/dvdstore/dvdindexes"/> <property name="hibernate.ejb.event.post-insert" value="org.hibernate.search.event.FullTextIndexEventListener"/> <property name="hibernate.ejb.event.post-update" value="org.hibernate.search.event.FullTextIndexEventListener"/> <property name="hibernate.ejb.event.post-delete" value="org.hibernate.search.event.FullTextIndexEventListener"/> </properties> </persistence-unit>]]>

source: It is not longer necessary the register the event listeners if Hibernate Annotations or EntityManager 3.3.x are used. When using Hibernate Search 3.1.x more eventlisteners are needed, but these are registered automatically by Hibernate Annotations; refer to the Hibernate Search reference for configuring it without EntityManager and Annotations.
fr_fr: Il n'est plus nécéssaire d'enregistrer les écouteurs d'évènements si Hibernate Annotations ou EntityManager 3.3.x sont utilisés. Quand on utilise Hibernate Search 3.1.x quelques écouteurs d'évènements sont nécéssaire, mais ils sont automatiquement enregistrés par Hibernate Annotations; référeez vous au guide d'Hibernate Search pour sa configuration sans EntityManager et les Annotations.
it_it: Non è più necessario registrare l'event listener se vengono usati Hibernate Annotations o EntityManager 3.3.x. Quando viene usato Hibernate Search 3.1.x sono necessari più event listener, ma questi vengono registrati automaticamente da Hibernate Annotations; si faccia riferimento al manuale Hibernate Search per configurarlo senza EntityManager e Annotations.

source: In addition to the configuration file, the following jars have to be deployed:
fr_fr: En plus du fichier de configuration, les jars suivants doivent être déployés:
it_it: In aggiunta al file di configurazione, devono essere deployati i seguenti jar:

source: If you deploy those in a EAR, don't forget to update <filename>application.xml</filename>
fr_fr: Si vous déployez ceux là dans un EAR, n'oubliez pas de mettre à jours <filename>application.xml</filename>
it_it: Se vengono messi in un EAR, non si dimentichi di aggiornare <filename>application.xml</filename>

source: Usage
fr_fr: Utilisation
it_it: Utilizzo

source: Hibernate Search uses annotations to map entities to a Lucene index, check the <ulink url="http://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/">reference documentation</ulink> for more informations.
fr_fr: Hibernate Search utlise les annotations pour faire correspondre les entités à l'index de Lucene, vérifiez <ulink url="http://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/">la documentation de référence </ulink> pour plus d'informations.
it_it: Hibernate Search impiega annotazioni per mappare le entità ad un indice di Lucene, per maggiori informazioni si guardi alla <ulink url="http://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/">documentazione di riferimento</ulink>.

source: Hibernate Search is fully integrated with the API and semantic of JPA / Hibernate. Switching from a HQL or Criteria based query requires just a few lines of code. The main API the application interacts with is the <classname>FullTextSession</classname> API (subclass of Hibernate's <classname>Session</classname>).
fr_fr: Hibernate Search est pleinement intégré avec les API et la sémentique JPA / Hibernate. Le basculement des requêtes HQL ou Criteria nécéssite juste quelques lignes de codes. L'API principale à intéragir avec est l'API <classname>FullTextSession</classname> (sousclasse de <classname>Session</classname> d'Hibernate ).
it_it: Hibernate Search è pienamente integrato con la API e la semantica di JPA/Hibernate. Passare da una query basata su HQL o Criteria richiede solo poche linee di codice. La principale API con cui l'applicazione interagisce è l'API <classname>FullTextSession</classname> (sottoclasse della <classname>Session</classname> di Hibernate).

source: When Hibernate Search is present, JBoss Seam injects a <classname>FullTextSession</classname>.
fr_fr: Quand Hibernate Search est présent, JBoss Seam injecte un <classname>FullTextSession</classname>.
it_it: Quando Hibernate Search è presente, JBoss Seam inietta una <classname>FullTextSession</classname>.

source: <classname>FullTextSession</classname> extends <classname>org.hibernate.Session</classname> so that it can be used as a regular Hibernate Session
fr_fr: <classname>FullTextSession</classname> étend <classname>org.hibernate.Session</classname> ainsi il peut être utilisé avec une Hibernate Session habituelle
it_it: <classname>FullTextSession</classname> estende <classname>org.hibernate.Session</classname> così che può essere usata come una regolare Hibernate Session.

source: If the Java Persistence API is used, a smoother integration is proposed.
fr_fr: Si l'API de Persistence de Java est utilisée, une intégration en douceur est proposée.
it_it: Se viene usata la Java Persistence API, è proposta un'integrazione più lieve.

source: When Hibernate Search is present, a <classname>FulltextEntityManager</classname> is injected. <classname>FullTextEntityManager</classname> extends <classname>EntityManager</classname> with search specific methods, the same way <classname>FullTextSession</classname> extends <classname>Session</classname>.
fr_fr: Quand Hibernate Search est présent, un <classname>FulltextEntityManager</classname> est injecté. <classname>FullTextEntityManager</classname> étends <classname>EntityManager</classname> avec des méthodes de recherche spécifique, de la même façon que <classname>FullTextSession</classname> étends <classname>Session</classname>.
it_it: Quando Hibernate Search è presente, viene iniettato un <classname>FulltextEntityManager</classname>. <classname>FullTextEntityManager</classname> estende <classname>EntityManager</classname> con metodi specifici di ricerca, allo stesso modo <classname>FullTextSession</classname> estende <classname>Session</classname>.

source: When an EJB 3.0 Session or Message Driven Bean injection is used (i.e. via the @PersistenceContext annotation), it is not possible to replace the <classname>EntityManager</classname> interface by the <classname>FullTextEntityManager</classname> interface in the declaration statement. However, the implementation injected will be a <classname>FullTextEntityManager</classname> implementation: downcasting is then possible.
fr_fr: Quand une Session EJB3.0 ou une injection de Message Driven Bean est utilisé (par exemple via l'annotation @PersistenceContext), il ets possible de remplacer l'interface de <classname>EntityManager</classname> par l'interface de <classname>FullTextEntityManager</classname> dans la partie déclaration. Cependant, l'implémentation injectée sera une implémentation de <classname>FullTextEntityManager</classname>: la conversion est ensuite possible.
it_it: Quando viene impiegata l'iniezione di un session bean EJB3.0 o message driven (cioè tramite l'annotazione @PersistenceContext), non è possibile rimpiazzare l'interfaccia <classname>EntityManager</classname> con l'interfaccia <classname>FullTextEntityManager</classname> nella dichiarazione. Comunque l'implementazione iniettata sarà <classname>FullTextEntityManager</classname>: è quindi possibile il downcasting.

source: For people accustomed to Hibernate Search out of Seam, note that using <methodname>Search.getFullTextSession</methodname> is not necessary.
fr_fr: Pour les personnes abituées à Hibernate Search sans Seam, notez que l'utilisation de <methodname>Search.getFullTextSession</methodname> n'est pas nécéssaire.
it_it: Per persone abituate a Hibernate Search fuori da Seam, notate che l'uso di <methodname>Search.getFullTextSession</methodname> non è necessario.

source: Check the DVDStore or the blog examples of the JBoss Seam distribution for a concrete use of Hibernate Search.
fr_fr: Voyez le DVDStore dans les exemples de blog de la distribution de JBoss Seam pour une utilisation concrète de Hibernate Search.
it_it: Controlla gli esempi DVDStore o Blog della distribuzione di JBoss Seam per un uso pratico di Hibernate Search.
