Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/I18n.po
Languages: fr_fr, it_it, ja_jp

source: Internationalization, localization and themes
fr_fr: Internationnalisation, les langues locales et les thèmes
it_it: Internazionalizzazione, localizzazione e temi
ja_jp: 国際化と地域化およびテーマ

source: Seam makes it easy to build internationalized applications. First, let's walk through all the stages needed to internationalize and localize your app. Then we'll take a look at the components Seam bundles.
fr_fr: Seam rend facile la construction d'applications internationnalisées? En premier, regardons toutes les étapes nécéssaires pour internationnaliser et rendre avec une langue locale votre application. Ensuite nous allons regarde les composants livrés dans Seam.
it_it: Seam rende facile la costruzione di applicazioni internazionali. Prima di tutto verranno percorse le varie fasi necessarie per rendere internazionale e tradotta un'applicazione. In seguito si darà un'occhiata al modo in cui Seam gestisce i gruppi di stringhe associate ai componenti (resource bundle).
ja_jp: Seam では容易に国際化されたアプリケーションを作成できます。 まず、 アプリケーションの国際化および地域化に必要とされるすべての段階について見ていきます。 そのあと Seam が同梱するコンポーネントの説明をします。

source: Internationalizing your app
fr_fr: Internationnalisation de votre application.
it_it: Internazionalizzare un'applicazione
ja_jp: アプリケーションを国際化する

source: A JEE application consists of many components and all of them must be configured properly for your application to be localized.
fr_fr: Une application JEE consisten en plusieurs composants et tous doivent être configurés de manière appropriés pour que votre application soit traduisible.
it_it: Un'applicazione JEE consiste di molti componenti ed ognuno di essi deve essere configurato opportunamente affinché l'applicazione venga tradotta.
ja_jp: JEE アプリケーションは数多くのコンポーネントから構成され、 それらのコンポーネントすべてがローカライズを行うアプリケーションに対して正しく設定されていなければなりません。

source: Starting at the bottom, the first step is to ensure that your database server and client is using the correct character encoding for your locale. Normally you'll want to use UTF-8. How to do this is outside the scope of this tutorial.
fr_fr: En partant du bas, la première étape est de s'assrer que le serveur de base de données et le client utilise le bon encodage de caractères pour votre langue. Normallement, vous devriez vouloir utiliser UTF-8. Comment faire cela est hors de porté de ce tutorial.
it_it: Partendo dalla base, il primo passo è assicurarsi che il server e il client del database utilizzino la codifica di caratteri corretta per la traduzione. Di solito si vorrà utilizzare UTF-8. Come fare questo non è oggetto di questa guida.
ja_jp: 最初から始めることにします。 1 番目の手順としてデータベースのサーバーとクライアントが使用するロケールに対応する正しい文字エンコーディングを使用していることを確認します。 UTF-8 を使用するのが全般的には多くなります。 この方法については本チュートリアルの範囲外となります。

source: Application server configuration
fr_fr: La configuration du serveur d'application
it_it: Configurazione dell'application server
ja_jp: アプリケーションサーバーの設定

source: To ensure that the application server receives the request parameters in the correct encoding from client requests you have to configure the tomcat connector. If you use Tomcat or JBoss AS, add the <literal>URIEncoding="UTF-8"</literal> attribute to the connector configuration. For JBoss AS 4.2 change <literal>${JBOSS_HOME}/server/(default)/deploy/jboss-web.deployer/server.xml</literal>:
fr_fr: Pour s'assurer que le serveur d'application reçoit les paramètres dans l'encodage correct depuis les requêtes client, vous devez configurer le connecteur de tomcat. Si vous utilisez Tomcat ou JBoss AS, ajoutez l'attribut <literal>URIEncoding="UTF-8"</literal> à la configuration du connecteur. Pour JBoss AS 4.2, modifiez <literal>${JBOSS_HOME}/server/(default)/deploy/jboss-web.deployer/server.xml</literal>:
it_it: Per essere sicuri che l'application server riceva i parametri delle richieste dai client nella codifica corretta occorre configurare il connettore Tomcat. Se si usa Tomcat o JBoss AS, aggiungere l'attributo <literal>URIEncoding="UTF-8"</literal> alla configurazione del connettore. Per JBoss AS 4.2 modificare <literal>${JBOSS_HOME}/server/(default)/deploy/jboss-web.deployer/server.xml</literal>:
ja_jp: アプリケーションサーバーが要求パラメータを正しいエンコーディングでクライアントの要求から受け取るようにするには、 tomcat コネクタを設定する必要があります。 Tomcat または JBoss AS を使用する場合は <literal>URIEncoding="UTF-8"</literal> 属性をコネクタの設定に追加します。 JBoss AS 4.2 なら <literal>${JBOSS_HOME}/server/(default)/deploy/jboss-web.deployer/server.xml</literal> を変更します。

source: There is alternative which is probably better. You can tell JBoss AS that the encoding for the request parameters will be taken from the request:
fr_fr: Il ya une alternative qui est probablement meilleure. Vous pouvez dire à JBoss AS que l'encodage des paramètres des requeêtes sera prit depuis la requête:
it_it: C'è un'alternativa che è probabilmente migliore. E' possibile dire a JBoss AS che la codifica dei parametri della richiesta deve essere ricavata dalla richiesta:
ja_jp: 別の方法もあり、 こちらの方がよいでしょう。 JBoss AS に要求パラメータのエンコーディングはその要求から取得されることを指示することができます。

source: Translated application strings
fr_fr: Les chaines de caractères de l'application traduites
it_it: Traduzione delle stringhe dell'applicazione
ja_jp: 翻訳されたアプリケーション文字列

source: You'll also need localized strings for all the <emphasis>messages</emphasis> in your application (for example field labels on your views). First you need to ensure that your resource bundle is encoded using the desired character encoding. By default ASCII is used. Although ASCII is enough for many languages, it doesn't provide characters for all languages.
fr_fr: Vous allez avoir besoin des chaines de caractères traduites pour tous les <emphasis>messages</emphasis> de votre applicatin (par exemple les labels des champsd e vos vues). En premier, vous alleza avoir besoin de vous assurer que vos fiches de ressources sont encodés avec l'encodage désiré. Par défaut, l'ASCII est utilisé. Mais l'ASCII n'est pas suffisant pour beaucoups de langues, il ne fourni pas toutes les lettres de tous les langages.
it_it: Ci sarà bisogno di tradurre le stringhe per tutti i <emphasis>messaggi</emphasis> dell'applicazione (per esempio le etichette dei campi nelle pagine). In primo luogo occorre assicurarsi che il resource bundle sia codificato utilizzando la giusta codifica di carattere. Per default viene usato ASCII. Benché la codifica ASCII sia sufficiente per molte lingue, essa non fornisce i caratteri per tutte le lingue.
ja_jp: アプリケーションのすべての <emphasis>メッセージ</emphasis> にも翻訳された文字列が必要となります (例、 ビューのフィールドラベルなど)。 まず、 リソースバンドルが目的の文字エンコーディングを使ってコード化されることを確認する必要があります。 デフォルトでは ASCII が使用されます。 ASCII は多くの言語に十分対応しますが、 すべての言語の文字を提供しているわけではありません。

source: Resource bundles must be created in ASCII, or use Unicode escape codes to represent Unicode characters. Since you don't compile a property file to byte code, there is no way to tell the JVM which character set to use. So you must use either ASCII characters or escape characters not in the ASCII character set. You can represent a Unicode character in any Java file using \uXXXX, where XXXX is the hexidecimal representation of the character.
fr_fr: Les fichiers de ressource doivent être créés en ASCII ou utiliser le code déspécialisé Unicode pour représenter les lettres Unicode. Sinon vous ne pourez pas compiler le fichier de propriété dans le byte-code, il n'y a pas de moyen pour indiquer à la JVM quel groupe de caractères utiliser. Donc vous devez utiliser soit les caractères ASCII soi des caractères déspécialisés qui ne sont pas dans le groupe des caractères de l'ASCII. Vous pouvez représenter un caractère Unicode dans le fichier en Java en utilisant \uXXX, où XXX est la représentation hexadécimale de ce caractère.
it_it: I resource bundles devono essere creati in ASCII, oppure devono utilizzare una notazione Unicode per rappresentare i caratteri Unicode. Poiché un file <literal>.properties</literal> non viene compilato in byte-code, non c'è modo di dire alla JVM quale codifica caratteri utilizzare. Perciò occorre usare caratteri ASCII oppure usare la notazione Unicode per i caratteri che non fanno parte dell'insieme ASCII. E' possibile rappresentare un carattere Unicode in un file Java usando la notazione \uXXXX, dove XXXX è la rappresentazione esadecimale del carattere.
ja_jp: リソースバンドルは ASCII で作成されなければなりません。 あるいは Unicode 文字の表示に Unicode エスケープのコードを使用します。 バイトコードに対してプロパティファイルをコンパイルしないため使用にセットする文字を JVM に伝える方法がありません。 このため、 ASCII 文字または ASCII 文字にはないエスケープ文字を使用しなければなりません。 \uXXXX を使用するといずれの Java ファイルでも Unicode 文字を表すことができます。 XXXX はその文字を表す 16 進数です。

source: You can write your translation of labels (<xref linkend="labels"/>) to your messages resource bundle in the native encoding and then convert the content of the file into the escaped format through the tool <literal>native2ascii</literal> provided in the JDK. This tool will convert a file written in your native encoding to one that represents non-ASCII characters as Unicode escape sequences.
fr_fr: Vous pouvez écrire votre traductions des labels (<xref linkend="labels"/>) dans vos fichiers de ressource dans l'encodage natif et ensuite la conversation du fichier dans le format déspécialisé avec l'outil <literal>native2ascii</literal> fourni dans le JDK. Cet outil va convertir un fichier écrit dans votre encodage natif dans un nouveau où la représentation des caractères non-ASCII sera en séquence déspécialisé Unicode.
it_it: E' possibile scrivere la traduzione delle etichette (<xref linkend="labels"/>) nei resource bundles con la codifica del proprio sistema e poi convertire il contenuto del file nel formato con le notazioni Unicode attraverso lo strumento <literal>native2ascii</literal> fornito con JDK. Questo strumento converte un file scritto nella codifica originale in uno dove i caratteri non-ASCII sono rappresentati come sequenze di notazioni Unicode.

source: Usage of this tool is described <ulink url="http://java.sun.com/j2se/1.5.0/docs/tooldocs/index.html#intl">here for Java 5</ulink> or <ulink url="http://java.sun.com/javase/6/docs/technotes/tools/#intl">here for Java 6</ulink>. For example, to convert a file from UTF-8:
fr_fr: L'utilisation de cet outil est décrit dans <ulink url="http://java.sun.com/j2se/1.5.0/docs/tooldocs/index.html#intl">ici pour Java 5</ulink> ou <ulink url="http://java.sun.com/javase/6/docs/technotes/tools/#intl">ici pour Java 6</ulink>. Par exemple, pour convertir un fichier depuis UTF-8:
it_it: L'uso di questo strumento è descritto <ulink url="http://java.sun.com/j2se/1.5.0/docs/tooldocs/index.html#intl">qui per Java 5</ulink> oppure <ulink url="http://java.sun.com/javase/6/docs/technotes/tools/#intl">qui per Java 6</ulink>. Ad esempio, per convertire un file da UTF-8:
ja_jp: このツールの使い方は <ulink url="http://java.sun.com/j2se/1.5.0/docs/tooldocs/index.html#intl">Java 5 の場合はここ</ulink> または <ulink url="http://java.sun.com/javase/6/docs/technotes/tools/#intl">Java 6 の場合はここ</ulink> に記載されています。 たとえば、 あるファイルを UTF-8 から変換するには次のようにします。

source: Other encoding settings
fr_fr: D'autres réglages pour l'encodage
it_it: Altre impostazioni per la codifica
ja_jp: その他のエンコーディング設定

source: We need to make sure that the view displays your localized data and messages using the correct character set and also any data submitted uses the correct encoding.
fr_fr: Soyez sur que les vues affichant vos informations localisées et les message utilisent le bon groupe de caractères et aussi que toute donnée soumise utilise le bon encodage.
it_it: Occorre essere sicuri che le pagine mostrino i dati tradotti e i messaggi utilizzando il corretto insieme di caratteri e che anche i dati inviati usino usino la codifica corretta.
ja_jp: 正しい文字セットを使ってローカライズされたデータとメッセージが表示されること、 そしてサブミットされるデータがすべて正しいエンコーディングを使用することを確認する必要があります。

source: To set the display character encoding, you need to use the <literal>&lt;f:view locale="cs_CZ"/&gt;</literal> tag (here we tell JSF to use the Czech locale). You may want to change the encoding of the xml document itself if you want to embed localized strings in the xml. To do this alter the encoding attribute in xml declaration <literal>&lt;?xml version="1.0" encoding="UTF-8"?&gt;</literal> as required.
fr_fr: Pour définir l'encodage de caractère à afficher, vous devez utiliser la balise <literal>&lt;f:view locale="cs_CZ"/&gt;</literal> (ici pour dire à JSF d'utiliser la langue Tchèque). Vous pouvez vouloir modifier l'encodage du document xml lui-même si vous voulez embarqué des chaines de caractères localisées en xml. Pour faire cela, modifiez l'attriut d'encodage dans la déclaration xml <literal>&lt;?xml version="1.0" encoding="UTF-8"?&gt;</literal> selon le besoin.
it_it: Per impostare la codifica dei caratteri per le pagine occorre utilizzare la tag <literal>&lt;f:view locale="cs_CZ"/&gt;</literal> (in questo modo diciamo a JSF di usare il locale Ceco). Si può voler modificare la codifica del documento XML stesso se si vuole includere stringhe tradotte all'interno dell'XML. Per fare questo occorre modificare l'attributo encoding nella dichiarazione XML <literal>&lt;xml version="1.0" encoding="UTF-8"&gt;</literal> con il valore desiderato.
ja_jp: 表示文字のエンコーディングを設定するには <literal>&lt;f:view locale="cs_CZ"/&gt;</literal> タグを使用する必要があります (ここでは JSF にチェコ語を使用するよう指示している)。 xml にローカライズされた文字列を埋め込む場合は xml ドキュメント自体のエンコーディングを変更したいことがあります。 これを行うには xml 宣言の <literal>&lt;?xml version="1.0" encoding="UTF-8"?&gt;</literal> で必要に応じてエンコーディング属性を変更します。

source: Also JSF/Facelets should submit any requests using the specified character encoding, but to make sure any requests that don't specify an encoding you can force the request encoding using a servlet filter. Configure this in <literal>components.xml</literal>:
fr_fr: De plus JSF/Facelets devrait soumettre toutes les requêtes en utilisant l'encodage de caractères spécifié, mais pour êtrer sur que toutes les requêtes ne vont pas indiquer un encodage vous pouvez obliger l'encodage de la requête en utilisant un filtre servlet. Vous configurez cela dans <literal>components.xml</literal>:
it_it: Anche JSF/Facelets dovrebbe inviare tutte le richieste utilizzando la codifica caratteri specificata, ma per essere sicuri che tutte le richieste che non specificano un valore di codifica abbiamo il valore corretto è possibile forzare la codifica delle richieste utilizzando un filtro Servlet. Questo si configura in <literal>components.xml</literal>:
ja_jp: また、 JSF や Facelet は指定文字エンコーディングを使った要求をサブミットするはずですが、 エンコーディングを指定していない場合は強制的にサーブレットフィルタを使うようにすることができます。 <literal>components.xml</literal> で設定します。

source: Locales
fr_fr: Les locales
it_it: Traduzioni
ja_jp: ロケール

source: Each user login session has an associated instance of <literal>java.util.Locale</literal> (available to the application as a component named <literal>locale</literal>). Under normal circumstances, you won't need to do any special configuration to set the locale. Seam just delegates to JSF to determine the active locale:
fr_fr: Chaque session de connection de l'utilisateur est associé avec une instance de <literal>java.util.Locale</literal> (disponible dans l'application comme un composant appelé <literal>locale</literal>). Dans les circonstances normales, vous n'avez pas besoin de définir la locale. Seam va simplement déléguer à JSF le fait de déterminer la locale active:
it_it: Ogni sessione utente registrata ha associata un'istanza di <literal>java.util.Locale</literal> (disponibile nell'applicazione come un componente chiamato <literal>locale</literal>). In condizioni normali non sarà necessario fare alcuna configurazione particolare per impostare la lingua. Seam delega a JSF il compito di determinare la lingua attiva:
ja_jp: 各ユーザーログインのセッションは、 <literal>java.util.Locale</literal> インスタンスと関連しています (アプリケーションでは、 <literal>locale</literal> という名前のコンポーネントとして扱えます)。 通常の環境では、 ロケールのための特別な設定は不要です。 Seam ではアクティブなロケールの決定は単純に JSF に委譲しています。

source: If there is a locale associated with the HTTP request (the browser locale), and that locale is in the list of supported locales from <literal>faces-config.xml</literal>, use that locale for the rest of the session.
fr_fr: S'il ya une langague associée avec la requête HTTP (la langue du navigateur), et que la langue est dans la liste des langues supportées dans le <literal>faces-config.xml</literal>, utilisez cette langue pour le reste de la session.
it_it: Se c'è un linguaggio associato con la richiesta HTTP (il linguaggio del browser), e questo linguaggio è presente nella lista delle lingue gestite in <literal>faces-config.xml</literal>, allora questa lingua verrà usata per il resto della sessione.
ja_jp: HTTP 要求で指定されるロケール (ブラウザのロケール) があり、 そして、 <literal>faces-config.xml</literal> により対応可能なロケールの組み合わせの中にそのロケールがある場合、 その後のセッションの期間、そのロケールを使用します。

source: Otherwise, if a default locale was specified in the <literal>faces-config.xml</literal>, use that locale for the rest of the session.
fr_fr: Cependant, si la langue a été spécifiée dans le <literal>faces-config.xml</literal>, alors utilise cette langue pour le reste de la session.
it_it: Altrimenti, se in <literal>faces-config.xml</literal> è specificata una lingua di default, questa lingua verrà usata per il resto della sessione.
ja_jp: それ以外で、デフォルトロケールが <literal>faces-config.xml</literal> 中に指定されていれば、 その後のセッションの期間、そのロケールを使用します。

source: Otherwise, use the default locale of the server.
fr_fr: Sinon, utilise la locale par défaut du serveur.
it_it: Altrimenti viene usata la lingua di default del server.
ja_jp: それ以外では、サーバのデフォルトロケールを使用します。

source: It is <emphasis>possible</emphasis> to set the locale manually via the Seam configuration properties <literal> org.jboss.seam.international.localeSelector.language</literal>, <literal> org.jboss.seam.international.localeSelector.country</literal> and <literal> org.jboss.seam.international.localeSelector.variant</literal>, but we can't think of any good reason to ever do this.
fr_fr: C'est <emphasis>possible</emphasis> de définir la langue manuellement via les propriétés de configuration de Seam <literal> org.jboss.seam.international.localeSelector.language</literal>, <literal> org.jboss.seam.international.localeSelector.country</literal> et <literal> org.jboss.seam.international.localeSelector.variant</literal>, mais nous n'avons pas trouver de bonne raison d'avoir à faire cela.
it_it: E' <emphasis>possibile</emphasis> impostare la lingua manualmente tramite le proprietà di configurazione di Seam <literal>org.jboss.seam.international.localeSelector.language</literal>, <literal>org.jboss.seam.international.localeSelector.country</literal> e <literal>org.jboss.seam.internationale.localeSelector.variant</literal>, ma non c'è una vera buona ragione per farlo.
ja_jp: Seam 設定プロパティの <literal>org.jboss.seam.international.localeSelector.language</literal>、 <literal>org.jboss.seam.international.localeSelector.country</literal> そして <literal>org.jboss.seam.international.localeSelector.variant</literal> によりマニュアルでのロケール設定が <emphasis>可能</emphasis> ですが、 これを行う妥当な理由は考え付きません。

source: It is, however, useful to allow the user to set the locale manually via the application user interface. Seam provides built-in functionality for overriding the locale determined by the algorithm above. All you have to do is add the following fragment to a form in your JSP or Facelets page:
fr_fr: C'est, cependant, utile de permettre à l'utilisateur de définir sa langue manuellement via un interface utilisateur de l'application. Seam fourni une fonctionnalité livrée pour remplacer la langue déterminée par l'algorithme ci-dessus. Tout ce que vous avez à faire est d'ajouter le fragment suivant dans un formulaire de votre page JSP ou Facelets:
it_it: E' comunque utile consentire all'utente di impostare la lingua manualmente tramite l'interfaccia utente. Seam fornisce una funzionalità per sovrascrivere il linguaggio determinato dall'algoritmo descritto sopra. Tutto ciò che è necessario fare è aggiungere il seguente brano ad una form in una pagina JSP o Facelets:
ja_jp: しかし、アプリケーションユーザーインタフェースを通じて、 ユーザーにマニュアルでロケール設定を可能とさせることは有用です。 Seam は上記のアルゴリズムによって決定されるロケールをオーバライドする組み込み機能も提供しています。 すべきことは、JSP または、Facelet ページのフォームに以下の断片を追加するだけです。

source: &lt;h:selectOneMenu value="#{localeSelector.language}"&gt; &lt;f:selectItem itemLabel="English" itemValue="en"/&gt; &lt;f:selectItem itemLabel="Deutsch" itemValue="de"/&gt; &lt;f:selectItem itemLabel="Francais" itemValue="fr"/&gt; &lt;/h:selectOneMenu&gt; &lt;h:commandButton action="#{localeSelector.select}" value="#{messages['ChangeLanguage']}"/&gt;
it_it: &lt;h:selectOneMenu value="#{localeSelector.language}"&gt; &lt;f:selectItem itemLabel="English" itemValue="en"/&gt; &lt;f:selectItem itemLabel="Deutsch" itemValue="de"/&gt; &lt;f:selectItem itemLabel="Francais" itemValue="fr"/&gt; &lt;f:selectItem itemLabel="Italiano" itemValue="it"/&gt; &lt;/h:selectOneMenu&gt; &lt;h:commandButton action="#{localeSelector.select}" value="#{messages['ChangeLanguage']}"/&gt;

source: Or, if you want a list of all supported locales from <literal> faces-config.xml</literal>, just use:
fr_fr: Ou si vous voulez une liste de toutes les langues supportées depuis <literal> faces-config.xml</literal>, utilisez simplement :
it_it: Oppure, se si vuole mostrare una lista delle lingue gestite da <literal>faces-config.xml</literal>, si può usare:
ja_jp: あるいは、<literal>faces-config.xml</literal> に対応されたすべてのロケールの組み合わせが欲しければ、 以下を使ってください。

source: When the user selects an item from the drop-down, then clicks the command button, the Seam and JSF locales will be overridden for the rest of the session.
fr_fr: Quand l'utilisateur sélectionne un élément depuis cette liste, ensuite il clique sur le bouton de commande, alors les lagues de Seam et de JSF vont être remplacées pour le reste de la session.
it_it: Quando l'utente seleziona una voce dal menu a discesa e poi fa click sul bottone di comando, la lingua di Seam e di JSF viene sovrascritta per il resto della sessione.
ja_jp: ユーザーがドロップダウンからアイテムを選択してコマンドボタンをクリックすると、 その後のセッションに対して Seam と JSF のロケールはオーバライドされます。
