Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/I18n.po
Languages: fr_fr, it_it, ja_jp

source: Just like the locale selector, there is a built-in theme selector to allow the user to freely switch themes:
fr_fr: Toute comme le sélectioneur de langue, il y a un sélectionneur de thème livré qui permet à l'utilisateur de librement basculer entre les thèmes:
it_it: Così come per selezionare la lingua, c'è un componente che consente all'utente di cambiare liberamente il tema:
ja_jp: ちょうどロケールセレクタのように、 ユーザーが自由にテーマを変更できるよう、組み込みのテーマセレクタがあります。

source: Persisting locale and theme preferences via cookies
fr_fr: La préservation des préférences de langue et de thème via des cookies
it_it: Registrare la scelta della lingua e del tema tramite cookies
ja_jp: ロケールとテーマ設定のクッキーによる永続化

source: The locale selector, theme selector and timezone selector all support persistence of locale and theme preference to a cookie. Simply set the <literal>cookie-enabled</literal> property in <literal>components.xml</literal>:
fr_fr: Le sélectionneur de langue, le sélectionneur de thème et le sélectionneur de fuseau horaire supportent tous la persistance de la rpéférence vers un cookie. En simplement définissant la propriété <literal>cookie-enabled</literal> dans <literal>components.xml</literal>:
it_it: Le selezioni della lingua, del tema e del fuso orario gestiscono tutte la registrazione della scelta in un cookie. Basta impostare la proprietà <literal>cookie-enabled</literal> in <literal>components.xml</literal>:
ja_jp: ロケールセレクタ、テーマセレクタ、タイムゾーンセレクタはすべて、 ロケールとテーマ設定をクッキーに永続化することをサポートしています。 単純に <literal>components.xml</literal> で <literal>cookie-enabled</literal> プロパティを設定します。
