Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/I18n.po
Languages: fr_fr, it_it, ja_jp

source: The brings us to the question of where the supported locales are defined. Typically, you provide a list of locales for which you have matching resource bundles in the <literal>&lt;locale-config&gt;</literal> element of the JSF configuration file (/META-INF/faces-config.xml). However, you have learned to appreciate that Seam's component configuration mechanism is more powerful than what is provided in Java EE. For that reason, you can configure the supported locales, and the default locale of the server, using the built-in component named <literal>org.jboss.seam.international.localeConfig</literal>. To use it, you first declare an XML namespace for Seam's international package in the Seam component descriptor. You then define the default locale and supported locales as follows:
fr_fr: Pour répondre à la question à quel endroit les langues sont-elle définies. Typiquement, vous fournissez une liste de langues pour lesquelles vous avez un fichiers de ressources correspondant dans l'élément <literal>&lt;locale-config&gt;</literal> de fichier de configuration JSF (/META-INF/faces-config.xml). Cependant, vous avez appris à apprécier le mechanisme de configuration des composants de Seam qui est plus psuissant que celui fourni dans Java EE. Pour cette raison, vous pouvez configurer les langues supportées, et une langue par défaut sur le serveur, en utilisant le composant livré dénommé <literal>org.jboss.seam.international.localeConfig</literal>. Pour l'utiliser, vous déclarer en premier un espace de nommage XML pour le paquet international de Seam dans le descripteur du composant de Seam. Vous définissez ensuite une langue par défaut et les langues supportées comme ci-dessous:
it_it: Tutto ciò porta a domandarsi dove siano definite le lingue gestite. Tipicamente nell'elemento <literal>&lt;locale-config&gt;</literal> del file di configurazione JSF (/META-INF/faces-config.xml) si indica una lista di lingue per le quali si dispone dei corrispondenti resource bundle. Ad ogni modo si è imparato ad apprezzare che il meccanismo di configurazione dei componenti Seam è più completo di quello fornito in Java EE. Per questa ragione è possibile configurare le lingue gestite e la lingua di default del server usando il componente <literal>org.jboss.seam.international.localeConfig</literal>. Per usarlo occorre prima dichiarare il namespace XML per il pacchetto international di Seam nel descrittore dei componenti Seam, quindi definire la lingua di default e le lingue gestite come segue:
ja_jp: これにより対応ロケールはどこで定義するのだろうかという疑問が湧いてきます。 一般的には JSF 設定ファイル (/META-INF/faces-config.xml) の <literal>&lt;locale-config&gt;</literal> エレメントでリソースバンドルに一致するロケール一覧を与えます。 ただし、 Seam のコンポーネント設定のメカニズムは Java EE 提供のそれよりずっとパワフルであることを学んできました。 こうした理由から <literal>org.jboss.seam.international.localeConfig</literal> という名前の組み込みコンポーネントを使用して対応ロケールおよびサーバーのデフォルトロケールを設定することができます。 これを使うにはまず Seam コンポーネント記述子で Seam の国際パッケージ用の XML 名前空間を宣言します。 次にデフォルトのロケールと対応ロケールを次のように定義します。

source: &lt;international:locale-config default-locale="fr_CA" supported-locales="en fr_CA fr_FR"/&gt;
it_it: &lt;international:locale-config default-locale="fr_CA" supported-locales="en fr_CA fr_FR it_IT"/&gt;

source: Naturally, if you pronounce that you support a locale, you better provide a resource bundle to match it! Up next, you'll learn how to define the language-specific labels.
fr_fr: Naturellement, si vous déclarrez que vous supporté une langue, vous devriez fournir un fichier de ressource qui lui correspond! Ensuite, vous allez apprendre comment définir des labels spécifiques aux langues.
it_it: Ovviamente se c'è la dichiarazione che una certa lingua è gestita, sarà meglio fornire il resource bundle corrispondente! Nel prossimo capitolo si imparerà come si definiscono le etichette per una lingua specifica.
ja_jp: 必然的にロケールをサポートすることを宣言する場合、 一致するリソースバンドルを与えた方がよいでしょう。 次は言語固有のラベルの定義方法について説明します。

source: Labels
fr_fr: Les labels
it_it: Etichette
ja_jp: ラベル

source: JSF supports internationalization of user interface labels and descriptive text via the use of <literal>&lt;f:loadBundle /&gt;</literal>. You can use this approach in Seam applications. Alternatively, you can take advantage of the Seam <literal> messages</literal> component to display templated labels with embedded EL expressions.
fr_fr: JSF permet une internationnalisation des labels des interfaces utilisateurs et des texte descriptif via l'utilisation de <literal>&lt;f:loadBundle /&gt;</literal>. Vous pouvez utilisez cette approche dans les application Seam. Au alternative, vous pouvez profiter du composant <literal> messages</literal> de Seam pour afficher les labels modèles avec les expressions EL embarquées.
it_it: JSF gestisce l'internazionalizzazione delle etichette e del testo descrittivo nell'interfaccia utente tramite l'uso di <literal>&lf;f:loadBundle&gt;</literal>. Questo approccio è possibile nelle applicazioni Seam. In alternativa è possibile sfruttare i vantaggi offerti dal componente Seam <literal>messages</literal> per mostrare label costruite tramite modelli con espressioni EL.
ja_jp: JSF は、ユーザーインタフェースのラベルや説明用テキストの国際化を、 <literal>&lt;f:loadBundle /&gt;</literal> を使用することによって対応しています。 Seam アプリケーションでもこのアプローチが使用可能です。 代わりに、組み込みの EL 式を利用したテンプレート化ラベルの表示に、 Seam <literal> messages</literal> コンポーネントを利用することも可能です。

source: Defining labels
fr_fr: La définition des labels
it_it: Definire le etichette
ja_jp: ラベルを定義する

source: Seam provides a <literal>java.util.ResourceBundle</literal> (available to the application as a <literal> org.jboss.seam.core.resourceBundle</literal>). You'll need to make your internationalized labels available via this special resource bundle. By default, the resource bundle used by Seam is named <literal>messages</literal> and so you'll need to define your labels in files named <literal> messages.properties</literal>, <literal> messages_en.properties</literal>, <literal> messages_en_AU.properties</literal>, etc. These files usually belong in the <literal>WEB-INF/classes</literal> directory.
fr_fr: Seam fourni un<literal>java.util.ResourceBundle</literal> (disponible pour l'application comme un <literal> org.jboss.seam.core.resourceBundle</literal>). Vous allez avoir besoin de rendre les labels à internationnaliser disponible via ce fichier de ressource spécial. Par défaut, le fichier de ressource utilisé par Seam est appelé <literal>messages</literal> et donc vous allez avoir besoin de définir vos labels dans des fichiers appelés <literal> messages.properties</literal>, <literal> messages_en.properties</literal>, <literal> messages_en_AU.properties</literal>, etc. Ces fichiers vont habituellement dans le dossier <literal>WEB-INF/classes</literal>.
it_it: Seam fornisce un <literal>java.util.ResourceBundle</literal> (disponibile all'applicazione come un <literal>org.jboss.seam.core.resourceBundle</literal>). Occorre rendere disponibili le nostre etichette tradotte tramite questo speciale resource bundle. Per default il resource bundle usato da Seam si chiama <literal>messages</literal> così che occorre definire le etichette in file chiamati <literal>messages.properties</literal>, <literal>messages_en.properties</literal>, <literal>messages_en_AU.properties</literal>, ecc. Questi file di solito risiedono nella cartella <literal>WEB-INF/classes</literal>.
ja_jp: Seam は <literal>java.util.ResourceBundle</literal> を提供しています (アプリケーションでは <literal>org.jboss.seam.core.resourceBundle</literal> として利用可能)。 この特殊リソースバンドルを通じて国際化されたラベルを使用可能にする必要があります。 デフォルトでは、 Seam で使用されるリソースバンドルは <literal>messages</literal> の名称なので <literal>messages.properties</literal>、 <literal>messages_en.properties</literal>、 <literal>messages_en_AU.properties</literal> などの名称のファイルにラベルを定義する必要があります。 これらのファイルは通常 <literal>WEB-INF/classes</literal> ディレクトリに属します。

source: So, in <literal>messages_en.properties</literal>:
fr_fr: Ainsi, dans <literal>messages_en.properties</literal>:
it_it: Quindi, in <literal>messages_en.properties</literal>:
ja_jp: 従って、<literal>messages_en.properties</literal> では、

source: And in <literal>messages_en_AU.properties</literal>:
fr_fr: Et dans <literal>messages_en_AU.properties</literal>:
it_it: E in <literal>messages_en_AU.properties</literal>:
ja_jp: そして、<literal>messages_en_AU.properties</literal> では、

source: You can select a different name for the resource bundle by setting the Seam configuration property named <literal> org.jboss.seam.core.resourceLoader.bundleNames</literal>. You can even specify a list of resource bundle names to be searched (depth first) for messages.
fr_fr: Vous pouvez sélectionner un nom différent pour le fichier de ressource en définissant dans la propriété de configuration de Seam dénommée <literal> org.jboss.seam.core.resourceLoader.bundleNames</literal>. Vous pouvez même spécifie une liste de fichier de ressources à chercher (premier trouvé, premier servi) pour les messages.
it_it: E' possibile indicare un nome diverso per il resource bundle impostando la proprietà di configurazione Seam <literal>org.jboss.seam.core.resourceLoader.bundleNames</literal>. E' possibile persino specificare un elenco di nomi di resource bundle sui quali devono essere ricercati i messaggi (a partire dall'ultimo).
ja_jp: <literal> org.jboss.seam.core.resourceLoader.bundleNames</literal> と呼ばれる Seam 設定プロパティによって、 リソースバンドルとして異なる名前を選択することが可能です。 リソースバンドル名の一覧を指定してメッセージの検索をさせる (深さ優先) こともできます。

source: If you want to define a message just for a particular page, you can specify it in a resource bundle with the same name as the JSF view id, with the leading <literal>/</literal> and trailing file extension removed. So we could put our message in <literal> welcome/hello_en.properties</literal> if we only needed to display the message on <literal> /welcome/hello.jsp</literal>.
fr_fr: Si vous voulez définir un message juste pour une page particulière, vous pouvez le spécifier dans le fichier de ressource avec le m^me nom que l'identifiant de la vue JSF, avec un <literal>/</literal> devant et en enlevant l'extension du nom de fichier. Ainsi vous pouvez mettre notre message dans <literal> welcome/hello_en.properties</literal> si vous avez seulement besoin d'afficher le message sur <literal> /welcome/hello.jsp</literal>.
it_it: Se si vuole definire un messaggio solo per una particolare pagina, è possibile specificarlo in un resource bundle con lo stesso nome dell'identificativo della view JSF, omettendo il <literal>/</literal> iniziale e l'estensione del file finale. Così è possibile mettere il nostro messaggio in <literal>welcome/hello_en.properties</literal> se si desidera mostrare il messaggio solo in <literal>/welcome/hello.jsp</literal>.
ja_jp: 特定のページだけにメッセージを定義したいのであれば、 そのJSFビューIDと同じ名前でリソースバンドルに指定します。 このときIDの最初の <literal>/</literal> と最後の拡張子を除去します。 つまり <literal>/welcome/hello.jsp</literal> にのみメッセージを表示したいのであれば、 表示させるメッセージを <literal>welcome/hello_en.properties</literal> に配置します。

source: You can even specify an explicit bundle name in <literal> pages.xml</literal>:
fr_fr: Vous pouvez même spécifier un nom de fichier explicite dans <literal> pages.xml</literal>:
it_it: E' anche possibile specificare esplicitamente un nome di resource bundle in <literal>pages.xml</literal>:
ja_jp: <literal>pages.xml</literal> に明示的なバンドル名を指定することもできます。

source: Then we could use messages defined in <literal> HelloMessages.properties</literal> on <literal> /welcome/hello.jsp</literal>.
fr_fr: Ensuite, nous pourions utiliser les messages définie dans <literal> HelloMessages.properties</literal> avec <literal> /welcome/hello.jsp</literal>.
it_it: Quindi possiamo usare i messaggi definiti in <literal>HelloMessages.properties</literal> in <literal>/welcome/hello.jsp</literal>.
ja_jp: これで <literal>HelloMessages.properties</literal> に定義されたメッセージを <literal>/welcome/hello.jsp</literal> で使うことができます。

source: Displaying labels
fr_fr: L'affichage des labels
it_it: Mostrare le etichette
ja_jp: ラベルを表示する

source: If you define your labels using the Seam resource bundle, you'll be able to use them without having to type <literal> &lt;f:loadBundle ... /&gt;</literal> on every page. Instead, you can simply type:
fr_fr: Si vous définissez vos labels en utilisant le fichier de ressource de Seam, vous allez être capable de les utiliser sans avoir à indiquer <literal> &lt;f:loadBundle ... /&gt;</literal> sur chaque page. Au lieu de cela, vous pouvez simplement indiquer:
it_it: Se si definiscono le etichette utilizzando il resource bundle di Seam è possibile usarle senza dover scrivere <literal>&lt;f:loadBundle... /&gt;</literal> in ogni pagina. E' possibile invece scrivere semplicemente:
ja_jp: もし、Seamのリソースバンドルを使ってラベルを定義する場合、 各ページそれぞれに <literal>&lt;f:loadBundle ... /&gt;</literal> を入力しなくてもこれを使用することができます。 代わりに単に以下のように入力します。

source: <para>or:</para>
fr_fr: <para>ou:</para>
it_it: <para>oppure:</para>
ja_jp: <para>または、</para>

source: Even better, the messages themselves may contain EL expressions:
fr_fr: Même mieux, les mesages eux-même peuvent contenir des expressions EL:
it_it: Ancora meglio, i messaggi stessi possono contenere espressioni EL:
ja_jp: さらに良いことに、メッセージそのものには EL 式を含むことも可能です。

source: You can even use the messages in your code:
fr_fr: Vous pouvez même utiliser les messages dans votre code:
it_it: E' possibile anche usare i messaggi nel codice:
ja_jp: コードの中にメッセージを使用することも可能です。

source: Faces messages
fr_fr: Les messages Faces
it_it: Messaggi Faces
ja_jp: Faces メッセージ

source: The <literal>facesMessages</literal> component is a super-convenient way to display success or failure messages to the user. The functionality we just described also works for faces messages:
fr_fr: Le composant <literal>facesMessages</literal> est une façon super-simplifiée d'afficher un message de réussite ou d'echec à l'utilisateur. La fonctionnalité que nous avons juste à l'instant décrit fonctionne aussi avec les messages faces:
it_it: Il componente <literal>facesMessages</literal> è un modo super-conveniente per mostare messaggi di conferma o di errore all'utente. La funzionalità che è stata appena descritta funziona anche per i messaggi faces:
ja_jp: <literal>facesMessages</literal> コンポーネントはユーザーに成功か失敗かを表示するとても便利な方法です。 上述した機能は、faces messages にも有効です。

source: This will display <literal>Hello, Gavin King</literal> or <literal>G'day, Gavin</literal>, depending upon the user's locale.
fr_fr: Cela va afficher <literal>Hello, Gavin King</literal> ou <literal>G'day, Gavin</literal>, selon la locale de l'utilisateur.
it_it: Questo mostrerà <literal>Hello, Gavin King</literal> oppure <literal>G'day, Gavin</literal>, a seconda della lingua dell'utente.
ja_jp: これは、ユーザーのロケールに応じて、<literal>Hello, Gavin King</literal> あるいは、 <literal>G'day, Gavin</literal> と表示されます。

source: Timezones
fr_fr: Les fuseaux horaires
it_it: Fusi orari
ja_jp: タイムゾーン

source: There is also a session-scoped instance of <literal> java.util.Timezone</literal>, named <literal> org.jboss.seam.international.timezone</literal>, and a Seam component for changing the timezone named <literal> org.jboss.seam.international.timezoneSelector</literal>. By default, the timezone is the default timezone of the server. Unfortunately, the JSF specification says that all dates and times should be assumed to be UTC, and displayed as UTC, unless a timezone is explicitly specified using <literal> &lt;f:convertDateTime&gt;</literal>. This is an extremely inconvenient default behavior.
fr_fr: Il y aussi une instance d'étendue de session dénommé <literal> java.util.Timezone</literal>, dénommée <literal> org.jboss.seam.international.timezone</literal>, et un composant de Seam pour la modificaiton du fuseau horaire dénommé <literal> org.jboss.seam.international.timezoneSelector</literal>. Par défaut, le fuseau horaire est le fuseau horaire par défaut du serveur. Malheureusement, la spécification JSF indique que toute les dates et les heures devraient être en UTC, et affichées en UTC, à moins que le fuseau horaire ne soit spécifié en utilisant <literal> &lt;f:convertDateTime&gt;</literal>. Ceci est un inconvénient majeur pour une fonctionnalité par défaut.
it_it: C'è anche un'istanza a livello sessione di <literal>java.util.Timezone</literal>, chiamata <literal>org.jboss.seam.international.timezone</literal>, e un componente Seam per cambiare il fuso orario chiamato <literal>org.jboss.seam.interanational.timezoneSelector</literal>. Per default il fuso orario è il fuso orario di default del server. Purtroppo le specifiche JSF dicono che tutte le date e orari devono essere considerati come UTC e mostrati come UTC a meno che un fuso orario non sia esplicitamente specificato usando <literal>&lt;f:convertDateTime&gt;</literal>. Questo è un comportamento di default estremamente sconveniente.
ja_jp: <literal>java.util.Timezone</literal> のセッションスコープのインスタンス、 名称は<literal>org.jboss.seam.international.timezone</literal> とタイムゾーンを変更する Seam コンポーネント、 名称は <literal>org.jboss.seam.international.timezoneSelector</literal> もあります。 デフォルトでは、タイムゾーンはサーバのデフォルトタイムゾーンです。 タイムゾーンが <literal>&lt;f:convertDateTime&gt;</literal> を使用して明示的に指定されない限り、 残念ながら JSF 仕様ではすべての日付と時間は UTC を前提としており、UTC として表示されます。 非常に不便なデフォルト動作となります。

source: Seam overrides this behavior, and defaults all dates and times to the Seam timezone. In addition, Seam provides the <literal> &lt;s:convertDateTime&gt;</literal> tag which always performs conversions in the Seam timezone.
fr_fr: Seam remplace cette fonctionnalité et par défaut, toutes les dates et les heures sont du fuseau horaire de Seam. De plus, Seam fourni une balise <literal> &lt;s:convertDateTime&gt;</literal> qui réalise toujours une conversation dans le fuseau horaire de Seam.
it_it: Seam modifica questo comportamento e imposta il fuso orario di tutte le date e orari al fuso orario di Seam. In più, Seam fornisce la tag <literal>&lt;s:convertDateTime&gt;</literal> che esegue sempre questa conversione nel fuso orario di Seam.
ja_jp: Seamはこの動作をオーバーライドし、すべての日付と時刻をデフォルトでSeamタイムゾーンにします。 さらにSeamは、Seamタイムゾーンでの変換を常に行う <literal>&lt;s:convertDateTime&gt;</literal> タグを提供します。

source: Seam also provides a default date converter to convert a string value to a date. This saves you from having to specify a converter on input fields that are simply capturing a date. The pattern is selected according the the user's locale and the time zone is selected as described above.
fr_fr: Seam fourni aussi un convertisseur de date par défaut convertissant une valeur de chaine de caractères vers une date. Ceci vous préserve d'avoir à indiquer un convertisseur pour les champs de saisies qui sont simplement capturé comme des dates. Le patron est sélectionné en accord avec la langue de l'utilisateur et son fuseau horaire est sélectionné comme décrit ci-dessous.
it_it: Seam fornisce anche un converter di date di default per convertire una valore stringa in una data. Questo risparmia di dover specificare un converter sui campi d'input che sono semplicemente catturati come data. Il pattern viene selezionato in accordo con il locale dell'utente e la timezone viene selezionata come descritto sopra.

source: Themes
fr_fr: Les thèmes
it_it: Temi
ja_jp: テーマ

source: Seam applications are also very easily skinnable. The theme API is very similar to the localization API, but of course these two concerns are orthogonal, and some applications support both localization and themes.
fr_fr: Les applications de Seam sont aussi très facilement personnalisable. L'API des thèmes est vraiment similaire à l'API de localisation, mais bien sur ces deux concernes de sujets orthogonaux et quelques application ont à la fois la localisation et les thèmes.
it_it: Le applicazioni Seam sono anche molto facilmente personalizzabili nell'aspetto. Le API per i temi sono molto simili alle API per la traduzione, ma ovviamente questi due concetti sono ortogonali e alcune applicazione gestiscono sia le traduzioni che i temi.
ja_jp: Seamアプリケーションはまた、とても簡単にスキン変更ができます。 テーマAPIはローカライゼーションAPIにとても似ていますが、 もちろんこれら二つの関心事は直交しており、 ローカライゼーションとテーマの両方をサポートするアプリケーションもあります。

source: First, configure the set of supported themes:
fr_fr: En permier, configurez le groupe de thème disponibles:
it_it: Prima di tutto occorre configurare l'insieme dei temi gestiti:
ja_jp: まず、サポートされるテーマのセットを設定します:

source: Note that the first theme listed is the default theme.
fr_fr: Notez que le premier thème listé est le thème par défaut.
it_it: Notare che il primo tema elencato è il tema di default.
ja_jp: 最初にリストされたテーマがデフォルトテーマであることに注意してください。

source: Themes are defined in a properties file with the same name as the theme. For example, the <literal>default</literal> theme is defined as a set of entries in <literal> default.properties</literal>. For example, <literal> default.properties</literal> might define:
fr_fr: Les thèmes sont définies dans un fichier de propriétés avec le même nom que le thème. par exemple, le thème <literal>default</literal> est définie comme un groupe d'entréees dans <literal> default.properties</literal>. Par exemple, <literal> default.properties</literal> devrait définir:
it_it: I temi sono definiti in file di proprietà con lo stesso nome del tema. Ad esempio, il tema <literal>default</literal> è definito come un insieme di voci in <literal>default.properties</literal>. Ad esempio <literal>default.properties</literal> potrebbe definire:
ja_jp: テーマは、そのテーマと同じ名前でプロパティファイルに定義されます。 例えば、 <literal>default</literal> テーマは <literal>default.properties</literal> に一連のエントリとして定義されます。 例えば、<literal>default.properties</literal> は以下のように定義します。

source: Usually the entries in a theme resource bundle will be paths to CSS styles or images and names of facelets templates (unlike localization resource bundles which are usually text).
fr_fr: Habituellement, un fichier de ressource de thème aura des chemins vers des fichiers de styles CSS ou des images ou des noms de pattron de facelets (à la différence des fichiers de resource de la localisation qui sont habituellement des fichiers textes).
it_it: Di solito le voci nel resource bundle di un tema saranno percorsi a fogli di stile CSS o immagini e nomi di modelli facelets (a differenza dei resource bundle per le traduzioni che normalmente contengono testo).
ja_jp: 通常、 テーマリソースバンドルのエントリは CSS スタイルや画像へのパスや facelet テンプレートの名前になるでしょう (通常はテキストであるローカライゼーションリソースバンドルとは違って)。

source: Now we can use these entries in our JSP or facelets pages. For example, to theme the stylesheet in a facelets page:
fr_fr: Maintenant, nous pouvons utiliser ces entrées dans nos pages JSP ou facelets. par exemple, pour personnaliser la feuille de style dans une page facelets:
it_it: Ora è possibile usare queste voci nella pagine JSP o facelets. Ad esempio, per gestire con un tema il foglio di stile di una pagina facelets:
ja_jp: これでJSPやfaceletページにおいてこれらのエントリを使えます。 例えば、faceletページでスタイルシートを適用するには:

source: Or, when the page definition resides in a subdirectory:
fr_fr: Ou, quand la définition de la page réside dans un sous-dossier:
it_it: Oppure, quando la definizione della pagina risiede in una sottocartella:
ja_jp: あるいは、サブディレクトリにページ定義が存在している場合は次のようになります。

source: Most powerfully, facelets lets us theme the template used by a <literal>&lt;ui:composition&gt;</literal>:
fr_fr: Plus impressionnant, les facelets nous permette de personnaisée le pattron utilisé avec un <literal>&lt;ui:composition&gt;</literal>:
it_it: In modo più flessibile, facelets consente di gestire con i temi il modello usato da un <literal>&lt;ui:composition&gt;</literal>:
ja_jp: 最も強力な使い方として、 faceletでは <literal>&lt;ui:composition&gt;</literal> によってテンプレートを適用できます。
