Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Jbpm.po
Languages: fr_fr, it_it, ja_jp

source: When JSF or Seam navigation rules are used, Seam lets the user freely navigate via the back, forward and refresh buttons. It is the responsibility of the application to ensure that conversational state remains internally consistent when this occurs. Experience with the combination of web application frameworks like Struts or WebWork - that do not support a conversational model - and stateless component models like EJB stateless session beans or the Spring framework has taught many developers that this is close to impossible to do! However, our experience is that in the context of Seam, where there is a well-defined conversational model, backed by stateful session beans, it is actually quite straightforward. Usually it is as simple as combining the use of <literal>no-conversation-view-id</literal> with null checks at the beginning of action listener methods. We consider support for freeform navigation to be almost always desirable.
fr_fr: Quand les règles de navigation JSF et Seam sont utilisées, Seam laisse l'utilisateur naviger librement avec les boutons précédent, suivant et rafraichir. Il est de la responsabilité de l'application de s'assurer que l'état conversationnel reste en interne consistant quand cela arrive. L'experience avec la combinaisond'application web comme Struts ou WebWork - qui ne supporte pas le modèle conversationnel - et les modèles de composants sans état comme les beans de session sans état EJB ou le serveur d'application Spring a appris à beaucoup de développers qu'il est presque impossible de le faire! Ainsi, notre expérience est que c'est dans le contexte de Seam qu'il y a un modèle conversaionnel bien définie, soutenu par les beans de de sessions avec état, il est actuellement presque prêt. Habituellement, il est presque aussi simple de combiner l'utilisation <literal>no-conversation-view-id</literal> avec la vérification de null au démarrage des méthodes d'écouteur d'action. Nous considerons le support de la navigation libre de formulaire presque aussi souhaitable.
it_it: Quando le regole di navigazione di JSF o Seam vendono impiegate, Seam consente all'utente di navigare liberamente avanti ed indietro e di usare il pulsante aggiorna. E' responsabilità dell'applicazione assicurare che lo stato conversazionale rimanga internamente consistente quando questo avviene. L'esperienza con la combinazione di framework web come Struts o WebWork - che non supportano un modello conversazionale - e modelli a componenti stateless come session bean EJB stateless o il framework Spring ha insegnato a molti sviluppatori che questo è quasi praticamente impossibile da realizzare! Comunqur la nostra esperienza è che il contesto di Seam, dove c'è un modello conversazionale ben definito, agganciato a session bean stateful, è in verità abbastanza semplice. E' tanto semplice quanto combinare l'uso di <literal>no-conversation-view-id</literal> con controlli nulli all'inizio di metodi action listener. Riteniamo che il supporto alla navigazione libera sia quasi sempre desiderabile.
ja_jp: JSF あるいは Seam ナビゲーション規則が使用される場合、 Seam は、ユーザーに戻る、進む、更新ボタンの自由なナビゲーションを可能にします。 これが発生したとき、 内部的な対話状態の一貫性を保持することは、 アプリケーションの責任です。 Struts や WebWork のような対話モデルをサポートしない WEB アプリケーションフレームワーク、 そして、EJB ステートレスセッションBean や Spring framework のようなステートレスコンポーネントモデルの組み合わせの経験は、 多くの開発者にこれをすることは、ほとんど不可能であることを教えていました。 しかし、Seam のコンテキストでの経験から、 ステートフルセッション Bean に裏付けられた明確な対話モデルがあるところでは、 それは実際とても簡単です。 通常、それは、アクションリスナーメソッドの最初に、 no-conversation-view-id アノテーションと null チェックの使用を組合わせるのと同じ位に簡単です。 私たちは、フリーフォームナビゲーションのサポートは、 ほぼいつも要求されるものと考えています。

source: In this case, the <literal>no-conversation-view-id</literal> declaration goes in <literal>pages.xml</literal>. It tells Seam to redirect to a different page if a request originates from a page rendered during a conversation, and that conversation no longer exists:
fr_fr: Dans ce cas, la déclaration de <literal>no-conversation-view-id</literal> va dans <literal>pages.xml</literal>. Il indique a Seam de rediriger vers une page différente si une requête originaire d'une page rendue pendant une conversation et que cette conversation n'existe plus:
it_it: In questo casola dichiarazione <literal>no-conversation-view-id</literal> va in <literal>pages.xml</literal>. Questa dice a Seam di reindirizzare ad una pagina differente se la richiesta proviene da una pagina generata durante una conversazione, e questa conversazione non esiste più:
ja_jp: この場合、<literal>no-conversation-view-id</literal>の宣言は <literal>pages.xml</literal>で行います。 対話中のレンダリングされたページからの要求の場合、 それは Seam にリダイレクトを指示し、対話はもはや存在しないことを知らせます。

source: On the other hand, in the stateful model, using the back button is interpreted as an undefined transition back to a previous state. Since the stateful model enforces a defined set of transitions from the current state, the back button is not permitted by default in the stateful model! Seam transparently detects the use of the back button, and blocks any attempt to perform an action from a previous, "stale" page, and simply redirects the user to the "current" page (and displays a faces message). Whether you consider this a feature or a limitation of the stateful model depends upon your point of view: as an application developer, it is a feature; as a user, it might be frustrating! You can enable backbutton navigation from a particular page node by setting <literal>back="enabled"</literal>.
fr_fr: D'un autre côté, dans le modèle avec état, le bouton "précédent" est interprété comme un retour de transition non-définie vers l'état précédent. Depuis que le modèle avec état se renforce comme un groupe définie de transition depuis l'état courrant, le bouton "précédent" est par défaut interdit dans le modèle avec état! Seam de manière transparent détecte l'utilisation du bouton précédent et bloque toute tentative de réaliser une action depuis une page précédente "périmée" et redirige simplement l'utilisateur vers la page "courante" (et affiche un message faces). Que vous considériez comme une fonctionnalité ou une limitation le modèle sans état cela dépend de votre point de vue: comme un développeur d'application, c'est une fonctionnalité, comme un utilisateur, cela peut être frustrant. Vous pouvez activer la navigation avec le bouton "précédent" depuis un noeud de page particulier en indiquant <literal>back="enabled"</literal>.
it_it: Dall'altro lato, nel modello stateful, il pulsante indietro viene interpretato come una transizione indietro ad un precedente stato. Poiché il modello stateful costringe ad un set di transizioni dallo stato corrente, il pulsante indietro viene di default disabilitato nel modello stateful! Seam rileva in modo trasparente l'uso del pulsante indietro e blocca qualsiasi tentativo di eseguire un'azione da una pagina precedente "in stallo", e reindirizza l'utente alla pagina "corrente" (mostrando un messagio faces). Se si consideri questa una funzionalità oppure una limitazione del modello stateful dipende dal proprio punto di vista: come sviluppatore è una funzionalità; come utente può essere frustrante! Si può abilitare la navigazione da un particolare nodo di pagina con il pulsante indietro impostando <literal>back="enabled"</literal>.

source: This allows navigation via the back button <emphasis>from</emphasis> the <literal>checkout</literal> state to <emphasis>any previous state!</emphasis>
fr_fr: Cela autorise le bouton "précédent" <emphasis>depuis</emphasis> l'état checkout vers <emphasis>tout état précédent!</emphasis>
it_it: Questo permette l'uso del pulsante indietro <emphasis>dallo</emphasis> stato <literal>checkout</literal> a <emphasis>qualsiasi altro stato!</emphasis>

source: If a page is set to redirect after a transition, it is not possible to use the back button to return to that page even when back is enabled on a page later in the flow. The reason is because Seam stores information about the pageflow in the page scope and the back button must result in a POST for that information to be restored (i.e., a Faces request). A redirect severs this linkage.
fr_fr: Si une page est définie pour rediriger après une transition, il n'est pas possible d'utiliser le bouton précédent pour retourner à la page même quand le bouton précédent est sur une page plus tard dans l'enchainement. La raison est que parce que Seam stocke les informations à propos de l'enchainement de page dans l'étendue page donc le bouton précédent doit résulter dans une requête POST pour que l'information soit restorée (autrement dit, une requête Faces). Une redirection fournie ce type de liaison.
it_it: Se una pagina viene impostata per il redirect dopo una transazione, non è possibile usare il pulsante indietro per ritornare a tale pagina anche quando è abilitato su una pagina più avanti nel flow. La ragione è che Seam memorizza le informazioni sul pageflow nello scope pagina ed il pulsante indietro deve risultare in un PST affinché tale informazione sia ripristinata (cioè, richiesta Faces). Un redirect fornisce questo collegamento.

source: Of course, we still need to define what happens if a request originates from a page rendered during a pageflow, and the conversation with the pageflow no longer exists. In this case, the <literal>no-conversation-view-id</literal> declaration goes into the pageflow definition:
fr_fr: Bien sûr, nous avons toujours besoin de définir ce qu'il arrive si une requête originiaire d'une page rendue pendant l'enchainement de page, et la conversation ave l'enchainement de page n'existe plus. Dans ce cas, la déclaration <literal>no-conversation-view-id</literal> va dans la définition d'enchainement de page:
it_it: Occorre ancora definire cosa succede se una richiesta ha origine da una pagina generata durante un pageflow mentre la conversazione con il pageflow non esiste più. In questo caso la dichiarazione <literal>no-conversation-view-id</literal> va dentro la definizione del pageflow:
ja_jp: もちろん、ページフロー時のレンダリングされたページからの要求の場合に何をするのか、そして、その際にページフローでの対話は存在していないのか、といったことを 定義しなければなりません。この場合、<literal>no-conversation-view-id</literal> の宣言は、ページフロー定義で行います:

source: In practice, both navigation models have their place, and you'll quickly learn to recognize when to prefer one model over the other.
fr_fr: En pratique, les deux modèles de navigation ont leur spécificité et vous allez rapidement apprendre à les reconnaitre quand vous préférerez un modèle plutôt que l'autre.
it_it: In pratica entrambi i modelli di navigazione hanno la loro utilità ed imparerai presto a riconoscere quando impiegare uno o l'altro.
ja_jp: 実際には両ナビゲーションモデルとも使い道がありますが、どんなときにどちらのモデルの方が適切かを理解するために、これから簡単に学んでいきます。

source: Using jPDL pageflows
fr_fr: Utilisation des enchainements de page jPDL
it_it: Utilizzo dei pageflow jPDL
ja_jp: jPDL ページフローの使用

source: Installing pageflows
fr_fr: Installation des enchainements de page
it_it: Installazione dei pageflow
ja_jp: ページフローの設定

source: We need to install the Seam jBPM-related components, and place the pageflow definitions (using the standard <literal>.jpdl.xml</literal> extension) inside a Seam archive (an archive which contains a <literal>seam.properties</literal> file):
fr_fr: Nous avons besoin d'installer les composants jBPM-style de Seam et leurs dirent où ils vont trouver la définition de l'enchainement de page. Nous pouvons spécifier cette configuration de Seam dans components.xml.
it_it: Vanno installati i componenti di Seam relativi a jBPM e vanno collocate le definizione dei pageflow (usando l'estensione standard <literal>.jpdl.xml</literal>) dentro l'archivio Seam (un archivio che contiene un file <literal>seam.properties</literal>):
ja_jp: Seam の jBPM 関連のコンポーネントをインストールし、Seam アーカイブ （ <literal> seam.properties </literal> ファイルを含むアーカイブ ） の中にページフロー定義の場所を ( 標準の <literal>jpdl.xml </literal> 拡張を使用して ) 指示する必要があります。 この components.xml に Seam 設定を指定することができます。

source: We can also explicitly tell Seam where to find our pageflow definition. We specify this in <literal>components.xml</literal>:
fr_fr: Vous pouvez aussi explicitement indiquer à Seam où trouver la définition d'enchainement de page. Nous spécifions ceci dans <literal>components.xml</literal>:
it_it: Si può anche comunicare esplicitamente a Seam dove trovare le definizioni dei pageflow. Questo viene specificato dentro <literal>components.xml</literal>:
ja_jp: Seam の jBPM 関連のコンポーネントをインストールしページフロー定義の場所を指示する必要があります。 この <literal>components.xml</literal> に Seam 設定を指定することができます。

source: Starting pageflows
fr_fr: Démarrage des enchainements de pages
it_it: Avvio dei pageflow
ja_jp: ページフローの開始

source: We "start" a jPDL-based pageflow by specifying the name of the process definition using a <literal>@Begin</literal>, <literal>@BeginTask</literal> or <literal>@StartTask</literal> annotation:
fr_fr: Nous "démarrons" un enchainement de pages jPDL-style en indiquant le nom de la définition du processus en utilisation une annotation <literal>@Begin</literal>, <literal>@BeginTask</literal> ou <literal>@StartTask</literal>:
it_it: Si "inizia" un pageflow basato su jPDLspecificando il nome della definizione del processo usando un'annotazione <literal>@Begin</literal>, <literal>@BeginTask</literal> oppure <literal>@StartTask</literal>:
ja_jp: <literal>@Begin</literal>、<literal>@BeginTask</literal> あるいは、 <literal>@StartTask</literal> アノテーションを使用して、 プロセス定義の名前を指定することによって、 jPDL ベースのページフローを開始します:

source: Alternatively we can start a pageflow using pages.xml:
fr_fr: De manière alternative, nous pouvons démarrer un enchainement de page en utilisant pages.xml:
it_it: In alternativa si può iniziare un pageflow usando pages.xml:
ja_jp: もしくは、pages.xmlを使用してページフローを開始できます。

source: If we are beginning the pageflow during the <literal>RENDER_RESPONSE</literal> phase &#8212; during a <literal>@Factory</literal> or <literal>@Create</literal> method, for example &#8212; we consider ourselves to be already at the page being rendered, and use a <literal>&lt;start-page&gt;</literal> node as the first node in the pageflow, as in the example above.
fr_fr: Si nous commençons un enchainement de page pendant la phase R<literal>RENDER_RESPONSE</literal> &#8212; pendant qu'une méthode <literal>@Factory</literal> ou <literal>@Create</literal>, par exemple &#8212; nous considerons nous même être à la page qui doit être rendue, et utilisons un noeud <literal>&lt;start-page&gt;</literal> comme premier noeud dans l'enchainement de page, comme le montre l'exemple ci dessous.
it_it: Se il pageflow viene iniziato durante la fase <literal>RENDER_RESPONSE</literal> &#8212; durante un metodo <literal>@Factory</literal> o <literal>@Create</literal>, per esempio &#8212; si presume di essere già nella pagina da generare, e si usa un nodo <literal>&lt;start-page&gt;</literal> come primo nodo nel pageflow, come nell'esempio sopra.

source: But if the pageflow is begun as the result of an action listener invocation, the outcome of the action listener determines which is the first page to be rendered. In this case, we use a <literal>&lt;start-state&gt;</literal> as the first node in the pageflow, and declare a transition for each possible outcome:
fr_fr: Mais si l'enchainement de page a commencé comme le resulteat de l'invocation d'un écouteur d'action, le retour de lécouteur d'action détermine quel est la première page à être rendue. Dans ca cas, nous utilisons un <literal>&lt;start-state&gt;</literal> comme premier noeud de l'enchainement de page et déclarons une transition pour chaque sortie possible:
it_it: Ma se il pageflow viene iniziato come risultato di un'invocazione di un action listener, l'esito dell'action listener determina quale è la prima pagina da generare. In questo caso si usa un <literal>&lt;start-state&gt;</literal> come primo nodo del pageflow, e si dichiara una transizione per ogni possibile esito:
ja_jp: しかし、ページフローがアクションリスナー呼び出しの結果として開始される場合、 アクションリスナーの結果 (outcome) は、レンダリングされる最初のページを決定します。 この場合、ページフローの最初のノードとして <literal>&lt;start-state&gt;</literal> を使用し、 それぞれの可能な結果 (outcome) のために遷移を宣言します。

source: Page nodes and transitions
fr_fr: Les noeuds de page et transitions
it_it: Nodi e transizioni di pagina
ja_jp: ページノードと遷移

source: Each <literal>&lt;page&gt;</literal> node represents a state where the system is waiting for user input:
fr_fr: Chaque noeud <literal>&lt;page&gt;</literal> représente un état où le système est en train d'attendre une saisie de l'utilisateur:
it_it: Ogni nodo <literal>&lt;page&gt;</literal> rappresenta uno stato in cui il sistema aspetta input da parte dell'utente:
ja_jp: 各 <literal>&lt;page&gt;</literal> ノードは、システムがユーザー入力を待っている状態を表します。

source: The <literal>view-id</literal> is the JSF view id. The <literal>&lt;redirect/&gt;</literal> element has the same effect as <literal>&lt;redirect/&gt;</literal> in a JSF navigation rule: namely, a post-then-redirect behavior, to overcome problems with the browser's refresh button. (Note that Seam propagates conversation contexts over these browser redirects. So there is no need for a Ruby on Rails style "flash" construct in Seam!)
fr_fr: Le <literal>view-id</literal> est l'identifiant de la vue JSF. L'élément <literal>&lt;redirect/&gt;</literal> a le même effet que <literal>&lt;redirect/&gt;</literal> dans une règle de navigation : à savoir, une fonctionnalité poster-puis-rediriger, pour contourner les problème avec le bouton rafraichir du navigateur. (Notez que Seam propage les contextes de conversation au travers de ces redirection de navigateur. Il n'y a donc pas besoin d'un fabrique de style Ruby on Rails "flash" dans Seam!)
it_it: <literal>view-id</literal> è l'id della vista JSF. L'elemento <literal>&lt;redirect/&gt;</literal> ha lo stesso effetto di <literal>&lt;redirect/&gt;</literal> in una regola di navigazione JSF: cioè un comportamento post-then-redirect per superare i problemi del pulsante aggiorna del browser. (Si noti che Seam propaga i contesti di conversazioni assieme a questi redirect. Quindi in Seam non serve alcun construtto "flash" dello stile di Ruby on Rails!)
ja_jp: <literal>view-id</literal> はJSFのビューIDです。 <literal>&lt;redirect/&gt;</literal>要素はJSFナビゲーションルールにある<literal>&lt;redirect/&gt;</literal>と同じで、ブラウザの再表示ボタンの問題に対応するためのpost-then-redirectといった振る舞いと同じ効果をもたらします。(Seamはこれらブラウザのリダイレクトをこえて対話コンテキストを渡していきますのでRuby on Rails の "flash"のようなものはSeamでは必要はありません）

source: The transition name is the name of a JSF outcome triggered by clicking a command button or command link in <literal>numberGuess.jsp</literal>.
fr_fr: Le nom de transition est le nom de la sortie JSF déclenché en cliquant sur le bouton de commande ou le lien de commande dans <literal>numberGuess.jsp</literal>.
it_it: Il nome della transizione è il nome dell'esito JSF lanciato cliccando un command button od un command link in <literal>numberGuess.jsp</literal>.
ja_jp: 遷移名は、<literal>numberGuess.jsp</literal> において、 ボタン あるいは、リンクをクリックすることによって起動された JSF 結果 (outcome) の名前です。

source: When the transition is triggered by clicking this button, jBPM will activate the transition action by calling the <literal>guess()</literal> method of the <literal>numberGuess</literal> component. Notice that the syntax used for specifying actions in the jPDL is just a familiar JSF EL expression, and that the transition action handler is just a method of a Seam component in the current Seam contexts. So we have exactly the same event model for jBPM events that we already have for JSF events! (The <emphasis>One Kind of Stuff</emphasis> principle.)
fr_fr: Quand la transition est déclenchée par le clic sur le bouton, jBPM ira activer l'action de transition en appelant la méthode <emphasis>guess()</emphasis> du composant <emphasis>numberGuess</emphasis>. Notez que la syntaxe utilisée pour spécifier les actions dans le jPDL est juste une expression familière JSF EL, et que l'action de transation est juste une méthode d'une composant Seam dans le contexte courrant de Seam. Donc, nous avons exactement le même modèle d'évènement pour jBPM que nous avons déjà pour les évènements JSF! (Le principe <emphasis>d'Un Seul Genre de Truc.</emphasis>)
it_it: Quando cliccando il pulsante verrà invocata la transizione, jBPM attiverà l'azione della transizione chiamando il metodo <literal>guess()</literal> del componente <literal>numberGuess</literal>. Si noti che la sintassi usata per specificare le azioni in jPDL non è che un'espressione JSF EL già familiare, e che l'action handler della transizione è solo un metodo di un componente Seam negli attuali contesti. Così per gli eventi jBPM si ha esattamente lo stesso modello ad eventi visto per gli eventi JSF! (Il principio <emphasis>Unico tipo di "cosa"</emphasis>.)
ja_jp: 遷移が、このボタンをクリックすることによって起動されるときに、 <literal>numberGuess</literal> コンポーネントの <literal>guess () </literal> メソッドと呼び出すことによって、 jBPM は、遷移のアクションを起動します。 jPDL においてアクションを指定するために使わるシンタックスは、 JSF EL 式とよく似ていること、 そして、遷移のアクションハンドラは、 ちょうど現在の Seam コンテキストにおける Seam コンポーネントのメソッドであることに注意してください。 従って、JSF イベントのために既に持っているものと、ちょうど同じ jBPM イベントのモデルを持ちます。 (一貫した原則 (The One Kind of Stuff principle))

source: In the case of a null outcome (for example, a command button with no <literal>action</literal> defined), Seam will signal the transition with no name if one exists, or else simply redisplay the page if all transitions have names. So we could slightly simplify our example pageflow and this button:
fr_fr: Dans le cas d'un résultat null (par exemple, un bouton de command sans aucune action définie), Seam ira signaler la transition sans aucun nom si une existe, ou sinon simplement réaffiche la page si toutes les transition ont un nom. Donc nous pourrions légèrement simplifier notre exemple d'enchainement de page et ce bouton:
it_it: Nel caso di esito nullo (per esempio un pulsante di comando senza la definizione di <literal>action</literal>), Seam segnalerà la transizione senza nome se ne esiste una, oppure rivisualizzerà la pagina se tutte le transizioni hanno un nome. Così è possibile semplificare leggermente l'esempio del pageflow e questo pulsante:
ja_jp: nullでのoutcome の場合 (例えば、<literal>action</literal> が定義されていないコマンドボタン)、 もし、名前のない遷移があるならば、Seam は遷移するためのシグナルを送ります。 あるいは、もし、すべての遷移が名前を持つならば、単純にページを再表示します。 従って、サンプルのページフローとボタンは少し単純化できます。

source: Would fire the following un-named transition:
fr_fr: Qui va déclencher la transition sans-nom suivante:
it_it: Esegue la seguente transizione senza nome:
ja_jp: これは以下の名前のない遷移でのアクションを実行します。

source: It is even possible to have the button call an action method, in which case the action outcome will determine the transition to be taken:
fr_fr: Il est même possible d'avoir un bouton qui appele une méthode d'action, dans ce cas le résultat de l'action va déterminer la tranistion qui doit être prise:
it_it: E' anche possibile che il pulsante chiami un action method, nel qual caso l'esito dell'azione determinerà la transizione da prendere:
ja_jp: ボタンにアクションメソッドを呼ばせることも可能です。 この場合アクション結果 (outcome) が遷移を決定します。

source: However, this is considered an inferior style, since it moves responsibility for controlling the flow out of the pageflow definition and back into the other components. It is much better to centralize this concern in the pageflow itself.
fr_fr: Malgré cela, il est est à considérer comme un style inférieur, car il déplace la responsabilité du contrôl du flot à l'extérieur de la définition de l'enchainement de page et le place dans un autre composants. Il est franchement meilleur de centraliser ce qui s'y rapporte dans l'enchainement de pages lui même.
it_it: Comunque questo è considerato uno stile inferiore, poiché sposta la responsabilità del controllo del flusso fuori dalla definizione del pageflow e la mette negli altri componenti. E' molto meglio centralizzare questo concern nel pageflow stesso.
ja_jp: しかし、これは質の悪いスタイルだと考えます。 なぜならフロー制御の責任をページフロー定義の外側の他のコンポーネントに移動しているからです。 ページフローに関連することを局所化することは、より良いことです。

source: Controlling the flow
fr_fr: Controler le flot
it_it: Controllo del flusso
ja_jp: フローの制御
