Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Jbpm.po
Languages: fr_fr, it_it, ja_jp

source: Usually, we don't need the more powerful features of jPDL when defining pageflows. We do need the <literal>&lt;decision&gt;</literal> node, however:
fr_fr: Habituellement, nous n'avons pas besoin des fonctionnalités les plus puissantes de jPDL pendant la définition des enchainements de pages. Nous avons besoin du noeud <literal>&lt;decision&gt;</literal>, malgré tout:
it_it: Di solito non occorrono le funzionalità più potenti di jPDL nella definizione dei pageflow. Serve comunque il nodo <literal>&lt;decision&gt;</literal>:
ja_jp: 一般的にページフローを定義するときにjPDLのより強力な機能は必要としていません。しかし<literal>&lt;decision&gt;</literal>ノードは必要です。

source: A decision is made by evaluating a JSF EL expression in the Seam contexts.
fr_fr: Une décision est faite en évaluant une expression JSF EL dans les contextes de Seam.
it_it: Una decisione viene presa valutando un'espressione EL JSF nei contesti di Seam.
ja_jp: decision ( 意志決定 ) は Seam コンテキスト中では JSF EL 式によって評価されます。

source: Ending the flow
fr_fr: Terminer le flot
it_it: Fine del flusso
ja_jp: フローの終了

source: We end the conversation using <literal>&lt;end-conversation&gt;</literal> or <literal>@End</literal>. (In fact, for readability, use of <emphasis>both</emphasis> is encouraged.)
fr_fr: Nous finissons la conversation en utilisant <literal>&lt;end-conversation&gt;</literal> ou <literal>@End</literal>. (Dans les faits, pour la lisibilité, l'utilisation des deux est encouragé.)
it_it: Si termina una conversazione usando <literal>&lt;end-conversation&gt;</literal> oppure <literal>@End</literal>. (Infatti per chiarezza si consiglia l'uso di <emphasis>entrambi</emphasis>.)"
ja_jp: <literal>&lt;end-conversation&gt;</literal>、または<literal>@End</literal> を使用して対話を終了します。 (実際、可読性のために<emphasis>両方</emphasis> の使用を勧めます。)

source: Optionally, we can end a task, specify a jBPM <literal>transition</literal> name. In this case, Seam will signal the end of the current task in the overarching business process.
fr_fr: De manière optionnel, nous pouvons finir une tâche, spécifiant un nom de <literal>transition</literal> jBPM. Dans ce cas, Seam va signaler la fin de la tâche courrante dans le processus métier hypercintré.
it_it: Opzionalmente è possibile terminare un task specificando un nome alla <literal>transition</literal> jBPM. In questo modo Seam segnalerà la fine del task corrente al processo di business sottostante.
ja_jp: オプションとして<literal>transition</literal> 名を指定してタスクを終了することができます。 この場合Seam はビジネスプロセスにおいて現在のタスク終了の信号を送るでしょう。

source: Pageflow composition
fr_fr: La composition de l'enchainement de page
it_it: Composizione dei pageflow
ja_jp: ページフローコンポジション

source: It is possible to compose pageflows and have one pageflow pause pause while another pageflow executes. The <literal>&lt;process-state&gt;</literal> node pauses the outer pageflow, and begins execution of a named pageflow:
fr_fr: Il ets possible de composer des enchainements de page et d'avoir une pause dans l'enchainement de page alors qu'un autre enchainement s'exécute. Le noeud <literal>&lt;process-state&gt;</literal> met en pausse l'enchainement de page indiqué et comme l'exécution de l'enchainement de page appelé:
it_it: E' possibile comporre pageflow ed avere una pausa in un pageflow mentre viene eseguito un altro pageflow. Il nodo <literal>&lt;process-state&gt;</literal> effettua una pausa nel pageflow più esterno e comincia l'esecuzione di un pageflow con nome:
ja_jp: ページフローを含むことができ、他のページフローが実行中の際にとめることも可能です。<literal>&lt;process-state&gt;</literal> ノードは外部のページフローをとめて指定されたページフローを開始します。

source: The inner flow begins executing at a <literal>&lt;start-state&gt;</literal> node. When it reaches an <literal>&lt;end-state&gt;</literal> node, execution of the inner flow ends, and execution of the outer flow resumes with the transition defined by the <literal>&lt;process-state&gt;</literal> element.
fr_fr: Le flot inclus commence en exécutant un noeud <literal>&lt;start-state&gt;</literal>. Quand il atteind un noeud <literal>&lt;end-state&gt;</literal>, l'exécution du flot inclus s'arrête et l'exécution du flot englobant recommence avec la transition définie dans l'élement <literal>&lt;process-state&gt;</literal>.
it_it: Il flusso più interno comincia l'esecuzione al nodo <literal>&lt;start-state&gt;</literal>. Quando raggiunge un nodo <literal>&lt;end-state&gt;</literal>, l'esecuzione del flusso più interno termina, e riprende quella del flusso più esterno con la transizione definita dall'elemento <literal>&lt;process-state&gt;</literal>.
ja_jp: <literal>&lt;start-state&gt;</literal> ノードで内側のフローは開始します。 <literal>&lt;end-state&gt;</literal> ノードの到着すると、内側のフローは終了し、外側のフローの<literal>&lt;process-state&gt;</literal> 要素で定義された遷移から再開されます。

source: Business process management in Seam
fr_fr: La gestion des processus métier dans Seam
it_it: La gestione del processo di business in Seam
ja_jp: Seam のビジネスプロセス管理

source: A business process is a well-defined set of tasks that must be performed by users or software systems according to well-defined rules about <emphasis>who</emphasis> can perform a task, and <emphasis>when</emphasis> it should be performed. Seam's jBPM integration makes it easy to display lists of tasks to users and let them manage their tasks. Seam also lets the application store state associated with the business process in the <literal>BUSINESS_PROCESS</literal> context, and have that state made persistent via jBPM variables.
fr_fr: Un processus métier est un groupe de tâche bien définis qui doivent être réaliser par des utilisateurs ou des systèmes logiciels en accord avec des règles bien définies à propos de <emphasis>qui</emphasis> peut réaliser une tâche, et <emphasis>quand</emphasis> elle devrait être réalisée. L'intégration de JBPM dans Seam rend facile d'afficher la liste des tâches des utilisateurs et les laisser gérer leurs tâches. Seam permet aussi à l'application stocker l'état associé avec le processus métier dans le contexte <literal>BUSINESS_PROCESS</literal> et avoir cet état qui soit persistant via les variables du jBPM.
it_it: Un processo di business è un set di task ben-definiti che deve essere eseguito dagli utenti o dai sistemi software secondo regole ben-definite riguardo <emphasis>chi</emphasis> può eseguire un task, e <emphasis>quando</emphasis>deve essere eseguito. L'integrazione jBPM di Seam facilita la visione della lista di task agli utenti e consente loro di gestire questi task. Seam consente anche all'applicazione di memorizzare lo stato associato al processo di business nel contesto <literal>BUSINESS_PROCESS</literal>, ed rendere questo stato persistente tramite variabili jBPM.
ja_jp: ビジネスプロセスは誰が、いつ実行されるべきかが明確に定義されたルールの上で、ユーザーやソフトウェアによって実行される明確に定義されたタスクの集合です。 Seam の jBPM インテグレーションはタスク一覧をユーザーに表示することやタスク管理を容易にします。また Seam はアプリケーションにビジネスプロセスに関する状態をビジネスプロセスコンテキストに保管することを可能にします。

source: A simple business process definition looks much the same as a page flow definition (<emphasis>One Kind of Stuff</emphasis>), except that instead of <literal>&lt;page&gt;</literal> nodes, we have <literal>&lt;task-node&gt;</literal> nodes. In a long-running business process, the wait states are where the system is waiting for some user to log in and perform a task.
fr_fr: Une simple définition de processus métier ressemble assez à la définition de l'enchainement de page (<emphasis>Un Seul Genre de Truc</emphasis>), exception sauf qu'au lieu d'un noeud <literal>&lt;page&gt;</literal> , nous avons des noeuds <literal>&lt;task-node&gt;</literal>. Dans un procéssus métier à exécution longue, les état d'atente sont là où le système est en attente qu'un utilisateur se connecte pour réaliser une tâche.
it_it: Una semplice definizione di processo di business appare più o meno come una definizione di pageflow (<emphasis>Unico tipo di cosa</emphasis>), tranne che invece dei nodi <literal>&lt;page&gt;</literal>, si hanno i nodi <literal>&lt;task-node&gt;</literal>. In un processo di business long-running, gli stati di attesa si verificano quando il sistema aspetta che un qualche utente entri ed esegua un task.
ja_jp: <literal>&lt;page&gt;</literal> の代わりに<literal>&lt;task-node&gt;</literal> ノードを持つ以外、 簡単なビジネスプロセス定義はページフロー定義とほぼ同じであるように見えます。 (一貫した原則 (The One Kind of Stuff principle)) 長期間のビジネスプロセスにおいて、 待ち状態はシステムが、ユーザーがログインしタスクを実行するのを待っているところです。

source: It is perfectly possible that we might have both jPDL business process definitions and jPDL pageflow definitions in the same project. If so, the relationship between the two is that a single <literal>&lt;task&gt;</literal> in a business process corresponds to a whole pageflow <literal>&lt;pageflow-definition&gt;</literal>
fr_fr: Il est parfaitement possible que nous ayons à la fois des définition de processus métier en jPDL et des définitions d'enchainements de pages en jPDL dans le même projet. Et donc, la relation entre les deux est qu'un seul <literal>&lt;task&gt;</literal> dans un processus métier correspond à l'ensemble d'un enchainement de page <literal>&lt;pageflow-definition&gt;</literal>
it_it: E' perfettamente possibile avere entrambi le definizioni di processo di business jPDL e le definizioni di pageflow jPDL nello stesso progetto. Se questo è il caso, la relazione tra i due è che un singolo <literal>&lt;task&gt;</literal> in un processo di business corrisponde ad un intero pageflow <literal>&lt;pageflow-definition&gt;</literal>
ja_jp: 同じプロジェクトの中にjPDL ビジネスプロセス定義と jPDL ページフロー定義を持つことは可能です。 そうであれば2 つの関係は ビジネスプロセス中の <literal>&lt;task&gt;</literal>は ページフロー <literal>&lt;process-definition&gt;</literal>全体と一致します。

source: Using jPDL business process definitions
fr_fr: Utilisation des définitions de processus métier jPDL
it_it: Uso di jPDL nella definizione del processo di business
ja_jp: jPDL ビジネスプロセス定義の使用

source: Installing process definitions
fr_fr: Installation des définition de processus
it_it: Installazione delle definizioni di processo
ja_jp: プロセス定義の設定

source: We need to install jBPM, and tell it where to find the business process definitions:
fr_fr: Nous avons besoin d'installer un jBPM, et de lui dire où trouver les définition de processus métier :
it_it: Occorre installare jBPM ed indicare dove si trovano le definizioni dei processi di business:
ja_jp: jBPM を設定し、そのjBPMにビジネスプロセス定義の場所を指示する必要があります。

source: As jBPM processes are persistent across application restarts, when using Seam in a production environment you won't want to install the process definition every time the application starts. Therefore, in a production environment, you'll need to deploy the process to jBPM outside of Seam. In other words, only install process definitions from <literal>components.xml</literal> when developing your application.
fr_fr: Les processus jBPM sont persistant au travers du redémarrage de l'application, avec l'utilisation de Seam dans un environement de production vous ne voudriez pas avoir à installer la définition de processus à chaque fois que l'application démarre. Cependant, dans un environement de production vous allez avoir besoin de détruire le processus jBPM à l'extérieur de Seam. En d'autres termes, installez seulement le processus de définitions dans <literal>components.xml</literal> pendant le développement de votre application.
it_it: Poichéi processi jBPM sono persistenti nel corso dei riavvii dell'applicazione, quando si usa Seam in ambiente di produzione non si vorrà sicuramente installare ogni volta le definizioni dei processi adogni riavvio. Quindi, in ambiente di produzione, occorre fare il deploy del processo in jBPM fuori da Seam. In altre parole, si installano le definizioni dei processi dal file <literal>components.xml</literal> durante lo sviluppo dell'applicazione.
ja_jp: jBPM プロセスのリスタートをまたいで永続化され、本番環境で Seam を使用する場合、アプリケーションのリスタートのたびにプロセス定義をインストールをしたくはありません。つまり本番環境ではSeamアプリケーションとは別に、jBPMに対してプロセス定義をデプロイする必要があります。そしてアプリケーションを開発するときには、<literal>components.xml </literal>からプロセス定義だけをインストールします。

source: Initializing actor ids
fr_fr: Initialisation des identifiants des acteurs
it_it: Inizializzazione degli actor id
ja_jp: アクターIDの初期化

source: We always need to know what user is currently logged in. jBPM "knows" users by their <emphasis>actor id</emphasis> and <emphasis>group actor ids</emphasis>. We specify the current actor ids using the built in Seam component named <literal>actor</literal>:
fr_fr: Nous avons toujours besoin de connaitre quel utilisateur est actuellement connecté. jBPM "connait" les utilisateur par <emphasis>leur identifiant d'acteur</emphasis> et par <emphasis>leurs identifiants de groupe d'acteur</emphasis>. Nous spécifions les identifiant d'acteur courrant en utilisant le composant livré dans Seam nommé <literal>actor</literal>:
it_it: Bisogna sempre sapere quale utente è attualmente loggato. jBPM "riconosce" gli utenti dal loro <emphasis>actor id</emphasis> e dai <emphasis>group actor id</emphasis>. Specificheremo gli attuali actor id usando il componente interno di Seam chiamato <literal>actor</literal>:
ja_jp: いつでも現在ログインしているユーザーを知っている必要があります。 jBPM は<emphasis>actor id</emphasis> と <emphasis>group actor id</emphasis>によってユーザーを識別します。 <literal>actor</literal> と呼ばれる組み込み Seam コンポーネントを使用することにより現在の actor id を指定します。

source: Initiating a business process
fr_fr: Initialisation d'un processus métier
it_it: Iniziare un processo di business
ja_jp: ビジネスプロセスの初期化

source: To initiate a business process instance, we use the <literal>@CreateProcess</literal> annotation:
fr_fr: Pour initialiser une instance d'un processus métier, nous utilisons l'annotation <literal>@CreateProcess</literal>:
it_it: Per iniziare un'istanza di processo di business, si usa l'annotazione <literal>@CreateProcess</literal>:
ja_jp: ビジネスプロセスインスタンスを初期化するためには <literal>@CreateProcess</literal> アノテーションを使用します。

source: Alternatively we can initiate a business process using pages.xml:
fr_fr: Autre alternative, nous pouvons initialiser un processus métier en utilisant pages.xml:
it_it: In alternativa è possibile iniziare un processo di business usando pages.xml:
ja_jp: また、 pages.xmlを使用してビジネスプロセスの初期化も行えます:

source: Task assignment
fr_fr: Assigner une tâche
it_it: Assegnazione task
ja_jp: タスク割り当て

source: When a process reaches a task node, task instances are created. These must be assigned to users or user groups. We can either hardcode our actor ids, or delegate to a Seam component:
fr_fr: Quand un processus démarre, les instances de tâches sont créés. Ils doivent être assignés aux utilisateurs et aux groupes d'utilisateurs. Nous pouvons coder en durs les idenfiants d'acteur ou le déléguer à un composant de Seam:
it_it: Quando un processo raggiunge un task node, vengono create istante di compiti. Queste devono essere assegnate a utenti o gruppi di utenti. Si può codificare gli id degli attori (actor id) o delegare ad un componente Seam:
ja_jp: プロセスがタスクノードに到着したときタスクインスタンスは作成されます。そのタスクインスタンスにはユーザーもしくはユーザーグループが割り当てられていなければなりません。アクターIDをハードコードもできますしSeamコンポーネントに委譲することもできます。

source: In this case, we have simply assigned the task to the current user. We can also assign tasks to a pool:
fr_fr: Dans ce cas, nous avons simplement assigné la tâche à l'utilisateur courrant. Nous pouvons aussi assigné les tâches à un groupement:
it_it: In questo caso si è semplicemente assegnato il task all'utente corrente. Possiamo anche assegnare compiti ad un pool (gruppo):
ja_jp: この場合、 単純に現在のユーザーにタスクを割り当てます。 タスクをプールに割り当てることもできます。

source: Task lists
fr_fr: Liste des tâches
it_it: Liste di task
ja_jp: タスクリスト

source: Several built-in Seam components make it easy to display task lists. The <literal>pooledTaskInstanceList</literal> is a list of pooled tasks that users may assign to themselves:
fr_fr: Plusieurs composant livrés dans Seam rendent facile l'affichage de listes de tâches. Le <literal>pooledTaskInstanceList</literal> est une liste de tâches en groupement que les utilisateurs peuvent assigner à eux-même:
it_it: Parecchi componenti incorporati in Seam consentono facilmente di visualizzare liste di compiti. <literal>pooledTaskInstanceList</literal> è una lista di compiti che gli utenti possono assegnare a se stessi:
ja_jp: いくつかの組み込み Seam コンポーネントによりタスクリストの表示が容易になっています。 <literal>pooledTaskInstanceList</literal> は ユーザーが自分自身に割り当てることができるプールされたタスクのリストです。

source: Note that instead of <literal>&lt;s:link&gt;</literal> we could have used a plain JSF <literal>&lt;h:commandLink&gt;</literal>:
fr_fr: Notez qu'au lieu de <literal>&lt;s:link&gt;</literal> nous pouvons utiliser un <literal>&lt;h:commandLink&gt;</literal> en pur JSF :
it_it: Notare che invece di <literal>&lt;s:link&gt;</literal> avremmo potuto usare un semplice JSF<literal>&lt;h:commandLink&gt;</literal>:
ja_jp: <literal>&lt;s:link&gt;</literal> の代わりに普通の JSF <literal>&lt;h:commandLink&gt;</literal> を使用することもできます。

source: The <literal>pooledTask</literal> component is a built-in component that simply assigns the task to the current user.
fr_fr: Le composant <literal>pooledTask</literal> est un composant livré qui assigne simplement la tâche à l'utilisateur courrant.
it_it: Il componente <literal>pooledTask</literal> è un componente incorporato che semplicemente assegna il task all'utente corrente.
ja_jp: <literal>pooledTask</literal> コンポーネントは単純にタスクを現在のユーザーに割り当てる組み込みコンポーネントです。

source: The <literal>taskInstanceListForType</literal> component includes tasks of a particular type that are assigned to the current user:
fr_fr: Le composant <literal>taskInstanceListForType</literal> inclus les tâches d'un type particulier qui sont assigné à l'utilisateur courrant:
it_it: Il componente <literal>taskInstanceListForType</literal> include i task di un particolare tipo che sono stati assegnati all'utente corrente:
ja_jp: <literal>taskInstanceListForType</literal> コンポーネントは、 現在のユーザーに割り当てられた特定タイプのタスクを含んでいます。

source: Performing a task
fr_fr: Réalisation d'une tâche
it_it: Esecuzione di un task
ja_jp: タスクの実行

source: To begin work on a task, we use either <literal>@StartTask</literal> or <literal>@BeginTask</literal> on the listener method:
fr_fr: Pour commencer le travail sur une tâche, nous utilisons aussi bien <literal>@StartTask</literal> ou <literal>@BeginTask</literal> sur la méthode d'écoute:
it_it: Per iniziare a lavorare ad un compito, si può usare o <literal>@StartTask</literal> o <literal>@BeginTask</literal> sul metodo listener.
ja_jp: タスクの作業を開始させるために、リスナーメソッドに <literal>@StartTask</literal> あるいは <literal>@BeginTask</literal>を使用します。

source: Alternatively we can begin work on a task using pages.xml:
fr_fr: Autre alternative, nous pouvons commencer le travail sur une tâche en utilisant pages.xml:
it_it: In alternativa si può iniziare a lavorare su un task usando pages.xml:
ja_jp: また、 タスクの実行を pages.xml を使用して始めることもできます:

source: These annotations begin a special kind of conversation that has significance in terms of the overarching business process. Work done by this conversation has access to state held in the business process context.
fr_fr: Ces annotations commencent une type spécial de conversation qui ont de l'importance en terme de processus métier hypercintré. Le travail fait par cette conversation à accès à l'état contenue dans le processus métier dans le contexte de processus métier.
it_it: Queste annotazioni iniziano uno speciale tipo di conversazione che ha significato in termini di processo di business. Il lavoro fatto da questa conversazione ha accesso allo stato mantenuto nel contesto di business process.
ja_jp: これらのアノテーションはビジネスプロセス全体に関して意味を持つ特殊な種類の対話を開始します。 この対話による処理はビジネスプロセスコンテキストの中で保持する状態にアクセスできます。

source: If we end the conversation using <literal>@EndTask</literal>, Seam will signal the completion of the task:
fr_fr: Si nous finisons la conversation en utilisant <literal>@EndTask</literal>, Seam va signaler la réalisation de la tâche:
it_it: Se si termina una conversazione usando <literal>@EndTask</literal>, Seam segnalerà il completamento del task:
ja_jp: <literal>@EndTask</literal> を使用して対話を終了する場合にSeam はタスクの完了サインを送信します。

source: Alternatively we can use pages.xml:
fr_fr: Autre alternative, nous pouvons utiliser pages.xml:
it_it: In alternativa si usa pages.xml:
ja_jp: また、 pages.xmlも使用できます:

source: You can also use EL to specify the transition in pages.xml.
fr_fr: Vous pouvez aussi utiliser une EL pour spécifier la transition dans pages.xml.
it_it: Si può anche usare EL per specificare la transizione in pages.xml.
ja_jp: pages.xmlに遷移をELを使って指定もできます。

source: At this point, jBPM takes over and continues executing the business process definition. (In more complex processes, several tasks might need to be completed before process execution can resume.)
fr_fr: A ce moment, jBPM prends le contrôle et continue l'exécution de la définition du processus métier. (Dans des processus plus complexes, plusieurs tâches peuvent avoir besoin d'être réalisés avant que l'exécution du processus ne puisse reprendre.)
it_it: A questo punto jBPM assume il controllo e continua l'esecuzione della definizione del processo di business. (In processi più complessi, parecchi task potrebbero aver bisogno di essere completati prima che l'esecuzione del processo possa riprendere.)
ja_jp: この時点でjBPM はビジネスプロセス定義を引継ぎ、実行を続行します。 (さらに複雑なプロセスではプロセスの実行が可能となる前にタスクが完了される必要があります。)

source: Please refer to the jBPM documentation for a more thorough overview of the sophisticated features that jBPM provides for managing complex business processes.
fr_fr: Merci de vous référer à la document de jBPM pour un apperçu plus détaillé des fonctionnalités sophistiquées que le jBPM fournir pour la gestion des processus métier complexes.
it_it: Fare riferimento alla documentazione jBPM per una panoramica delle funzionalità che jBPM fornisce per la gestione di processi complessi di business.
ja_jp: 複雑なビジネスプロセスの管理を実現する各種の高度な機能の全体的な概要については jBPM ドキュメントを参照してください。
