Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Jms.po
Languages: fr_fr, it_it

source: <![CDATA[@Stateless @Name("paymentHandler") public class PaymentHandlerBean implements PaymentHandler { @In Timer timer; public Timer processScheduledPayment(Payment payment, @Expiration Date date) { //do some work! return timer; //note that return value is completely ignored } }]]>
it_it: <![CDATA[@Stateless @Name("paymentHandler") public class PaymentHandlerBean implements PaymentHandler { @In Timer timer; public Timer processScheduledPayment(Payment payment, @Expiration Date date) { //fai qualche lavoro! return timer; //notare che il valore di ritorno viene completamente ignorato } }]]>

source: Asynchronous methods cannot return any other value to the caller.
fr_fr: Les méthodes assynchrones peuvent retourner une autre valeur à l'appelant.
it_it: I metodi asincroni non possono ritornare al chiamante alcun altro valore.

source: Asynchronous methods with the Quartz Dispatcher
fr_fr: Les méhtodes assynchrones avec le Dispatcher Quartz
it_it: Metodi asincroni con il Quartz Dispatcher

source: The Quartz dispatcher (see earlier on how to install it) allows you to use the <literal>@Asynchronous</literal>, <literal>@Duration</literal>, <literal>@Expiration</literal>, and <literal>@IntervalDuration</literal> annotations as above. But it has some powerful additional features. The Quartz dispatcher supports three new annotations.
fr_fr: Le dispatcher Quartz (voir plus haut sur comment l'installer) vous permet d'utiliser les annotations <literal>@Asynchronous</literal>, <literal>@Duration</literal>, <literal>@Expiration</literal>, et <literal>@IntervalDuration</literal> vue au-dessus. Mais il y a quelques fonctionnalités additionnelles puissantes. Le dispatcher Quartz supporte les trois nouvelles annotations.
it_it: Il dispatcher Quartz (vedere indietro come viene installato) consente di usare le annotazioni <literal>@Asynchronous</literal>, <literal>@Duration</literal>, <literal>@Expiration</literal>, e <literal>@IntervalDuration</literal> come sopra. Ma possiede anche altre potenti caratteristiche. Il dispatcher Quartz supporta tre nuove annotazioni.

source: The <literal>@FinalExpiration</literal> annotation specifies an end date for the recurring task. Note that you can inject the <code>QuartzTriggerHandle</code>.
fr_fr: L'annotation <literal>@FinalExpiration</literal> indique une date de fin pour la tâche récurrante. Notez que vous pouvez injecter le <code>QuartzTriggerHandle</code>.
it_it: L'annotazione <literal>@FinalExpiration</literal> specifica una data finale per il task ricorrente. Si noti che si può iniettare il <code>QuartzTriggerHandle</code>.

source: <![CDATA[ @In QuartzTriggerHandle timer; // Defines the method in the "processor" component @Asynchronous public QuartzTriggerHandle schedulePayment(@Expiration Date when, @IntervalDuration Long interval, @FinalExpiration Date endDate, Payment payment) { // do the repeating or long running task until endDate } ... ... // Schedule the task in the business logic processing code // Starts now, repeats every hour, and ends on May 10th, 2010 Calendar cal = Calendar.getInstance (); cal.set (2010, Calendar.MAY, 10); processor.schedulePayment(new Date(), 60*60*1000, cal.getTime(), payment); ]]>
it_it: <![CDATA[ @In QuartzTriggerHandle timer; // Definisce il metodo nel componente "processor" @Asynchronous public QuartzTriggerHandle schedulePayment(@Expiration Date when, @IntervalDuration Long interval, @FinalExpiration Date endDate, Payment payment) { // esegui il task ripetitivo o long running fino a endDate } ... ... // Schedula il task nel codice che processa la business logic // Inizia adesso, ripete ogni ora, e finisce il 10 Maggio 2010 Calendar cal = Calendar.getInstance (); cal.set (2010, Calendar.MAY, 10); processor.schedulePayment(new Date(), 60*60*1000, cal.getTime(), payment); ]]>

source: Note that the method returns the <literal>QuartzTriggerHandle</literal> object, which you can use later to stop, pause, and resume the scheduler. The <literal>QuartzTriggerHandle</literal> object is serializable, so you can save it into the database if you need to keep it around for extended period of time.
fr_fr: Notez que la méthode retourne un objet <literal>QuartzTriggerHandle</literal>, qui vous pouvez utiliser pour arréter, mettre en pause et reprendre le plannificateur. L'objet <literal>QuartzTriggerHandle</literal> est sérialisable, ainsi vous pouvez le sauver dans la base de données si vous avez besoin de le conserver sous le coude pour une période de temps un peu plus longue.
it_it: Si noti che il metodo restituisce l'oggetto <literal>QuartzTriggerHandle</literal>, che si può usare per arrestare, mettere in pausa e ripristinare lo scheduler. L'oggetto <literal>QuartzTriggerHandle</literal> è serializzabile, e quindi può essere salvato nel database se deve essere presente per un periodo di tempo esteso.

source: <![CDATA[QuartzTriggerHandle handle = processor.schedulePayment(payment.getPaymentDate(), payment.getPaymentCron(), payment); payment.setQuartzTriggerHandle( handle ); // Save payment to DB // later ... // Retrieve payment from DB // Cancel the remaining scheduled tasks payment.getQuartzTriggerHandle().cancel(); ]]>
it_it: <![CDATA[QuartzTriggerHandle handle = processor.schedulePayment(payment.getPaymentDate(), payment.getPaymentCron(), payment); payment.setQuartzTriggerHandle( handle ); // Salva il pagamento nel DB // più tardi ... // Recupera il pagamento dal DB // Cancella i rimanenti task schedulati payment.getQuartzTriggerHandle().cancel(); ]]>

source: The <literal>@IntervalCron</literal> annotation supports Unix cron job syntax for task scheduling. For instance, the following asynchronous method runs at 2:10pm and at 2:44pm every Wednesday in the month of March.
fr_fr: L'annotation <literal>@IntervalCron</literal> supporte a syntaxe des tâches cron d'Unix pour la planification des tâches. Par exemple, la méthode assynchrone suivante s'exécutera à 14h10 et at 14h44 chaque mercredi du mois de Mars.
it_it: L'annotazione <literal>@IntervalCron</literal> supporta la sintassi Unix del cron job per la schedulazione dei task. Per esempio, il seguente metodo asincrono gira alle 2:10pm e alle 2:44pm ogni Mercoledì del mese di Marzo.

source: <![CDATA[ // Define the method @Asynchronous public QuartzTriggerHandle schedulePayment(@Expiration Date when, @IntervalCron String cron, Payment payment) { // do the repeating or long running task } ... ... // Schedule the task in the business logic processing code QuartzTriggerHandle handle = processor.schedulePayment(new Date(), "0 10,44 14 ? 3 WED", payment); ]]>
it_it: <![CDATA[ // Define the method @Asynchronous public QuartzTriggerHandle schedulePayment(@Expiration Date when, @IntervalCron String cron, Payment payment) { // esegui il task ripetitivo o long running } ... ... // Schedula il task nel codice che processa la business logic QuartzTriggerHandle handle = processor.schedulePayment(new Date(), "0 10,44 14 ? 3 WED", payment); ]]>

source: The <literal>@IntervalBusinessDay</literal> annotation supports invocation on the "nth Business Day" scenario. For instance, the following asynchronous method runs at 14:00 on the 2nd business day of each month. By default, it excludes all weekends and US federal holidays until 2010 from the business days.
fr_fr: L'annotation <literal>@IntervalBusinessDay</literal> supporte l'invocation du scénario "n-ième jour ouvré" . Par exemple, la méthode assynchrone suivante sera exécuté à 14h00 le deuxième jour ouvré de chaque mois. Par défaut, cela exclu tous les week-end et les vacances fédérales des USA jusqu'en 2010 des jours ouvrés.
it_it: L'annotazione <literal>@IntervalBusinessDay</literal> supporta l'invocazione sullo scenario di "Giorno Lavorativo ennesimo". Per esempio il seguente metodo asincrono gira alle ore 14.00 del secondo giorno lavorativo di ogni mese. Di default esclude tutti i weekend e le festività federali americane fino al 2010 dai giorni lavorativi.

source: <![CDATA[ // Define the method @Asynchronous public QuartzTriggerHandle schedulePayment(@Expiration Date when, @IntervalBusinessDay NthBusinessDay nth, Payment payment) { // do the repeating or long running task } ... ... // Schedule the task in the business logic processing code QuartzTriggerHandle handle = processor.schedulePayment(new Date(), new NthBusinessDay(2, "14:00", WEEKLY), payment); ]]>
it_it: <![CDATA[ // Define the method @Asynchronous public QuartzTriggerHandle schedulePayment(@Expiration Date when, @IntervalBusinessDay NthBusinessDay nth, Payment payment) { // esegui il task ripetitivo o long running } ... ... // Schedula il task nel codice che processa la business logic QuartzTriggerHandle handle = processor.schedulePayment(new Date(), new NthBusinessDay(2, "14:00", WEEKLY), payment); ]]>

source: The <literal>NthBusinessDay</literal> object contains the configuration of the invocation trigger. You can specify more holidays (e.g., company holidays, non-US holidays etc.) via the <literal>additionalHolidays</literal> property.
fr_fr: L'objet <literal>NthBusinessDay</literal> contient la configuration du déclencheur de l'invocation. Vous pouvez indiquer plus de vacances (par exemple, les vacances spécifiques à l'entreprise, des vacances autre que pour les USA, etc.) via la propriété <literal>additionalHolidays</literal>.
it_it: L'oggetto <literal>NthBusinessDay</literal> contiene la configurazione del trigger d'invocazione. Si possono specificare più vacanze (esempio, vacanze aziendali, festività non-US, ecc.) attraverso la proprietà <literal>additionalHolidays</literal>.

source: The <literal>@IntervalDuration</literal>, <literal>@IntervalCron</literal>, and <literal>@IntervalNthBusinessDay</literal> annotations are mutually exclusive. If they are used in the same method, a <literal>RuntimeException</literal> will be thrown.
fr_fr: Les annotations <literal>@IntervalDuration</literal>, <literal>@IntervalCron</literal>, et <literal>@IntervalNthBusinessDay</literal> sont mutuellement exclusives. Si elles sont utilisées sur la même méthode, une <literal>RuntimeException</literal> sera déclenchée.
it_it: Le annotazioni <literal>@IntervalDuration</literal>, <literal>@IntervalCron</literal>, e <literal>@IntervalNthBusinessDay</literal> sono mutualmente esclusive. Se usate nello stesso metodo, verrà lanciata una <literal>RuntimeException</literal>.

source: Asynchronous events
fr_fr: Les évènements assynchrones
it_it: Eventi asincroni

source: Component-driven events may also be asynchronous. To raise an event for asynchronous processing, simply call the <literal>raiseAsynchronousEvent()</literal> method of the <literal>Events</literal> class. To schedule a timed event, call the <literal>raiseTimedEvent()</literal> method, passing a <emphasis>schedule</emphasis> object (for the default dispatcher or timer service dispatcher, use <literal>TimerSchedule</literal>). Components may observe asynchronous events in the usual way, but remember that only the business process context is propagated to the asynchronous thread.
fr_fr: Les évènements conducteurs de composants peuvent aussi être assynchrone. Pour déclencher un évènement pour une exécution assynchrone, un simple appel à la méthode <literal>raiseAsynchronousEvent()</literal> de la classe <literal>Events</literal>. Pour programmer un évènement dans le temps, l'appel à la méthode <literal>raiseTimedEvent()</literal>, en passant un objet <emphasis>schedule</emphasis> (pour le dispatcher par défaut ou pour le dispatcher de service de temps, utilisez <literal>TimerSchedule</literal>). Les composants peuvent observer des évènements assynchrones de la façon usuelle, mais souvenez vous que seule le contexte du processus métier est propagé dans le processus assynchrone.
it_it: Gli eventi guidati dai componenti possono essere asincroni. Per sollevare un evento da processare in modo asincrono, occorre semplicemente chiamare il metodo <literal>raiseAsynchronousEvent()</literal> della classe <literal>Events</literal>. Per schedulare un evento a tempo, chiamare il metodo <literal>raiseTimedEvent()</literal> passando un oggetto <emphasis>schedule</emphasis> (per il dispatcher di default o il dispatcher del servizio timer, usare <literal>TimerSchedule</literal>). I componenti possono osservare eventi asincroni nel solito modo, ma si tenga presente che solo il contesto business process viene propagato nel thread asincrono.

source: Handling exceptions from asynchronous calls
fr_fr: La gestion des exceptions pour les appels assynchrones
it_it: Gestione delle eccezione da chiamate asincrone

source: Each asynchronous dispatcher behaves differently when an exception propagates through it. For example, the <literal>java.util.concurrent</literal> dispatcher will suspend further executions of a call which repeats, and the EJB3 timer service will swallow the exception. Seam therefore catches any exception which propagates out of the asynchronous call before it reaches the dispatcher.
fr_fr: Chaque dispatcher assynchrone fonctionne différemment quand une exception est propagé au travers. Par exemple, le dispatcher <literal>java.util.concurrent</literal> suspendra de future exécutions d'un appel qui se répète, et le service timer EJB3 avalera l'exception. Seam cependant capture toute les exceptions qui seront propagées à l'extérieur de l'appel assynchrone avant qu'elle n'atteigne le dispatcher.
it_it: Ogni dispatcher asincrono si comporta in modo differente quando attraverso di esso viene propagata un'eccezione. Per esempio, il dispatcher <literal>java.util.concurrent</literal> sospenderà ogni altra esecuzione di una chiamata che si ripete, ed il servizio timer EJB3 inghiottirà quest'eccezione. Quindi Seam cattura ogni eccezione che si propaga fuori da una chiamata asincrona prima che questa raggiunga il dispatcher.

source: By default, any exception which propagates out from an asynchronous execution will be caught and logged at error level. You can customize this behavior globally by overriding the <literal>org.jboss.seam.async.asynchronousExceptionHandler</literal> component:
fr_fr: Par défaut, tout exception qui sera propagée à l'extérieur de l'exécution assynchrone sera intercepté et enregistré dans le journal au niveau erreur. Vous pouvez personnaliser cette fonctionnalité globallement en surchargeant le composant <literal>org.jboss.seam.async.asynchronousExceptionHandler</literal>:
it_it: Di default ogni eccezione che si propaga fuori da un'esecuzione asincrona verrà catturata e loggata come errore. Si può personalizzare questo comportamento facendo override del componente <literal>org.jboss.seam.async.asynchronousExceptionHandler</literal>.

source: Here, for example, using <literal>java.util.concurrent</literal> dispatcher, we inject its control object and cancel all future invocations when an exception is encountered
fr_fr: Voici, par exemple, en utilisant le dispatcher <literal>java.util.concurrent</literal>, nous l'injectons l'objet de controle et annulons toute invocation future quand une exception est rencontrée
it_it: Per esempio, usando il dispatcher <literal>java.util.concurrent</literal>, viene iniettato il suo oggetto di controllo e vengono cancellate tutte le future invocazioni quando si incontra un'eccezione.

source: You can also alter this behavior for an individual component by implementing the method <literal>public void handleAsynchronousException(Exception exception);</literal> on the component. For example:
fr_fr: Vous pouvez aussi altérer cette fonctionnalité pour un seul composant en implémentant la méthode <literal>public void handleAsynchronousException(Exception exception);</literal> du composant. Par exemple:
it_it: Si può alterare questo comportamento per un componente individuale, implementando sul componente il metodo <literal>public void handleAsynchronousException(Exception exception);</literal>. Per esempio:
