Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Jms.po
Languages: fr_fr, it_it

source: Asynchronicity and messaging
fr_fr: Asynchronisme et messagerie
it_it: Asincronicità e messaggistica

source: Seam makes it very easy to perform work asynchronously from a web request. When most people think of asynchronicity in Java EE, they think of using JMS. This is certainly one way to approach the problem in Seam, and is the right way when you have strict and well-defined quality of service requirements. Seam makes it easy to send and receive JMS messages using Seam components.
fr_fr: Seam rends vraiment très simple de réaliser du travail de manière asynchrone depuis une requête web. Quand la plus part des gens pensent asynchronisme en Java EE, ils pensent à l'utilisation de JMS. C'est certainement un bonne façon d'approche le problème avec Seam, et c'est la bonne raison quand vous avez une qualité de service stricte et bien définie dans les prérequis de service. Seam rends facile d'envoyer et de recevoir des messages JMS en utilisant les composants de Seam.
it_it: Seam semplifica molto l'esecuzione di lavori asincroni da una richiesta web. Quando la maggior parte delle persone pensa all'asincronicità in Java EE, pensa all'uso di JMS. Questo è certamente un modo per approcciare il problema in Seam, ed è quello giusto quando si hanno dei requisiti di qualità di servizio molto stringenti e ben definiti. Seam semplifica l'invio e la ricezione di messaggi JMS usando i componenti Seam.

source: But for cases when you are simply want to use a worker thread, JMS is overkill. Seam layers a simple asynchronous method and event facility over your choice of <emphasis>dispatchers</emphasis>:
fr_fr: Mais pour la plus part des cas d'utilisation, JSM est excessif. Les couches de Seam une méthode symple asynchrone et une fonction évènementiel par dessus votre choix d'un <emphasis>dispatchers</emphasis>:
it_it: Ma per molti casi d'uso, JMS è eccessivo. Seam aggiunge come nuovo layer un semplice metodo asincrono ed un meccanismo d'eventi nella scelta del <emphasis>dispatcher</emphasis>:

source: <literal>java.util.concurrent.ScheduledThreadPoolExecutor</literal> (by default)
fr_fr: <literal>java.util.concurrent.ScheduledThreadPoolExecutor</literal> (par défaut)
it_it: <literal>java.util.concurrent.ScheduledThreadPoolExecutor</literal> (di default)

source: the EJB timer service (for EJB 3.0 environments)
fr_fr: le service de temps EJB (pour les environements EJB 3.0)
it_it: Il servizio EJB timer (per ambienti EJB 3.0)

source: This chapter first covers how to leverage Seam to simplify JMS and then explains how to use the simpler asynchronous method and event facility.
fr_fr: Ce chapitre couvre en premier lieu comment exploiter Seam pour simplifier JMS et ensuite explique comment utiliser la méthode assynchrone la plus simple et la fonction évènementielle.
it_it: Questo capitolo innanzitutto spiega come sfruttare Seam per semplificare JMS e quindi spiega come usare il più semplice metodo asincrono e facility evento.

source: Messaging in Seam
fr_fr: Messagerie dans Seam
it_it: Messaggistica in Seam

source: Seam makes it easy to send and receive JMS messages to and from Seam components. Both the message publisher and the message receiver can be Seam components.
fr_fr: Seam rends facile d'envoyer et de recevoir des messages JMS depuis et vers des composants de Seam. A la fois le publiant du message et le destinataire du message peuvent être des composants de Seam.
it_it: Seam facilita l'invio e la ricezione di messaggi JMS da e verso componenti Seam. Entrambi il publisher ed il receiver del messaggio possono essere componenti Seam.

source: You'll first learn to setup a queue and topic message publisher and then look at an example that illustrates how to perform the message exchange.
fr_fr: Vous allez en premier apprendre à configurer une file d'attente et un publiant de sujet de message et ensuite regarder les exemples qui illustre comment réaliser l'échange de messages.
it_it: Si apprenderà come configurare una coda ed un publisher di messaggio topic e quindi si guarderà un esempio che illustri come eseguire uno scambio di messaggi.

source: Configuration
fr_fr: La configuration
it_it: Configurazione

source: To configure Seam's infrastructure for sending JMS messages, you need to tell Seam about any topics and queues you want to send messages to, and also tell Seam where to find the <literal>QueueConnectionFactory</literal> and/or <literal>TopicConnectionFactory</literal>.
fr_fr: Pour configurer l'infrastructure de Seam pour l'expédition de messages JMS, vous avez besoin d'indiquer à Seam à propos de quel sujets et de quelle file d'attente vous voulez que les messages soient envoyés et aussi dire à Seam où il peut trouvrer le <literal>QueueConnectionFactory</literal> et/ou le <literal>TopicConnectionFactory</literal>.
it_it: Per configurare l'infrastruttura di Seam alla spedizione di messaggi JMS, occorre dire a Seam a quali topic e code si vuole spedire i messaggi, ed inoltre serve dire dove trovare <literal>QueueConnectionFactory</literal> e/o <literal>TopicConnectionFactory</literal>.

source: Seam defaults to using <literal>UIL2ConnectionFactory</literal> which is the usual connection factory for use with JBossMQ. If you are using some other JMS provider, you need to set one or both of <literal>queueConnection.queueConnectionFactoryJndiName</literal> and <literal>topicConnection.topicConnectionFactoryJndiName</literal> in <literal>seam.properties</literal>, <literal>web.xml</literal> or <literal>components.xml</literal>.
fr_fr: Seam utilisant par défaut Seam <literal>UIL2ConnectionFactory</literal> qui est une fabrique de connection usuelle à utiliser avec JBossMQ. Si vous voulez utiliser un autre fournisseur de JMS, vous avez besoin de définir un ou deux <literal>queueConnection.queueConnectionFactoryJndiName</literal> et <literal>topicConnection.topicConnectionFactoryJndiName</literal> dans <literal>seam.properties</literal>, <literal>web.xml</literal> ou <literal>components.xml</literal>.
it_it: Di default Seam usa <literal>UIL2ConnectionFactory</literal> che è la connection factory consueta per l'uso con JBossMQ. Se si impiegano altri provider JSM, occorre impostare uno o entrambi i <literal>queueConnection.queueConnectionFactoryJndiName</literal> e <literal>topicConnection.topicConnectionFactoryJndiName</literal> in <literal>seam.properties</literal>, <literal>web.xml</literal> o <literal>components.xml</literal>.

source: You also need to list topics and queues in <literal>components.xml</literal> to install Seam managed <literal>TopicPublisher</literal>s and <literal>QueueSender</literal>s:
fr_fr: ous avez aussi besoin de lister les sujets et les files d'attentes dans <literal>components.xml</literal> pour installer <literal>TopicPublisher</literal>s et <literal>QueueSender</literal> gérés par Seam:
it_it: Inoltre in <literal>components.xml</literal> occorre elencare i topic e le code per installare i <literal>TopicPublisher</literal> ed i <literal>QueueSender</literal> gestiti da Seam:

source: Sending messages
fr_fr: L'expédition de messages
it_it: Spedire messaggi

source: Now, you can inject a JMS <literal>TopicPublisher</literal> and <literal>TopicSession</literal> into any Seam component to publish an object to a topic:
fr_fr: Maintenant, vous pouvez injecter un <literal>TopicPublisher</literal> et un <literal>TopicSession</literal> de JMS dans chaque composant de Seam pour publier un objet dans un sujet:
it_it: Ora è possibile iniettare in qualsiasi componente un <literal>TopicPublisher</literal> e un <literal>TopicSession</literal> JMS per publicare un oggetto in un topic:

source: or to a queue:
fr_fr: Ou, dans une file d'attente:
it_it: O ad una coda:

source: Receiving messages using a message-driven bean
fr_fr: Réception des messages en utilisant tout bean conducteur de message
it_it: Ricezione dei messaggi usando un bean message-driven

source: You can process messages using any EJB 3 message-driven bean. The MDB can even be a Seam component, in which case it's possible to inject other event- and application- scoped Seam components. Here's an example of the payment receiver, which delegates to a payment processor.
fr_fr: Vous pouvez manipuler les messages en utilisant tout EJB3 conducteur de message. Les beans conducteur de message peuvent même être des composants de Seam et dans ce cas il est possible d'injecter d'autres évènements et d'autres composants de Seam d'étendue applicatif. Voici un exemple de la réception d'un paiement qui délègue vers un processude paiement.
it_it: I messaggi possono essere processati usando un qualsiasi bean message driven EJB3. I bean message-drive possono essere anche componenti Seam, in qualcaso è possibile iniettare altri componenti Seam aventi scope evento e applicazione. Ecco un esempio di ricevitore pagamento, che delega ad un payement processor.

source: You'll likely need to set the create attribute on the <literal>@In</literal> annotation to true (i.e. create = true) to have Seam create an instance of the component being injected. This isn't necessary if the component supports auto-creation (e.g., it's annotated with <literal>@Autocreate</literal>).
fr_fr: Vous allez avoir besoin de créer un attribut avec l'annotation <literal>@In</literal> à vrai (i.e. create = true) pour faire que Seam créer une instance du composant injecté. Ce n'est pas nécéssaire si le composant dispose de l'auto-création (autrement dit, s'il est annoté avec <literal>@Autocreate</literal>).
it_it: Probabilmente servirà impostare a true l'attributo create nell'annotazione <literal>@In</literal> (cioè create=true) per fare creare a Seam un'istanza del componente da iniettare. Questo non è necessario se il componente supporta l'atuocreazione (ad esempio se è annotato con <literal>@Autocreate</literal>).

source: First, create an MDB to receive the message.
fr_fr: En premier lieu, créez un MDB pour recevoir le message.
it_it: Per prima cosa creare un MDB per ricevere il messaggio.

source: Then, implement the Seam component to which the receiver delegates processing of the payment.
fr_fr: Ensuite, implémentz le composant de Seam vers le quel la réception de la délégation du processus de paiement.
it_it: Quindi implementare il componente Seam a cui il ricevitore delega il processo di pagamento.

source: <![CDATA[@Name("paymentProcessor") public class PaymentProcessor { @In private EntityManager entityManager; public void processPayment(Payment payment) { // perhaps do something more fancy entityManager.persist(payment); } }]]>
it_it: <![CDATA[@Name("paymentProcessor") public class PaymentProcessor { @In private EntityManager entityManager; public void processPayment(Payment payment) { // fai qualcosa di eccezionale entityManager.persist(payment); } }]]>

source: If you are going to be performing transaction operations in your MDB, you should ensure that you are working with an XA datasource. Otherwise, it won't be possible to rollback database changes if the database transaction commits and a subsequent operation being performed by the message fails.
fr_fr: Si vous essayeez de réaliser des opérations de transactions dans votre MDB, vous devriez vous assurer que vous travailler avec une source de données XA.Sinon, il ne sera pas possible d'invalider les modifications de la base de données si la validation de la transaction de la base de données et que les opérations sousjacentes qui sont réalisées par le message échouent.
it_it: Se si stanno per eseguire delle operazioni di transazione nel MDB, occorre assicurarsi di lavorare con un datasource XA. Altrimenti non sarà possibile eseguire il rollback dei cambiamenti al database se viene fatto il commit della transazione e fallisce l'operazione successiva eseguita dal messaggio.

source: Receiving messages in the client
fr_fr: La réception des message dans le client
it_it: Ricezione dei messaggi nel client

source: Seam Remoting lets you subscribe to a JMS topic from client-side JavaScript. This is described in <xref linkend="remoting"/>.
fr_fr: Le Seam Remoting vous permet de vous abonner à un sujet JMS depuis le JavaScript côté client. Ceci est décrit dans <xref linkend="remoting"/>.
it_it: Seam Remoting consente di sottoscrivere un topic JMS lato client JavaScript. Questo viene descritto in <xref linkend="remoting"/>.

source: Asynchronicity
fr_fr: Asynchronisme
it_it: Asincronicità

source: Asynchronous events and method calls have the same quality of service expectations as the underlying dispatcher mechanism. The default dispatcher, based upon a <literal>ScheduledThreadPoolExecutor</literal> performs efficiently but provides no support for persistent asynchronous tasks, and hence no guarantee that a task will ever actually be executed. If you're working in an environment that supports EJB 3.0, and add the following line to <literal>components.xml</literal>:
fr_fr: Les évènements assynchrones et les appels de méthodes ont la même attente en qualité de services que le mécanisme de distribution sousjacent. Le distributeur par défaut, basé sur un <literal>ScheduledThreadPoolExecutor</literal> réalise de manière efficace mais ne fournissent pas de support pour les tâches assynchrones persistances et ne donne aucune garantie que la tâche ne sera réellement exécutée. Si vous travaillez dans un environnement qui supporte EJB 3.0 et ajoutez la ligne suivante à <literal>components.xml</literal>:
it_it: Eventi asincroni e chiamate a metodi hanno le stesse aspettative di qualità di servizio del meccanismo sottostante di dispatcher. Il dispatcher di default, basato su <literal>ScheduledThreadPoolExecutor</literal> opera efficientemente ma non fornisce alcun supporto ai task asincroni di persistenza, e quindi non garantisce che un task verrà effettivamente eseguito. Se si lavora in un ambiente che supporta EJB 3.0 e si aggiunge la seguente linea a <literal>components.xml</literal>:

source: then your asynchronous tasks will be processed by the container's EJB timer service. If you're not familiar with the Timer service, don't worry, you don't need to interact with it directly if you want to use asynchronous methods in Seam. The important thing to know is that any good EJB 3.0 implementation will have the option of using persistent timers, which gives some guarantee that the tasks will eventually be processed.
fr_fr: ainsi votre tâche assynchrone sera réalisée par le service de temps EJB du containeur. Si vous n'êtes pas familier avec le service Timer, ne vous inquiétez pas, vous n'allez pas voir besoin d'interragir directement si vous vouler utiliser les méthodes de manière assynchrone dans Seam. La chose importante à savoir et que tout bonne implémentation de EJB 3.0 aura l'option d'utiliser le cadenseur de persistance ce qui donne quelques garanties que la tâches sera éventuellement exécutée.
it_it: allora i task asincroni verranno processati dal servizio EJB timer del container. Se non si è familiari come il servizio Timer, nessuna paura, non si deve interagire direttamente con esso per usare i metodi asincroni in Seam. La cosa importante da sapere è che qualsiasi buona implementazione di EJB 3.0 avrà l'opzione di usare i timer di persistenza, che danno garanzia che i task verranno processati.

source: Another alternative is to use the open source Quartz library to manage asynchronous method. You need to bundle the Quartz library JAR (found in the <literal>lib</literal> directory) in your EAR and declare it as a Java module in <literal>application.xml</literal>. The Quartz dispatcher may be configured by adding a Quartz property file to the classpath. It must be named <literal>seam.quartz.properties</literal>. In addition, you need to add the following line to <literal>components.xml</literal> to install the Quartz dispatcher.
fr_fr: Une autre alternative est d'utiliser la bibliothèque opensource Quartz pour gérer la méthode assynchrone. Vous avez besoin de fournir le JAR de la bibliothèque Quartz (à mettre dans le dossier <literal>lib</literal>) dans votre EAR et de le déclarer dans un module Java dans <literal>application.xml</literal>. Le distributeur Quartz peut être configuré en ajoutant un fichier de propriété Quartz dans le chemin des clases. Il doit être dénomé <literal>seam.quartz.properties</literal>. De plus, vous allez avoir besoin d'ajouter la ligne suivante à <literal>components.xml</literal> pour installer le distributeur Quartz.
it_it: Un'altra alternativa è quella di usare la libreria open source Quartz per gestire il metodo asincrono. Occorre incorporare il JAR della libreria Quartz (che si trova nella directory <literal>lib</literal>) nell'EAR e dichiararla come modulo Java in <literal>application.xml</literal>. Il dispatcher Quartz può essere configurato aggiungendo un file di proprietà Quartz al classpath. Deve essere nominato <literal>seam.quartz.properties</literal>. Inoltre occorre aggiungere la seguente linea a <literal>components.xml</literal> per installare il dispatcher Quartz.

source: The Seam API for the default <literal>ScheduledThreadPoolExecutor</literal>, the EJB3 <literal>Timer</literal>, and the Quartz <literal>Scheduler</literal> are largely the same. They can just "plug and play" by adding a line to <literal>components.xml</literal>.
fr_fr: L'API de Seam par défaut <literal>ScheduledThreadPoolExecutor</literal>, le <literal>Timer</literal> EJB3, et le <literal>Scheduler</literal> Quartzz sont largement identique. Ils peuvent simplement être "plug and play" en ajoutant une ligne à <literal>components.xml</literal>.
it_it: L'API di Seam per il <literal>ScheduledThreadPoolExecutor</literal> di default, il <literal>Timer</literal> EJB3, e lo <literal>Scheduler</literal> Quartz sono più o meno la stessa cosa. Vengono azionati come "plug and play" aggiungendo una linea a <literal>components.xml</literal>.

source: Asynchronous methods
fr_fr: Le sméthodes assynchrones
it_it: Metodi asincroni

source: In simplest form, an asynchronous call just lets a method call be processed asynchronously (in a different thread) from the caller. We usually use an asynchronous call when we want to return an immediate response to the client, and let some expensive work be processed in the background. This pattern works very well in applications which use AJAX, where the client can automatically poll the server for the result of the work.
fr_fr: Dans le formulaire le plus simple, un appel assynchrone permet simplement un appel d'une méthode être assynchrone (dans un processus d'exécution déifférent) depuis l'appelant. Nous utilisons habituellement un appel assynchrone quand nous voulons retourner une réponse immédaite au client, et avoir quelques travaux couteux être réalisé en arrière plan. Ce modèle fonctionne très bien dans les applications qui utilisent AHAX? quand le client peut être automatiquement questionner le serveur pour le résultat du travail.
it_it: Nella forma più semplice, una chiamata asincrona consente che una chiamata di metodo venga processata asincronicamente (in un thread differente) dal chiamante. Solitamente si usa una chiamata asincrona quando si vuole ritornare una risposta immediata al client, e si lascia in background il lavoro dispendioso da processare. Questo pattern funziona molto bene nelle applicazioni che usano AJAX, dove il client può automaticamente interrogare il server per ottenere il risultato del lavoro.

source: For EJB components, we annotate the local interface to specify that a method is processed asynchronously.
fr_fr: Pour les composants EJB, nous annotons l'interface local pour spécifier qu'une méthode est un processus assynchrone.
it_it: Per i componenti EJB si annota l'interfaccia locale per specificare che un metodo viene processato asincronicamente.

source: (For JavaBean components we can annotate the component implementation class if we like.)
fr_fr: (Pour les composants JavaBean nous pouvons annoter la classe d'implémentation du composant si vous voulez.)
it_it: (Per i componenti JavaBean, se si vuole, si può annotare la classe d'implementazione del componente.)

source: The use of asynchronicity is transparent to the bean class:
fr_fr: L'utilisation de l'assynchronisme est transparente à la classe du bean;
it_it: L'uso dell'asincronicità è trasparente alla classe bean:

source: <![CDATA[@Stateless @Name("paymentHandler") public class PaymentHandlerBean implements PaymentHandler { public void processPayment(Payment payment) { //do some work! } }]]>
it_it: <![CDATA[@Stateless @Name("paymentHandler") public class PaymentHandlerBean implements PaymentHandler { public void processPayment(Payment payment) { //fai qualche lavoro! } }]]>

source: And also transparent to the client:
fr_fr: et aussi transparent pour le client:
it_it: E è anche trasparente al client:

source: The asynchronous method is processed in a completely new event context and does not have access to the session or conversation context state of the caller. However, the business process context <emphasis>is</emphasis> propagated.
fr_fr: La méthode assynchrone est exécuté dans un contexte d'évènement complètement nouveau et n'a pas d'accès à la session ou l'état du contexte de conversation de l'appelant. Cependant le contexte du processus métier <emphasis>est</emphasis> propagé.
it_it: Il metodo asincrono viene processato in un contesto eventi completamente nuovo e non ha accesso allo stato del contesto sessione o conversazione del chiamante. Comunque, il contesto di processo di business <emphasis>viene</emphasis> propagato.

source: Asynchronous method calls may be scheduled for later execution using the <literal>@Duration</literal>, <literal>@Expiration</literal> and <literal>@IntervalDuration</literal> annotations.
fr_fr: Les appels de méthodes assynchrone peuvent être programmé pour une exécution décalée dans le temps en utilisant les annotaiotns <literal>@Duration</literal>, <literal>@Expiration</literal> et <literal>@IntervalDuration</literal>.
it_it: Le chiamate del metodo asincrono possono essere schedulate per un'esecuzione successiva usando le annotazioni <literal>@Duration</literal>, <literal>@Expiration</literal> e <literal>@IntervalDuration</literal>.

source: Both client and server may access the <literal>Timer</literal> object associated with the invocation. The <literal>Timer</literal> object shown below is the EJB3 timer when you use the EJB3 dispatcher. For the default <literal>ScheduledThreadPoolExecutor</literal>, the returned object is <literal>Future</literal> from the JDK. For the Quartz dispatcher, it returns <literal>QuartzTriggerHandle</literal>, which we will discuss in the next section.
fr_fr: A la fois le client et le serveur peuvent avoir accès à l'objet <literal>Timer</literal> associé avec l'invocation. L'objet <literal>Timer</literal> visible ci-dessous est un timer EJB3 quand vous utilisez le dispatcher EJB3. Par défaut avec <literal>ScheduledThreadPoolExecutor</literal>, l'objet retourné est <literal>Future</literal> du JDK. Pour le dispatcher Quartz, il retourne le <literal>QuartzTriggerHandle</literal>, qui sera vu dans la prochaine section.
it_it: Entrambi il server ed il client possono accedere all'oggetto <literal>Timer</literal> associato all'invocazione. L'oggetto <literal>Timer</literal> mostrato sotto è il timer EJB3 quando viene usato il dispatcher EJB3. Per il <literal>ScheduledThreadPoolExecutor</literal> di default, l'oggetto restituito è <literal>Future</literal> di JDK. Per il dispatcher Quartz, viene ritornato <literal>QuartzTriggerHandle</literal>, che verrà discusso nella prossima sessione.
