Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Remoting.po
Languages: it_it, ja_jp

source: Seam provides a convenient method of remotely accessing components from a web page, using AJAX (Asynchronous Javascript and XML). The framework for this functionality is provided with almost no up-front development effort - your components only require simple annotating to become accessible via AJAX. This chapter describes the steps required to build an AJAX-enabled web page, then goes on to explain the features of the Seam Remoting framework in more detail.
it_it: Seam fornisce un metodo per accedere in modo remoto i componenti da una pagina web, usando AJAX (Asynchronous Javascript and XML). Il framework per questa funzionalità viene fornito con quasi nessuno sforzo di sviluppo - i componenti richiedono solamente una semplice annotazione per diventare accessibile via AJAX. Questo capitolo descrive i passi richiesti per costruire una pagina web abilitata a AJAX, poi spiega con maggior dettaglio le caratteristiche del framework Seam Remoting.
ja_jp: Seam は、 Web ページから AJAX (Asynchronous Javascript and XML) を使用してコンポーネントにリモートアクセスする便利な方法を提供します。 この機能を実現する Seam では、 開発時に労力がかからないようになっています - コンポーネントに必要なものは、 AJAX を通じてアクセス可能とするための単純なアノテーションだけです。 この章では、 AJAX 可能な Web ページを作るために必要なステップについて述べ、 そしてSeam Remoting フレームワークの機能についても詳しく説明します。

source: Configuration
it_it: Configurazione
ja_jp: 設定

source: To use remoting, the Seam Resource servlet must first be configured in your <literal>web.xml</literal> file:
it_it: Per usare remoting, il resource servlet di Seam deve essere innanzitutto configurato nel file <literal>web.xml</literal>:
ja_jp: リモーティングの機能を使用するには、まず<literal>web.xml</literal>ファイル内でSeam Resourceサーブレットを設定する必要があります。

source: The next step is to import the necessary Javascript into your web page. There are a minimum of two scripts that must be imported. The first one contains all the client-side framework code that enables remoting functionality:
it_it: Il passo successivi è importare il Javascript necessario nella propria pagina web. Ci sono un minimo di due script da importare. Il primo contiene tutto il codice del framework lato client che abilita le funzionalità di remoting:
ja_jp: 次のステップは、Webページに必要なJavaScriptをインポートすることです。インポートすべきスクリプトが最低二つあります。最初の一つは、リモーティングの機能を有効にする、クライアントサイドフレームワークのすべてのコードを含みます:

source: The second script contains the stubs and type definitions for the components you wish to call. It is generated dynamically based on the local interface of your components, and includes type definitions for all of the classes that can be used to call the remotable methods of the interface. The name of the script reflects the name of your component. For example, if you have a stateless session bean annotated with <literal>@Name("customerAction")</literal>, then your script tag should look like this:
it_it: Il secondo script contiene gli stub e le definizioni tipo per i componenti da chiamare. Viene generato dinamicamente basandosi sull'interfaccia locale dei propri componenti, ed include le definizioni tipo per tutte le classi che possono essere usate per chiamare i metodi remoti dell'interfaccia. Il nome dello script riflette il nome del componente. Per esempio se si ha un bean di sessione stateless annotato con <literal>@Name("customerAction")</literal>, allora il tag dello script dovrebbe essere simile a:
ja_jp: 二つ目のスクリプトは、 呼び出したいコンポーネントに対するスタブと型定義を含みます。 それはコンポーネントのローカルインタフェースをもとにして動的に生成され、 インタフェースのリモートメソッドを呼び出す際に使用されるすべてのクラスに対する型定義を内包しています。 スクリプトの名前はコンポーネントの名前が反映されます。 例えば、 <literal>@Name("customerAction")</literal> というアノテーション付きのステートレスセッション Bean を持つ場合、 スクリプトタグは以下のようになります。

source: If you wish to access more than one component from the same page, then include them all as parameters of your script tag:
it_it: Se si vuole accedere a più di un componente dalla stessa pagina, allora li si includa tutti come parametri nel tag script:
ja_jp: 同じページから一つ以上のコンポーネントにアクセスしたい場合は、スクリプトタグのパラメータとしてそれらをすべて含めます。

source: Alternatively, you may use the <literal>s:remote</literal> tag to import the required Javascript. Separate each component or class name you wish to import with a comma:
it_it: In alternativa si può usare il tag <literal>s:remote</literal> per importare il Javascript richiesto. Si separi ciascun componente o nome di classe che si vuole importare con una virgola:
ja_jp: 代わりに、 必要な Javascript のインポートに <literal>s:remote</literal> を使用することもできます。 インポートするコンポーネントあるいはクラス名をそれぞれコンマで区切ります。

source: The "Seam" object
it_it: L'oggetto "Seam"
ja_jp: "Seam"オブジェクト

source: Client-side interaction with your components is all performed via the <literal>Seam</literal> Javascript object. This object is defined in <literal>remote.js</literal>, and you'll be using it to make asynchronous calls against your component. It is split into two areas of functionality; <literal>Seam.Component</literal> contains methods for working with components and <literal>Seam.Remoting</literal> contains methods for executing remote requests. The easiest way to become familiar with this object is to start with a simple example.
it_it: L'interazione lato client con i componenti viene eseguita tutta tramite l'oggetto Javascript <literal>Seam</literal>. Quest'oggetti è definito in <literal>remote.js</literal>, e lo si userà per fare chiamate asincrone verso il componente. E' suddiviso in due aree di funzionalità; <literal>Seam.Component</literal> contiene metodi per lavorare con i componenti e <literal>Seam.Remoting</literal> contiene metodi per eseguire le richieste remote. La via più facile per diventare familiare con quest'oggetto è cominciare con un semplice esempio.
ja_jp: クライアント側からのコンポーネントとのやりとりは、 すべて <literal>Seam</literal> Javascript オブジェクト経由で行われます。 このオブジェクトは <literal>remote.js</literal> に定義され、 コンポーネントに対する非同期呼び出しに使用します。 オブジェクトは 二つの機能に区分されます。 コンポーネントと連携するメソッドを含む <literal>Seam.Component</literal> そして、リモート要求を実行するメソッドを含む <literal>Seam.Remoting</literal> です。 このオブジェクトに精通する一番容易な方法は、 簡単なサンプルから始めることです。

source: A Hello World example
it_it: Esempio Hello World
ja_jp: Hello World サンプル

source: Let's step through a simple example to see how the <literal>Seam</literal> object works. First of all, let's create a new Seam component called <literal>helloAction</literal>.
it_it: Si cominci con un semplice esempio per vedere come funziona l'oggetto <literal>Seam</literal>
ja_jp: <literal>Seam</literal> オブジェクトがどのように動作するかを見るために、 簡単なサンプルを通じて一歩を踏み出してみましょう。 まず最初に、<literal>helloAction</literal> と呼ばれる新しい Seam コンポーネントを作成しましょう。

source: You also need to create a local interface for our new component - take special note of the <literal>@WebRemote</literal> annotation, as it's required to make our method accessible via remoting:
it_it: E' anche necessario creare un'interfaccia locale per il nuovo componente - tenete a mente in particolare l'annotazione <literal>@WebRemote</literal>, poiché è necessaria a rendere un metodo accessibile via remoting:
ja_jp: 新しいコンポーネント用にローカルインタフェースも生成する必要があります。 <literal>@WebRemote</literal> アノテーションに特に注意してください。 リモートによるメソッドへのアクセスを可能とするために必要です。

source: That's all the server-side code we need to write.
it_it: Quello è tutto il codice da scrivere.

source: If you are performing a persistence operation in the method marked <literal>@WebRemote</literal> you will also need to add a <literal>@Transactional</literal> annotation to the method. Otherwise, your method would execute outside of a transaction without this extra hint.That's because unlike a JSF request, Seam does not wrap the remoting request in a transaction automatically.
it_it: Se nel metodo annotato con <literal>@WebRemote</literal> viene eseguita un'operazione di persistenza, occorre marcare il metodo anche con l'annotazione <literal>@Transactional</literal>. Altrimenti, senza questa indicazione extra, il metodo non viene eseguito all'interno di una transazione. Ciò perché, a differenza di una richiesta JSF, Seam non include automaticamente una richiesta remota in una transazione.

source: Now for our web page - create a new page and import the <literal>helloAction</literal> component:
it_it: Ora, per quantro riguarda la pagina web - bisogna creare una nuova pagina e importare il componente <literal>helloAction</literal>:

source: To make this a fully interactive user experience, let's add a button to our page:
it_it: Per rendere l'esperienza dell'utente veramente interattiva, si aggiunga un bottone alla pagina:
ja_jp: ユーザーにとって完全にインテラクティブとなるようページにボタンを追加してみます。

source: We'll also need to add some more script to make our button actually do something when it's clicked:
it_it: Bisognerà anche aggiungere uno script per far fare qualcosa al bottone quando viene cliccato:
ja_jp: ボタンをクリックしたとき、実際にボタンに何かを行わせるためのスクリプトをもう少し追加する必要があります。

source: We're done! Deploy your application and browse to your page. Click the button, and enter a name when prompted. A message box will display the hello message confirming that the call was successful. If you want to save some time, you'll find the full source code for this Hello World example in Seam's <literal>/examples/remoting/helloworld</literal> directory.
it_it: Abbiamo finito! Installate l'applicazione e andate col browser alla pagina creata. Premete il pulsante e inserite un nome quando richiesto. Una finestra mostrerà il messaggio di saluto che confermerà che la chiamata è avvenuta con successo. Per risparmiare tempo, cercate il codice dell'esempio Hello World nella directory <literal>/examples/remoting/helloworld</literal> di Seam.
ja_jp: 作業完了です! アプリケーションをデプロイして、ページを見てみましょう。 ボタンをクリックして、プロンプトが出たら名前を入力しましょう。 呼び出しの成功を確認するための hello メッセージが、メッセージボックスに表示されます。 少し時間を節約したいのであれば、 Seam の <literal>/examples/remoting/helloworld</literal> ディレクトリにこの Hello World サンプルの全ソースコードがあります。

source: So what does the code of our script actually do? Let's break it down into smaller pieces. To start with, you can see from the Javascript code listing that we have implemented two methods - the first method is responsible for prompting the user for their name and then making a remote request. Take a look at the following line:
it_it: Quindi, cosa fa realmente il codice del nostro script? Dividiamolo in pezzi più piccoli. Tanto per iniziare, dal listato Javascript si vede che abbiamo implementato due metodi - il primo serve a chiedere all'utente il suo nome e a fare una richiesta remota. Guardate la seguente linea:
ja_jp: ところで、このスクリプトのコードは何をするのでしょうか。 もっと細かく分解してみましょう。手始めに、二つのメソッドを実装した Javascript コードから見ていきましょう。 最初のメソッドはユーザーに対して名前を入力するよう促し、リモート要求を行うのがその役割です。 以下の行から見てみましょう。

source: The first section of this line, <literal>Seam.Component.getInstance("helloAction")</literal> returns a proxy, or "stub" for our <literal>helloAction</literal> component. We can invoke the methods of our component against this stub, which is exactly what happens with the remainder of the line: <literal>sayHello(name, sayHelloCallback);</literal>.
it_it: La prima parte di questa linea, <literal>Seam.Component.getInstance("helloAction")</literal> restituisce un proxy, o "stub", del componente <literal>helloAction</literal>. Possiamo chiamare i metodi di questo componente usando tale stub, che è ciò che accade nel resto della linea: <literal>sayHello(name, sayHelloCallback);</literal>.
ja_jp: この行の最初の部分 <literal>Seam.Component.getInstance("helloAction")</literal> は、 <literal>helloAction</literal> コンポーネントのプロキシ、あるいは"スタブ"を返します。 このスタブに対してコンポーネントのメソッド呼び出しが可能です。 それは、まさにこの行の残りの部分 <literal>sayHello(name, sayHelloCallback);</literal> になります。

source: What this line of code in its completeness does, is invoke the <literal>sayHello</literal> method of our component, passing in <literal>name</literal> as a parameter. The second parameter, <literal>sayHelloCallback</literal> isn't a parameter of our component's <literal>sayHello</literal> method, instead it tells the Seam Remoting framework that once it receives the response to our request, it should pass it to the <literal>sayHelloCallback</literal> Javascript method. This callback parameter is entirely optional, so feel free to leave it out if you're calling a method with a <literal>void</literal> return type or if you don't care about the result.
it_it: Nel suo complesso questa linea di codice invoca il metodo <literal>sayHello</literal> del componente, passandogli <literal>name</literal> come parametro. Il secondo parametro, <literal>sayHelloCallback</literal> non è un parametro del metodo <literal>sayHello</literal> del componente, ma, invece, comunica al Remoting framework di Seam che, una volta ricevuta la risposta alla richiesta, deve passarla al metodo Javascript <literal>sayHelloCallback</literal>. Questo parametro di callback è completamente opzionale, quindi sentitevi liberi di non usarlo se chiamate un metodo che restituisce <literal>void</literal> o se non siete interessati al risultato.
ja_jp: コード行全体で行っていることは、コンポーネントの<literal>sayHello</literal>メソッドの呼び出しと、 パラメータとして<literal>name</literal>を渡すことです。 二番目のパラメータ<literal>sayHelloCallback</literal>は、 このコンポーネントの <literal>sayHello</literal>メソッドのパラメータではありません。 その代わり、Seam Remoting フレームワークが要求に対する応答を受けたら、 それを <literal>sayHelloCallback</literal> Javascript メソッドに渡すべきことを指示します。 このコールバックパラメータは完全にオプションです。 戻り値 <literal>void</literal> のメソッドを呼び出す場合、 あるいは結果を気にする必要がない場合は、 遠慮なくそのままにしてください。

source: The <literal>sayHelloCallback</literal> method, once receiving the response to our remote request then pops up an alert message displaying the result of our method call.
it_it: Il metodo <literal>sayHelloCallback</literal>, una volta ricevuta la risposta, mostra un messaggio di avviso con il risultato della chiamata.
ja_jp: <literal>sayHelloCallback</literal>メソッドが、リモート要求に対するレスポンスを受信した場合、 メソッド呼び出しの結果を表示するアラートメッセージが現れます。

source: The <literal>Seam.Component</literal> Javascript object provides a number of client-side methods for working with your Seam components. The two main methods, <literal>newInstance()</literal> and <literal>getInstance()</literal> are documented in the following sections however their main difference is that <literal>newInstance()</literal> will always create a new instance of a component type, and <literal>getInstance()</literal> will return a singleton instance.
it_it: L'oggetto Javascript <literal>Seam.Component</literal> fornisce un serie di metodi lato client per lavorare con i componenti Seam dell'applicazione. I due metodi principali, <literal>newInstance()</literal> e <literal>getInstance()</literal> sono documentati nelle sezioni successive, comunque, la loro differenza principale sta nel fatto che <literal>newInstance()</literal> crea sempre una nuova istanza di un tipo di componente, mentre <literal>getInstance()</literal> restituisce un'istanza singleton.
ja_jp: <literal>Seam.Component</literal> Javascript オブジェクトは、 Seam コンポーネントと連携する多くのクライアントメソッドを提供します。 主な二つのメソッド、<literal>newInstance()</literal>と <literal>getInstance()</literal>は、 以降の章にも記述されていますが、 これらの主な違いは、<literal>newInstance()</literal> は、いつもコンポーネントタイプの新しいインスタンスを生成し、そして、<literal>getInstance()</literal>は、シングルトンのインスタンスを返すことです。

source: Use this method to create a new instance of an entity or Javabean component. The object returned by this method will have the same getter/setter methods as its server-side counterpart, or alternatively if you wish you can access its fields directly. Take the following Seam entity component for example:
it_it: Usate questo metodo per creare una nuova istanza di un entity o di un componente Javabean. L'oggetto restituito da questo metodo avrà gli stessi metodi get/set della sua controparte lato server, o, di preferenza, sarà possibile accedere ai suoi campi direttamente. Ad esempio, prendete il seguente componente Seam:
ja_jp: 新しいエンティティ、あるいは、JavaBean コンポーネントインスタンスを生成するためにこのメソッドを使用します。 このメソッドにより返されるオブジェクトは、 サーバサイドの対応するものと同じ getter/setter メソッドを持つか、 あるいは、代替として、お望みならば、そのフィールドに直接アクセスが可能です。 例として、以下の Seam エンティティ コンポーネントをご覧ください。

source: To create a client-side Customer you would write the following code:
it_it: Per creare un Customer lato client, bisognerebbe scrivere il codice seguente:
ja_jp: クライアントサイド Customer を生成するために、以下のコードを記述します。

source: Then from here you can set the fields of the customer object:
it_it: Allora da qui è possibile valorizzare i campi dell'oggetto customer:
ja_jp: そして、ここからは customer オブジェクトのフィールドの設定が可能です。

source: customer.setFirstName("John"); // Or you can set the fields directly customer.lastName = "Smith";
it_it: customer.setFirstName("John"); // Oppure si può impostare direttamente i campi customer.lastName = "Smith";

source: The <literal>getInstance()</literal> method is used to get a reference to a Seam session bean component stub, which can then be used to remotely execute methods against your component. This method returns a singleton for the specified component, so calling it twice in a row with the same component name will return the same instance of the component.
it_it: Il metodo <literal>getInstance()</literal> viene usato per ottenere un riferimento allo stub di un componente Seam di tipo session bean, che può essere utilizzato per eseguire chiamate remote al componente stesso. Questo metodo restituisce un singleton del componente specificato, così che chiamarlo due volte di fila passando lo stesso nome come parametro restituirà la stessa istanza del suddetto componente.
ja_jp: <literal>getInstance()</literal>メソッドは、 Seam セッション Bean コンポーネントの、スタブへの参照を取得するために使用されます。 それは、コンポーネントに対してリモートのメソッド実行に使用可能です。 このメソッドは、特定のコンポーネントのシングルトンを返します。 その結果、続けて同じコンポーネント名で二回呼び出すと、同じコンポーネントインスタンスが返されます。

source: To continue our example from before, if we have created a new <literal>customer</literal> and we now wish to save it, we would pass it to the <literal>saveCustomer()</literal> method of our <literal>customerAction</literal> component:
it_it: Per continuare l'esempio precedente, se è stato creato un nuovo <literal>customer</literal> e si vuole salvarlo, occorre passarlo al metodo <literal>saveCustomer()</literal> del componente <literal>customerAction</literal>:
ja_jp: 前記のサンプルから続けて、 新しい<literal>customer</literal>を生成、保存しようとする場合、<literal>customerAction</literal>コンポーネントの<literal>saveCustomer()</literal>メソッドにそれを渡します。

source: Passing an object into this method will return its component name if it is a component, or <literal>null</literal> if it is not.
it_it: Passare un oggetto a questo metodo, restituirà il suo nome di componente, se è un componente, o <literal>null</literal> se non lo è.
ja_jp: このメソッドに渡すオブジェクトがコンポーネントの場合はコンポーネント名を返し、 コンポーネントではない場合には <literal>null</literal> を返します。

source: Most of the client side functionality for Seam Remoting is contained within the <literal>Seam.Remoting</literal> object. While you shouldn't need to directly call most of its methods, there are a couple of important ones worth mentioning.
it_it: La maggior parte delle funzionalità lato client di Seam Remoting sono contenute nell'oggetto <literal>Seam.Remoting</literal>. Mentre non dovrebbe essere necessario chiamare direttamente la maggior parte di questi metodi, ce ne sono un paio che meritano di essere menzionati per la loro importanza.
ja_jp: Seam Remoting の大部分のクライアントサイドの機能は、<literal>Seam.Remoting</literal>オブジェクトに含まれます。 メソッドを直接呼ぶ必要はほとんどないとはいえ、 言及する価値のある重要なものがあります。

source: If your application contains or uses Javabean classes that aren't Seam components, you may need to create these types on the client side to pass as parameters into your component method. Use the <literal>createType()</literal> method to create an instance of your type. Pass in the fully qualified Java class name as a parameter:
it_it: Se l'applicazione contiene o usa classi Javabean che non sono componenti Seam, potrebbe essere necessario creare questi tipi sul lato del client per passarli come parametri al metodo del componente che si vuole chiamare. Si usi il metodo <literal>createType()</literal> per creare un'istanza di tale tipo. Come parametro occore passare il nome completo della classe Java:
ja_jp: アプリケーションが Seam コンポーネントではない JavaBean のクラスを含むまたは使用する場合、 クライアント側ででこれらのタイプを作成してパラメータとしてコンポーネントメソッドに渡す必要があるかもしれません。 タイプのインスタンスを作成するために、 <literal>createType()</literal> メソッドを使用してください。 パラメータとして、完全修飾の Java クラス名を渡してください。

source: This method is the equivalent of <literal>Seam.Component.getComponentName()</literal> but for non-component types. It will return the name of the type for an object instance, or <literal>null</literal> if the type is not known. The name is the fully qualified name of the type's Java class.
it_it: Tale metodo è l'equivalente di <literal>Seam.Component.getComponentName()</literal> ma per tipi che non sono componenti. Restituirà il nome del tipo data un'istanza, o <literal>null</literal> se il tipo è sconosciuto. Il nome è il nome completo della classe Java del tipo stesso.
ja_jp: このメソッドは非コンポーネントタイプの場合を除き <literal>Seam.Component.getComponentName()</literal> と同等です。 オブジェクトインスタンスにタイプの名前を返します。 または、タイプが既知でない場合は <literal>null</literal> を返します。 この名前は、タイプの Java クラス完全修飾名です。

source: Client Interfaces
it_it: Interfacce client
ja_jp: クライアントのインタフェース

source: In the configuration section above, the interface, or "stub" for our component is imported into our page either via <literal>seam/resource/remoting/interface.js</literal>: or using the <literal>s:remote</literal> tag:
it_it: Nella sezione di configurazione vista sopra, l'interfaccia, o "stub", del componente è importata nella pagina o attraverso <literal>seam/resource/remoting/interface.js</literal> o usando la tag <literal>s:remote</literal>.
ja_jp: 上記の設定のセクションでは、 インタフェースまたはコンポーネントの「スタブ」は <literal>seam/resource/remoting/interface.js</literal> 経由でページにインポートするか、 <literal>s:remote</literal> を使用してインポートします。

source: By including this script in our page, the interface definitions for our component, plus any other components or types that are required to execute the methods of our component are generated and made available for the remoting framework to use.
it_it: Includenco questo script nella pagina, le definizioni delle interfacce del componente, più quelle di ogni di ogni altro componente o tipo necessario a eseguire i metodi del componente in questione sono generate e rese visibili perché il framework di remoting possa utilizzarle.
ja_jp: ページにこのスクリプトをインクルードすることにより、 コンポーネントのためのインタフェース定義に加えて、コンポーネントのメソッドを実行するために必要なその他のコンポーネントとタイプが生成され、リモーティングフレームワークで使用可能になります。

source: There are two types of client stub that can be generated, "executable" stubs and "type" stubs. Executable stubs are behavioural, and are used to execute methods against your session bean components, while type stubs contain state and represent the types that can be passed in as parameters or returned as a result.
it_it: E' possibile generare due tipi di stub client, stubs "eseguibili" stubs e stubs "tipo". Gli stubs eseguibili sono dotati di comportamento, e sono usati per eseguire metodi dei componenti session bean, mentre gli stubs tipo servono a contenere dello stato e rappresentano i tipi che possono essere passati come parametri o restituiti come risultati.
ja_jp: 生成可能なクライアントスタブには「実行可能」スタブと「タイプ」スタブの二タイプがあります。 実行可能スタブは動作を持ち、 セッション Bean コンポーネントに対するメソッドの実行に使用されます。 一方、 タイプスタブは状態を保持し、 パラメータとして渡すまたは結果として返すことができるタイプを表します。
