Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Remoting.po
Languages: it_it, ja_jp

source: The type of client stub that is generated depends on the type of your Seam component. If the component is a session bean, then an executable stub will be generated, otherwise if it's an entity or JavaBean, then a type stub will be generated. There is one exception to this rule; if your component is a JavaBean (ie it is not a session bean nor an entity bean) and any of its methods are annotated with @WebRemote, then an executable stub will be generated for it instead of a type stub. This allows you to use remoting to call methods of your JavaBean components in a non-EJB environment where you don't have access to session beans.
it_it: Il tipo di stub client che viene generato dipende dal tipo di componente Seam. Se il componente è un session bean, allora sarà generato uno stub eseguibile, altrimenti, se si tratta di un entity bean o di un Java bean, sarò generato uno stub tipo. Vi è una sola eccezione a questa regola; se il componente è un Javabean (cioè non è né un session bean né un entity bean) e uno dei suoi metodi è annotato con @WebRemote, allora sarà generato uno stub eseguibile invece di uno stub tipo. Questo consente di usare il remoting per chiamare i componenti JavaBean in un ambiente non EJB dove non occorre avere accesso ai session bean.
ja_jp: 生成されるクライアントスタブのタイプは Seam コンポーネントのタイプにより異なります。 コンポーネントがセッション Bean の場合、 実行可能スタブが生成されます。 これ以外、 エンティティや JavaBean となる場合にはタイプスタブが生成されます。 この規則には例外がひとつあります。 コンポーネントが JavaBean (つまり、セッション Bean や エンティティ Bean ではない場合) であり、 そのメソッドのいずれにも @WebRemote アノテーションが付く場合、 タイプスタブではなく実行可能スタブが生成されます。 これにより、 セッション Bean にアクセスできない非 EJB 環境で JavaBean コンポーネントのメソッドを呼び出すリモーティングが使用できるようになります。

source: The Context
it_it: Il contesto
ja_jp: コンテキスト

source: The Seam Remoting Context contains additional information which is sent and received as part of a remoting request/response cycle. At this stage it only contains the conversation ID but may be expanded in the future.
it_it: L'oggetto contesto (Seam Remoting Context) contiene informazioni aggiuntive che sono inviate e ricevute come parte del ciclo di richiesta/risposta. Attualmente contiene l'id della conversazione, ma potrebbe essere espanso in futuro.
ja_jp: Seam リモートコンテキストは、 リモーティングの要求 / 応答サイクルの一部として送受信される追加情報を含んでいます。 現段階では対話 ID だけしか含んでいませんが、将来拡張される可能性があります。

source: Setting and reading the Conversation ID
it_it: Impostazione e lettura dell'ID di conversazione
ja_jp: 対話 ID の設定と読み込み

source: If you intend on using remote calls within the scope of a conversation then you need to be able to read or set the conversation ID in the Seam Remoting Context. To read the conversation ID after making a remote request call <literal>Seam.Remoting.getContext().getConversationId()</literal>. To set the conversation ID before making a request, call <literal>Seam.Remoting.getContext().setConversationId()</literal>.
it_it: Se si vuole usare le chiamate remote all'interno di una conversazione, bisogna essere in grado di leggere o scrivere l'id della conversazione nell'oggetto contesto (Seam Remoting Context). Per leggere l'id della conversazione dopo avere fatto una richiesta remota occorre chiamare <literal>Seam.Remoting.getContext().getConversationId()</literal>. Per scriverlo prima di fare una richiesta, bisogna chiamare <literal>Seam.Remoting.getContext().setConversationId()</literal>.
ja_jp: 対話スコープでリモート呼び出しをしようとする場合、 Seam Remotingコンテキスト内にある対話ID の読み込みと設定が行える必要があります。リモート要求の後に対話 ID を読み込むためには、<literal>Seam.Remoting.getContext().getConversationId()</literal>を呼び出します。 要求の前に対話ID を設定するためには、<literal>Seam.Remoting.getContext().setConversationId()</literal>を呼び出します。

source: If the conversation ID hasn't been explicitly set with <literal>Seam.Remoting.getContext().setConversationId()</literal>, then it will be automatically assigned the first valid conversation ID that is returned by any remoting call. If you are working with multiple conversations within your page, then you may need to explicitly set the conversation ID before each call. If you are working with just a single conversation, then you don't need to do anything special.
it_it: Se l'ID della conversazione non è stato esplicitamente valorizzato usando <literal>Seam.Remoting.getContext().setConversationId()</literal>, allora sarà assegnato in automatico il primo ID valido restituito da una chiamata remota. Se si sta lavorando con più conversazioni all'interno della pagina, allora può essere necessario indicare esplicitamente il valore dell'ID della conversazione prima di ciascuna chiamata. Se si sta lavorando con una sola conversazione, non occorre fare nulla di speciale.
ja_jp: 対話ID が明示的に <literal>Seam.Remoting.getContext().setConversationId()</literal>で設定されない場合、 リモート呼び出しによって返される最初の有効な対話ID が自動的に割り当てられます。 ページ内で複数の対話ID を使用する場合は、それぞれの呼び出しの前に対話IDを明示的に設定する必要があるかもしれません。 一つの対話だけを使用する場合は、 特別なことをする必要はありません。

source: Remote calls within the current conversation scope
it_it: Chiamate remote all'interno della conversazone corrente
ja_jp: 現在の対話スコープ内のリモート呼び出し

source: In some circumstances it may be required to make a remote call within the scope of the current view's conversation. To do this, you must explicitly set the conversation ID to that of the view before making the remote call. This small snippet of JavaScript will set the conversation ID that is used for remoting calls to the current view's conversation ID:
it_it: In alcuni casi può essere necessario fare una chiamata remota all'interno della conversazione della pagina corrente. A questo scopo bisogna esplicitamente valorizzare l'ID della conversazione a quello della pagina prima di fare la chiamata remota. Questo piccolo estratto di Javascript assegna come ID della conversazione da usare per le chiamate remote quello della conversazione della pagina corrente:
ja_jp: 現在のビューの対話スコープ内でリモート呼び出しを行う必要がある場合があります。 これを行うにはリモート呼び出しを行う前に明示的に対話 ID をビューのそれにセットする必要があります。 この小さな JavaScript によりリモート呼び出しに使用される対話 ID が現在のビューの対話 ID にセットされます。

source: Batch Requests
it_it: Richieste batch
ja_jp: バッチ要求

source: Seam Remoting allows multiple component calls to be executed within a single request. It is recommended that this feature is used wherever it is appropriate to reduce network traffic.
it_it: Seam Remoting permette di eseguire più chiamate a componenti all'interno di una singola richiesta. Si raccomanda di usare questa funzionalità ogni volta che si riveli appropriato allo scopo di ridurre il traffico di rete.
ja_jp: Seam リモーティングは、複数のコンポーネント呼び出しが一つの要求内で実行されることを可能にします。 ネットワークトラフィックを減少することが適切であれば、 どこでもこの特徴を使用することを推奨します。

source: The method <literal>Seam.Remoting.startBatch()</literal> will start a new batch, and any component calls executed after starting a batch are queued, rather than being sent immediately. When all the desired component calls have been added to the batch, the <literal>Seam.Remoting.executeBatch()</literal> method will send a single request containing all of the queued calls to the server, where they will be executed in order. After the calls have been executed, a single response containining all return values will be returned to the client and the callback functions (if provided) triggered in the same order as execution.
it_it: Il metodo <literal>Seam.Remoting.startBatch()</literal> avvierà un nuovo batch, e tutte le chiamate a componenti eseguite in seguito saranno messe in coda invece che inviate immediatamente. Quando tutte le chiamate desiderate saranno state aggiunte al batch, il metodo <literal>Seam.Remoting.executeBatch()</literal> invierà una singola richiesta con la coda delle chiamate al server, dove saranno eseguite nell'ordine specificato. Dopo l'esecuzione delle chiamate, una singola risposta con tutti i valori di ritorno sarà restituita al client e le funzioni callback (se specificate) saranno chiamate nello steso ordine di esecuzione.
ja_jp: <literal>Seam.Remoting.startBatch()</literal>メソッド は、 新たなバッチを起動します。 バッチ起動後に実行されたコンポーネント呼び出しは、 即座に送られるのではなく、キューイングされます。 必要とされるすべてのコンポーネント呼び出しがバッチに追加されたとき、<literal>Seam.Remoting.executeBatch()</literal>メソッドは、 サーバにキューイングされた呼び出しすべてを含む一つの要求を送信するでしょう。 そして、そこで順番に実行されます。 呼び出しが実行された後、 すべての戻り値を含む一つの応答は、 クライアントに返され、コールバック機能が (もし、設定されていれば) 実行と同じ順番で起動されます。

source: If you start a new batch via the <literal>startBatch()</literal> method but then decide you don't want to send it, the <literal>Seam.Remoting.cancelBatch()</literal> method will discard any calls that were queued and exit the batch mode.
it_it: Se si da il via ad un nuovo batch usando il metodo <literal>startBatch()</literal>, ma successivamente si decide di non inviarlo, il metodo <literal>Seam.Remoting.cancelBatch()</literal> annullerà tutte le chiamate già in coda e uscirà dalla modalità batch.
ja_jp: <literal>startBatch()</literal>メソッドで新たなバッチを起動したが要求を送らないことにした場合、 <literal>Seam.Remoting.cancelBatch()</literal>メソッドはキュー待ちしているすべての呼び出しを破棄してそのバッチモードを終了します。

source: To see an example of a batch being used, take a look at <literal>/examples/remoting/chatroom</literal>.
it_it: Per vedere un esempio di batch in azione, date un'occhiata a <literal>/examples/remoting/chatroom</literal>.
ja_jp: バッチが利用されているサンプルを見るには、<literal>/examples/remoting/chatroom</literal>を参照ください。

source: Working with Data types
it_it: Lavorare con i tipi di dati
ja_jp: データタイプの取り扱い

source: Primitives / Basic Types
it_it: Tipi primitivi/base
ja_jp: プリミティブ型 / 基本タイプ

source: This section describes the support for basic data types. On the server side these values are generally compatible with either their primitive type or their corresponding wrapper class.
it_it: Questa sezione descrive il supporto per i tipi di dati di base. Sul lato del server tali valori generalmente sono compatibili o con il proprio tipo primitivo o con il corrispondente tipo wrapper.
ja_jp: この章は、基本データタイプのサポートについて述べています。 サーバサイドではこれらの値は、一般的にプリミティブタイプ、あるいは、対応するラッパクラスと互換性があります。

source: Simply use Javascript String objects when setting String parameter values.
it_it: Quando si settano i valori di parametri stringa, basta usare oggetti Javascript di tipo String.
ja_jp: String パラメータ値を設定する場合は、 単純に Javascript String オブジェクトを使用してください。

source: There is support for all number types supported by Java. On the client side, number values are always serialized as their String representation and then on the server side they are converted to the correct destination type. Conversion into either a primitive or wrapper type is supported for <literal>Byte</literal>, <literal>Double</literal>, <literal>Float</literal>, <literal>Integer</literal>, <literal>Long</literal> and <literal>Short</literal> types.
it_it: Sono supportati tutti i tipi numerici di Java. Sul client viene sempre serializzata la rappresentazione come stringhe dei valori numerici e sul server essi sono riconvertiti nei rispettivi tipi di destinazione. La conversione in un tipo primitivo o nel suo corrispondente wrapper è supportata per i tipi <literal>Byte</literal>, <literal>Double</literal>, <literal>Float</literal>, <literal>Integer</literal>, <literal>Long</literal> e <literal>Short</literal>.
ja_jp: Java でサポートされているすべての数値タイプにサポートがあります。 クライアント側では数値は常に String 表現としてシリアライズされ、 サーバ側で適切な目的とするタイプに変換されます。 プリミティブまたはラッパーいずれかのタイプへの変換は、 <literal>Byte</literal>、 <literal>Double</literal>、 <literal>Float</literal>、 <literal>Integer</literal>、 <literal>Long</literal>、 <literal>Short</literal> の各タイプに対してサポートされます。

source: Booleans are represented client side by Javascript Boolean values, and server side by a Java boolean.
it_it: I tipi Boolean sul client sono rappresentati dai Boolean di Javascript e sul server dai Boolean di Java.
ja_jp: Boolean は、クライアントサイドでは Javascriptの Boolean 値で表現され、サーバサイドでは Java boolean で表現されます。

source: In general these will be either Seam entity or JavaBean components, or some other non-component class. Use the appropriate method (either <literal>Seam.Component.newInstance()</literal> for Seam components or <literal>Seam.Remoting.createType()</literal> for everything else) to create a new instance of the object.
it_it: In generale questi saranno o entity di Seam o componenti JavaBean o qualche altra classe che non corrisponde a un componente. Bisogna usare il metodo appropriato (o <literal>Seam.Component.newInstance()</literal> per i componenti o <literal>Seam.Remoting.createType()</literal> per tutto il resto) per creare una nuova istanza dell'oggetto.
ja_jp: 一般的に JavaBeans は Seam エンティティ、 JavaBean コンポーネント、 または non-component クラスのいずれかになります。 オブジェクトの新しいインスタンスの生成には適切なメソッドを使用してください (Seam コンポーネントには <literal>Seam.Component.newInstance()</literal>、 これ以外は <literal>Seam.Remoting.createType()</literal>)。

source: It is important to note that only objects that are created by either of these two methods should be used as parameter values, where the parameter is not one of the other valid types mentioned anywhere else in this section. In some situations you may have a component method where the exact parameter type cannot be determined, such as:
it_it: E' importante notare che solo oggetti creati da uno di questi due metodi dovrebbero essere usati come valori parametrici, ogni volta che il parametro non corrisponde ad uno degli altri tipi validi menzionati altrove in questa sezione. In alcune situazioni può darsi che vi sia un metodo del componente per il quale non si può determinare l'esatto tipo del parametro, come in questo caso:
ja_jp: パラメータが、このセクションの別の場所で記述されたその他の有効なタイプの一つではない場合、 これら二つのメソッドのどちらかによって生成されるオブジェクトだけがパラメータ値として使用されるべきであることに気づくことが重要です。 いくつかの状況では、 以下のように厳密にパラメータタイプを決定できないコンポーネントメソッドがあるかもしれません。

source: In this case you might want to pass in an instance of your <literal>myWidget</literal> component, however the interface for <literal>myAction</literal> won't include <literal>myWidget</literal> as it is not directly referenced by any of its methods. To get around this, <literal>MyWidget</literal> needs to be explicitly imported:
it_it: In questo caso si potrebbe voler passare come parametro un'istanza del componente <literal>myWidget</literal>, ma l'interfaccia di <literal>myAction</literal> non include <literal>myWidget</literal> poiché esso non è referenziato direttamente da nessun altgro metodo. Pe risolvere la questione, <literal>MyWidget</literal> deve essere importato esplicitamente:
ja_jp: この場合、 <literal>myWidget</literal> コンポーネントのインスタンスを渡したいところですが、 <literal>myAction</literal> のインタフェースはそのいずれのメソッドからも直接参照されないため <literal>myWidget</literal> を含みません。 これを回避するには、 <literal>MyWidget</literal> を明示的にインポートする必要があります。

source: This will then allow a <literal>myWidget</literal> object to be created with <literal>Seam.Component.newInstance("myWidget")</literal>, which can then be passed to <literal>myAction.doSomethingWithObject()</literal>.
it_it: Ciò permetterà all'oggetto <literal>myWidget</literal> di essere creato con <literal>Seam.Component.newInstance("myWidget")</literal>, che può allora essere passato a <literal>myAction.doSomethingWithObject()</literal>.
ja_jp: これにより <literal>myWidget</literal> オブジェクトが <literal>Seam.Component.newInstance("myWidget")</literal> で作成されるようになり、 <literal>myAction.doSomethingWithObject()</literal> に渡されます。

source: Dates and Times
it_it: Date e orari
ja_jp: 日付と時刻

source: Date values are serialized into a String representation that is accurate to the millisecond. On the client side, use a Javascript Date object to work with date values. On the server side, use any <literal>java.util.Date</literal> (or descendent, such as <literal>java.sql.Date</literal> or <literal>java.sql.Timestamp</literal> class.
it_it: I valori delle date sono serializzati in una rappresentazione di Strina che è accurata al millisecondo. Lato client, si usi un oggetto Date Javascript per lavorare con i valori delle date. Late server, si usi <literal>java.util.Date</literal> (o discendenti, come le classi <literal>java.sql.Date</literal> o <literal>java.sql.Timestamp</literal>).
ja_jp: 日付の値は、 ミリ秒単位まで正確な String 表示にシリアライズされます。 クライアント側では Javascript Date オブジェクトを使って日付値と動作させます。 サーバ側では <literal>java.util.Date</literal> を使用します (または <literal>java.sql.Date</literal> や <literal>java.sql.Timestamp</literal> などの下位クラス)。

source: On the client side, enums are treated the same as Strings. When setting the value for an enum parameter, simply use the String representation of the enum. Take the following component as an example:
it_it: Sul client, le enum sono trattate come stringhe. Quando si valorizza un parametro enum, basta usare la rappresentazione stringa della enum. Si prenda il componente seguente come esempio:
ja_jp: クライアント側では、 Enum は String と同様に扱われます。 Enum パラメータの値を設定する場合は単純に enum の String 表現を使います。 次のコンポーネントを例として参照してください。

source: To call the <literal>paint()</literal> method with the color <literal>red</literal>, pass the parameter value as a String literal:
it_it: Per chiamare il metodo <literal>paint()</literal> con il colore <literal>red</literal>, occorre passare come parametro il literal di tipo String:
ja_jp: <literal>paint()</literal> メソッドを <literal>red</literal> の色を使って呼び出すには、 String のままでパラメータ値を渡します。

source: The inverse is also true - that is, if a component method returns an enum parameter (or contains an enum field anywhere in the returned object graph) then on the client-side it will be represented as a String.
it_it: E' vero anche l'inverso - cioè, se il metodo di un componente restituisce un parametro di tipo enum (o contiene un campo enum in un qualunque punto del grafo di oggetti restituito) allora esso sul client essa sarà rappresentato come stringa.
ja_jp: 逆もまた同じことが言えます。 つまり、 コンポーネントメソッドが enum パラメータを返す場合 (または返されるオブジェクトグラフのどこかに enum フィールドを含む場合)、 クライアント側では String として表示されます。

source: Bags cover all collection types including arrays, collections, lists, sets, (but excluding Maps - see the next section for those), and are implemented client-side as a Javascript array. When calling a component method that accepts one of these types as a parameter, your parameter should be a Javascript array. If a component method returns one of these types, then the return value will also be a Javascript array. The remoting framework is clever enough on the server side to convert the bag to an appropriate type for the component method call.
it_it: Le bag coprono tutti i tipi collezione inclusi array, collezioni, liste, insiemi, (ma escluse le mappe - per le quali bisogna fare riferimento alla prossima sezione), e sul client sono implementate come array Javascript. Quando si chiama un metodo che accetta uno di questi tipi come parametro, il parametro dovrebbe essere un array di Javascript. Se un metodo restituisce uno di questi tipi, anche il valore restituito sarà un array di Javascript. Il framework sul server è sufficientemente intelligente da convertire la bag nel tipo adatto al metodo chiamato.
ja_jp: Bag は配列、 コレクション、 リスト、 セットなどすべての集合タイプを対象とし (ただし Map は除く、 これについては次のセクションを参照)、 Javascript 配列としてクライアント側で実装されます。 パラメータとしてこれらのタイプのいずれかを受け取るコンポーネントメソッドを呼び出す場合、 使用するパラメータは Javascript アレイにします。 コンポーネントメソッドがこれらのタイプのいずれかを返す場合は、 戻り値も Javascript 配列になります。 このリモーティングフレームワークは、 サーバ側で bag をコンポーネントメソッドコールに対して適切なタイプに変換することが可能です。

source: As there is no native support for Maps within Javascript, a simple Map implementation is provided with the Seam Remoting framework. To create a Map which can be used as a parameter to a remote call, create a new <literal>Seam.Remoting.Map</literal> object:
it_it: Poichè in Javascript le mappe non sono supportate nativamente, insieme al framework viene fornita una semplice implementazione di Map. Per creare un oggetto Map che possa essere usato come parametro di una chiamata remota, bisogna creare un nuovo oggetto di tipo <literal>Seam.Remoting.Map</literal>:
ja_jp: Javascript 内では Map に対するネイティブのサポートはないため、 シンプルな Map 実装が Seam Remoting フレームワークで提供されます。 リモートコールに対するパラメータとして使用できる Map を作成するには、 新たに <literal>Seam.Remoting.Map</literal> オブジェクトを作成します。

source: This Javascript implementation provides basic methods for working with Maps: <literal>size()</literal>, <literal>isEmpty()</literal>, <literal>keySet()</literal>, <literal>values()</literal>, <literal>get(key)</literal>, <literal>put(key, value)</literal>, <literal>remove(key)</literal> and <literal>contains(key)</literal>. Each of these methods are equivalent to their Java counterpart. Where the method returns a collection, such as <literal>keySet()</literal> and <literal>values()</literal>, a Javascript Array object will be returned that contains the key or value objects (respectively).
it_it: Questa implementazione Javascript fornisce i metodi di base per lavorare con le mappe: <literal>size()</literal>, <literal>isEmpty()</literal>, <literal>keySet()</literal>, <literal>values()</literal>, <literal>get(key)</literal>, <literal>put(key, value)</literal>, <literal>remove(key)</literal> e <literal>contains(key)</literal>. Ciascuno di essi è equivalente alla controparte Java. Quando il metodo restituisce una collezione, come con <literal>keySet()</literal> e <literal>values()</literal>, sarà restituito un Array Javascript che contiene le chiavi o i valori (ripettivamente).
ja_jp: この Javascript 実装では Map と動作することを目的とした基本的なメソッド、 <literal>size()</literal>、 <literal>isEmpty()</literal>、 <literal>keySet()</literal>、 <literal>values()</literal>、 <literal>get(key)</literal>、 <literal>put(key, value)</literal>、 <literal>remove(key)</literal>、 <literal>contains(key)</literal> を提供します。 それぞれのメソッドは Java のそれと同等になります。 メソッドが <literal>keySet()</literal> および <literal>values()</literal> などの一集合を返すと、 そのキーまたは値オブジェクトを含む Javascript Array オブジェクトが返されます。

source: To aid in tracking down bugs, it is possible to enable a debug mode which will display the contents of all the packets send back and forth between the client and server in a popup window. To enable debug mode, either execute the <literal>setDebug()</literal> method in Javascript:
it_it: Per aiutare l'individuazione dei bug, è possibile abilitare una modalità di debug che mostrerà in una finestra di popup il contenuto di tutti i pacchetti inviati avanti e indietro tra client e server. Per abilitare tale modalità, o si chiama il metodo <literal>setDebug()</literal> in Javascript:
ja_jp: バグの追跡を支援する目的で、 ポップアップウィンドウ内でクライアントとサーバ間を行ったり来たりするすべてのパケットの内容を表示するデバッグモードを有効にすることができます。 デバッグモードを有効にするには、 次のいずれかを行います。 Javascript 内で <literal>setDebug()</literal> メソッドを実行する方法は次の通りです。

source: Or configure it via components.xml:
it_it: O lo si configuri via components.xml:
ja_jp: components.xml を使って設定を行う方法は次のようになります。

source: To turn off debugging, call <literal>setDebug(false)</literal>. If you want to write your own messages to the debug log, call <literal>Seam.Remoting.log(message)</literal>.
it_it: Per disabiliare la modalità di debug, occorre chiamare <literal>setDebug(false)</literal>. Se si vogliono scrivere dei messaggi propri nel log di debug, occorre chiamare <literal>Seam.Remoting.log(message)</literal>.
ja_jp: デバッグ機能をオフにするには、 <literal>setDebug(false)</literal> を呼び出します。 独自のメッセージをデバッグログに書き込みたい場合は、 <literal>Seam.Remoting.log(message)</literal> を呼び出します。

source: Handling Exceptions
it_it: Gestione delle eccezioni

source: When invoking a remote component method, it is possible to specify an exception handler which will process the response in the event of an exception during component invocation. To specify an exception handler function, include a reference to it after the callback parameter in your JavaScript:
it_it: Quando si fa una chiamata remota, è possibile specificare un gestore di eccezioni che processerà la risposta nell'eventualità che il metodo lanci un'eccezione. Per specificare una funzione di gestione delle eccezioni, bisogna includere nel Javascript un riferimento ad essa dopo il parametro di callback:

source: If you do not have a callback handler defined, you must specify <literal>null</literal> in its place:
it_it: Se non viene indicato il gestore della callback, al suo posto bisogna specificare <literal>null</literal>:
