Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Remoting.po
Languages: it_it, ja_jp

source: The exception object that is passed to the exception handler exposes one method, <literal>getMessage()</literal> that returns the exception message which is produced by the exception thrown by the <literal>@WebRemote</literal> method.
it_it: L'oggetto eccezione che viene passato al gestore espone un solo metodo, <literal>getMessage()</literal>, che restituisce il messaggio di errore prodotto dall'eccezione lanciata dal memtodo annotato con <literal>@WebRemote</literal>.

source: The Loading Message
it_it: Il messaggio di caricamento
ja_jp: メッセージをロードする

source: The default loading message that appears in the top right corner of the screen can be modified, its rendering customised or even turned off completely.
it_it: Il messaggio di caricamento predefinito che appare nell'angolo dello schermo in alto a destra può essere modificato e il suo rendering personalizzato o anche eliminato completamente.
ja_jp: 画面の上部右端にデフォルトで表示されるローディングメッセージは、 変更、 レンダリングのカスタマイズ、 完全にオフにするなどが可能です。

source: Changing the message
it_it: Cambiare il messaggio
ja_jp: メッセージを変更する

source: To change the message from the default "Please Wait..." to something different, set the value of <literal>Seam.Remoting.loadingMessage</literal>:
it_it: Per cambiare il messaggio dal default "Attendere prego..." a qualcosa di differente, si imposti il valore di <literal>Seam.Remoting.loadingMessage</literal>:
ja_jp: デフォルトの "Please Wait..." というメッセージを別のメッセージに変更するには、 <literal>Seam.Remoting.loadingMessage</literal> の値を設定します。

source: Hiding the loading message
it_it: Nascondere il messaggio di caricamento
ja_jp: ローディングメッセージを隠す

source: To completely suppress the display of the loading message, override the implementation of <literal>displayLoadingMessage()</literal> and <literal>hideLoadingMessage()</literal> with functions that instead do nothing:
it_it: Per sopprimere il messaggio di caricamento, occorre fare l'override dell'implementazione di <literal>displayLoadingMessage()</literal> e <literal>hideLoadingMessage()</literal> con funzioni che non fanno nulla:
ja_jp: ローディングメッセージを完全に表示させないようにするには、 <literal>displayLoadingMessage()</literal> および <literal>hideLoadingMessage()</literal> を何も行わない機能で上書きします。

source: // don't display the loading indicator Seam.Remoting.displayLoadingMessage = function() {}; Seam.Remoting.hideLoadingMessage = function() {};
it_it: // non mostrare l'indicatore di caricamento Seam.Remoting.displayLoadingMessage = function() {}; Seam.Remoting.hideLoadingMessage = function() {};

source: A Custom Loading Indicator
it_it: Un indicatore di caricamento personalizzato
ja_jp: カスタムのローディングインジケータ

source: It is also possible to override the loading indicator to display an animated icon, or anything else that you want. To do this override the <literal>displayLoadingMessage()</literal> and <literal>hideLoadingMessage()</literal> messages with your own implementation:
it_it: E' anche possibile sovrascrivere l'indicatore di caricamento per mostrare un'icona animata o qualunque altra cosa si voglia. A questo scopo occorre fare l'override di <literal>displayLoadingMessage()</literal> e <literal>hideLoadingMessage()</literal> con un'implementazione propria:
ja_jp: ローディングインジケータを上書きしてアニメのアイコンの他、 好きなものを表示させることができます。 <literal>displayLoadingMessage()</literal> と <literal>hideLoadingMessage()</literal> の各メッセージを独自の実装で上書きしてこれを行います。

source: Controlling what data is returned
it_it: Controllare i dati restituiti
ja_jp: 戻り値の制御

source: When a remote method is executed, the result is serialized into an XML response that is returned to the client. This response is then unmarshaled by the client into a Javascript object. For complex types (i.e. Javabeans) that include references to other objects, all of these referenced objects are also serialized as part of the response. These objects may reference other objects, which may reference other objects, and so forth. If left unchecked, this object "graph" could potentially be enormous, depending on what relationships exist between your objects. And as a side issue (besides the potential verbosity of the response), you might also wish to prevent sensitive information from being exposed to the client.
it_it: Quando un metodo remoto viene esegutio, il risultato viene serializzato in una risposta XML che viene restituita al client. Questa risposta viene allora deserializzata dal client in un oggetto Javascript. Nel caso di tipi complessi (vedi JavaBean) che includono riferimenti ad altri oggetti, anche tutti gli oggetti referenziati vengono serializzati all'interno della risposta. Questi oggetti possono referenziarne altri, che possono referenziarne altri ancora e così via. Se non lo si controlla, questo "grafo" di oggetti potrebbe essere potenzialmente enorme, a seconda delle relazioni esistenti tra gli oggetti stessi. E vi è l'ulteriore problema (oltre alla potenziale verbosità della risposta) che potrebbe essere desiderabile impedire che delle informazioni sensibili vengano esposte al client.
ja_jp: リモートメソッドが実行されると、 その結果はクライアントに返される XML レスポンスにシリアライズされます。 この応答は次にクライアントにより Javascript オブジェクトにアンマーシャルされます。 他のオブジェクトへの参照を含む複雑なタイプの場合 (Javabeans など)、 こうした参照されるオブジェクトもすべて応答の一部としてシリアライズされます。 これらのオブジェクトは他のオブジェクトを参照することができ、 またこの他のオブジェクトはその他のオブジェクトを参照できるといった具合になります。 チェックしないままにしておくと、 このオブジェクト「グラフ」はオブジェクト間で存在する関係によっては非常に膨大なものになる可能性があります。 派生的な問題として (応答が冗長となる問題とは別)、 クライアントに対して機密情報が公開されてしまうのを防ぎたい場合もあるかもしれません。

source: Seam Remoting provides a simple means to "constrain" the object graph, by specifying the <literal>exclude</literal> field of the remote method's <literal>@WebRemote</literal> annotation. This field accepts a String array containing one or more paths specified using dot notation. When invoking a remote method, the objects in the result's object graph that match these paths are excluded from the serialized result packet.
it_it: Seam Remoting fornisce un modo semplice per "vincolare" il grafo di oggetti: basta valorizzare il campo <literal>exclude</literal> dell'annotazione <literal>@WebRemote</literal> del metodo remoto. Questo campo accetta un array di stringhe contenenti uno o più percorsi specificati usando la notazione col punto. Quando un metodo remoto viene invocato, gli oggetti del grafo risultante il cui percorso coincide con uno di questi vengono esclusi dalla serializzazione.
ja_jp: Seam Remoting は、 リモートメソッドの <literal>@WebRemote</literal> アノテーションの <literal>exclude</literal> フィールドを指定することでそのオブジェクトグラフを「制約する」シンプルな方法を提供しています。 このフィールドはドット (「.」) 表記を使って指定されるパスまたは複数のパスを含む String 配列を受け取ります。 リモートメソッドを呼び出すと、 これらのパスと一致する結果となるオブジェクトグラフ内のオブジェクトがシリアライズされる結果パケットから除外されます。

source: For all our examples, we'll use the following <literal>Widget</literal> class:
it_it: Per tutti gli esempi utilizzeremo la seguente classe <literal>Widget</literal>:
ja_jp: すべての例で次の <literal>Widget</literal> クラスを使用します。

source: Constraining normal fields
it_it: Vincolare campi normali
ja_jp: フィールドの制約

source: If your remote method returns an instance of <literal>Widget</literal>, but you don't want to expose the <literal>secret</literal> field because it contains sensitive information, you would constrain it like this:
it_it: Se il metodo remoto restituisce un'istanza di <literal>Widget</literal>, ma non si volesse esporre il campo <literal>secret</literal> poiché contiene delle informazioni sensibili, sarebbe possibile escluderlo in questo modo:
ja_jp: リモートメソッドが <literal>Widget</literal> のインスタンスを返すけれど <literal>secret</literal> フィールドには機密情報が含まれているため公開したくない場合、 次のように制約します。

source: The value "secret" refers to the <literal>secret</literal> field of the returned object. Now, suppose that we don't care about exposing this particular field to the client. Instead, notice that the <literal>Widget</literal> value that is returned has a field <literal>child</literal> that is also a <literal>Widget</literal>. What if we want to hide the <literal>child</literal>'s <literal>secret</literal> value instead? We can do this by using dot notation to specify this field's path within the result's object graph:
it_it: Il valore "secret" si riferisce al campo <literal>secret</literal> dell'oggetto restituito. Ora, supponiamo che non ci importi di esporre questo campo particolare al client. Invece, si noti che il valore <literal>Widget</literal> che viene restituito ha un campo <literal>figlio</literal> che pure è un <literal>Widget</literal>. Cosa succede se, invece, si vuole nascondere il valore <literal>secret</literal> del <literal>figlio</literal>? Possiamo raggiungere lo scopo usando la notazione col punto per indicare il percorso di questo campo all'interno del grafo di oggetti risultante:
ja_jp: 「secret」の値は返されるオブジェクトの <literal>secret</literal> フィールドを参照します。 ここで、 クライアントに対してこの特定フィールドが公開されても構わないと仮定します。 返される <literal>Widget</literal> 値には <literal>child</literal> フィールドがあり、 これも <literal>Widget</literal> になります。 代わりに <literal>child</literal> の <literal>secret</literal> 値を隠したい場合はどうしたらよいでしょうか。 ドット表記を使用して結果となるオブジェクトグラフ内のこのフィールドのパスを指定することができます。

source: Constraining Maps and Collections
it_it: Vincolare mappe e collezioni
ja_jp: Map とコレクションの制約

source: The other place that objects can exist within an object graph are within a <literal>Map</literal> or some kind of collection (<literal>List</literal>, <literal>Set</literal>, <literal>Array</literal>, etc). Collections are easy, and are treated like any other field. For example, if our <literal>Widget</literal> contained a list of other <literal>Widget</literal>s in its <literal>widgetList</literal> field, to constrain the <literal>secret</literal> field of the <literal>Widget</literal>s in this list the annotation would look like this:
it_it: L'altro luogo dove degli oggetti possono esistere all'interno di un grafo sono oggetti di tipo <literal>Map</literal> o qualche genere di collezione (<literal>List</literal>, <literal>Set</literal>, <literal>Array</literal>, etc). Le collezioni sono semplici e trattate come qualunque altro campo. Per esempio, se <literal>Widget</literal> contenesse una lista di altri <literal>Widget</literal> nel suo campo <literal>widgetList</literal>, per escludere il campo <literal>secret</literal> dei <literal>Widget</literal> di questa lista l'annotazione avrebbe questo aspetto:
ja_jp: オブジェクトグラフ内にオブジェクトが存在できるその他の場所は <literal>Map</literal>、 あるいはなんらかの集合の種類内になります (<literal>List</literal>、 <literal>Set</literal>、 <literal>Array</literal> など)。 集合は簡単で、 その他のフィールドと同様に扱えます。 たとえば、 <literal>Widget</literal> の <literal>widgetList</literal> フィールド内に他の <literal>Widget</literal> 一覧が含まれていて、 この一覧の <literal>Widget</literal> の <literal>secret</literal> フィールドを制約している場合、 アノテーションは次のようになります。

source: To constrain a <literal>Map</literal>'s key or value, the notation is slightly different. Appending <literal>[key]</literal> after the <literal>Map</literal>'s field name will constrain the <literal>Map</literal>'s key object values, while <literal>[value]</literal> will constrain the value object values. The following example demonstrates how the values of the <literal>widgetMap</literal> field have their <literal>secret</literal> field constrained:
it_it: Per vincolare la chiave o il valore di un oggetto <literal>Map</literal>, la notazione è leggermente diversa. Aggiungere <literal>[key]</literal> dopo il nome del campo di tipo <literal>Map</literal> vincolerà il valore delle chiavi del campo di tipo <literal>Map</literal>, mentre <literal>[value]</literal> vincolerà il valore dei valori del campo di tipo <literal>Map</literal>. Gli esempi seguenti mostrano come i valori del campo <literal>widgetMap</literal> si trovino ad avere il campo <literal>secret</literal> vincolato:
ja_jp: <literal>Map</literal> のキーまたは値を制約する場合の表記は少し異なります。 <literal>Map</literal> のフィールド名の後ろに <literal>[key]</literal> を付け加えると <literal>Map</literal> のキーオブジェクト値を制約し、 <literal>[value]</literal> は値オブジェクトの値を制約します。 次の例では <literal>widgetMap</literal> フィールドの値に制約された <literal>secret</literal> フィールドを持たせる方法を示しています。

source: Constraining objects of a specific type
it_it: Vincolare oggetti di tipo specifico
ja_jp: 特定タイプのオブジェクトを制約する

source: There is one last notation that can be used to constrain the fields of a type of object no matter where in the result's object graph it appears. This notation uses either the name of the component (if the object is a Seam component) or the fully qualified class name (only if the object is not a Seam component) and is expressed using square brackets:
it_it: Vi è un'ultima notazione che può essere usata per vincolare i campi di un tipo di oggetto, indipendentemente da dove appare all'interno del grafo di oggetti restituito. Questa notazione utilizza o il nome del componente (se l'oggetto è un componente Seam) o il nome completo della classe (soltanto se l'oggetto non è un componente Seam) ed viene costruita usando le parentesi quadre:
ja_jp: 最後に、結果となるオブジェクトグラフ内のどこに出現するかに関係なくオブジェクトタイプのフィールド制約に使用できる表記について説明します。 この表記はコンポーネント名 (オブジェクトが Seam コンポーネントである場合) または完全修飾クラス名 (オブジェクトが Seam コンポーネントではない場合のみ) のいずれかを使用し角括弧を使って表現されます。

source: Combining Constraints
it_it: Combinare i vincoli
ja_jp: 制約同士を組み合わせる

source: Constraints can also be combined, to filter objects from multiple paths within the object graph:
it_it: I vincoli possono anche essere usati combinandoli, per filtrare oggetti con percorsi multipli all'interno del grafo:
ja_jp: 制約同士はオブジェクトグラフ内で複数のパスからオブジェクトをフィルタするために組み合わせることもできます。

source: Transactional Requests
it_it: Richieste transazionali

source: By default there is no active transaction during a remoting request, so if you wish to perform database updates during a remoting request, you need to annotate the <literal>@WebRemote</literal> method with <literal>@Transactional</literal>, like so:
it_it: Di default non vi è alcuna transazione attiva durante una richiesta remota, così che, se si vogliono apportare delle modifiche al database, è necessario annotare il metodo <literal>@WebRemote</literal> con <literal>@Transactional</literal>, come di seguito:

source: JMS Messaging
it_it: Messaggistica JMS
ja_jp: JMS メッセージング

source: Seam Remoting provides experimental support for JMS Messaging. This section describes the JMS support that is currently implemented, but please note that this may change in the future. It is currently not recommended that this feature is used within a production environment.
it_it: Seam Remoting fornisce supporto sperimentale per la gestione di messaggi JMS. Questa sezione descrive il tipo di supporto attualmente implementato, ma si tenga presente che esso potrà cambiare in futuro. Attualmente si raccomanda di non usare tale funzionalità in un ambiente di produzione.
ja_jp: Seam Remoting は JMS メッセージングに対して実験的にサポートを提供しています。 本セクションでは現在実装されている JMS サポートについて記載していますが、 今後、 変更される可能性があるので注意してください。 現在、 この機能を実稼働環境下で使用することは推奨されていません。

source: Before you can subscribe to a JMS topic, you must first configure a list of the topics that can be subscribed to by Seam Remoting. List the topics under <literal>org.jboss.seam.remoting.messaging.subscriptionRegistry.allowedTopics</literal> in <literal>seam.properties</literal>, <literal>web.xml</literal> or <literal>components.xml</literal>.
it_it: Prima di sottoscrivere una topic JMS, occorre configurare la lista di topic che Seam Remoting può sottoscrivere. Occorre elencare i topic nella proprietà <literal>org.jboss.seam.remoting.messaging.subscriptionRegistry.allowedTopics</literal> in <literal>seam.properties</literal>, <literal>web.xml</literal> o <literal>components.xml</literal>.
ja_jp: JMS トピックをサブスクライブする前に、 まず Seam Remoting でサブスクライブさせることができるトピック一覧を設定する必要があります。 <literal>seam.properties</literal>、 <literal>web.xml</literal> または <literal>components.xml</literal> の <literal>org.jboss.seam.remoting.messaging.subscriptionRegistry.allowedTopics</literal> 配下にあるトピックを一覧表示させます。

source: Subscribing to a JMS Topic
it_it: Sottoscrivere ad un topic JMS
ja_jp: JMS Topic のサブスクライブ

source: The following example demonstrates how to subscribe to a JMS Topic:
it_it: L'esempio seguente mostra come sottoscrivere un topic JMS:
ja_jp: 次の例では JMS Topic へのサブスクライブ方法を示しています。

source: The <literal>Seam.Remoting.subscribe()</literal> method accepts two parameters, the first being the name of the JMS Topic to subscribe to, the second being the callback function to invoke when a message is received.
it_it: Il metodo <literal>Seam.Remoting.subscribe()</literal> accetta due parametri, di cui il primo è il nome del topic JMS da sottoscrivere e il secondo la funzione di callback che deve essere invocata quando si riceve un messaggio.
ja_jp: <literal>Seam.Remoting.subscribe()</literal> メソッドは二つのパラメータを受け取ります。 一つ目はサブスクライブする JMS Topic 名になり、 二つ目はメッセージが受け取られると呼び出すコールバック機能になります。

source: There are two types of messages supported, Text messages and Object messages. If you need to test for the type of message that is passed to your callback function you can use the <literal>instanceof</literal> operator to test whether the message is a <literal>Seam.Remoting.TextMessage</literal> or <literal>Seam.Remoting.ObjectMessage</literal>. A <literal>TextMessage</literal> contains the text value in its <literal>text</literal> field (or alternatively call <literal>getText()</literal> on it), while an <literal>ObjectMessage</literal> contains its object value in its <literal>value</literal> field (or call its <literal>getValue()</literal> method).
it_it: Due sono i tipi di messaggi supportati, messaggi testuali e messaggi oggetto. Per verificare il tipo di messaggio passato alla callback è possibile usare l'operatore <literal>instanceof</literal> per vedere se il messaggio sia un <literal>Seam.Remoting.TextMessage</literal> o un <literal>Seam.Remoting.ObjectMessage</literal>. Un <literal>TextMessage</literal> contiene il valore testuale nel campo <literal>text</literal> (si può anche fare una chiamata al metodo <literal>getText()</literal>), mentre un <literal>ObjectMessage</literal> contiene il valore oggetto nel campo <literal>value</literal> (si può anche fare una chiamata al metodo <literal>getValue()</literal>).
ja_jp: サポートされているメッセージは二種類で、 テキストメッセージとオブジェクトメッセージです。 コールバック機能に渡されるメッセージタイプのテストを必要とする場合は、 <literal>instanceof</literal> 演算子を使ってメッセージが <literal>Seam.Remoting.TextMessage</literal> なのか <literal>Seam.Remoting.ObjectMessage</literal> であるのかをテストすることができます。 <literal>TextMessage</literal> はその <literal>text</literal> フィールドにテキスト値を含み (または代わりに <literal>getText()</literal> を呼び出す)、 <literal>ObjectMessage</literal> はその <literal>value</literal> フィールドにオブジェクト値を含みます (またはその <literal>getValue()</literal> メソッドを呼び出す)。

source: Unsubscribing from a Topic
it_it: Disiscriversi da un topic
ja_jp: トピックのサブスクライブを中止する

source: To unsubscribe from a topic, call <literal>Seam.Remoting.unsubscribe()</literal> and pass in the topic name:
it_it: Per annullare la sottoscrizione ad un topic, bisogna fare una chiamata a <literal>Seam.Remoting.unsubscribe()</literal> passando il nome del topic come parametro:
ja_jp: トピックのサブスクライブを中止するには、 <literal>Seam.Remoting.unsubscribe()</literal> を呼び出してトピック名で渡します。

source: Tuning the Polling Process
it_it: Fare il tuning del processo di polling
ja_jp: ポーリングのプロセスの調整

source: There are two parameters which you can modify to control how polling occurs. The first one is <literal>Seam.Remoting.pollInterval</literal>, which controls how long to wait between subsequent polls for new messages. This parameter is expressed in seconds, and its default setting is 10.
it_it: E' possibile controllare il polling dei messaggi attraverso due parametri. Il primo è <literal>Seam.Remoting.pollInterval</literal>, che controlla quanto tempo passa tra due polling successivi per verificare l'arrivo di nuovi messaggi. Tale parametro è espresso in secondi, e il suo valore predefinito è 10.
ja_jp: ポーリングの発生方法を制御するために変更できるパラメータが二つあります。 一つ目は <literal>Seam.Remoting.pollInterval</literal> で、 新しいメッセージに対して後続ポールが発生する間隔を制御します。 秒単位で表現します、 デフォルト設定は 10 になります。

source: The second parameter is <literal>Seam.Remoting.pollTimeout</literal>, and is also expressed as seconds. It controls how long a request to the server should wait for a new message before timing out and sending an empty response. Its default is 0 seconds, which means that when the server is polled, if there are no messages ready for delivery then an empty response will be immediately returned.
it_it: Il secondo parametro è <literal>Seam.Remoting.pollTimeout</literal>, che pure è espresso in secondi. Controlla per quanto tempo una richiesta al server debba stare in attesa di un nuovo messaggio prima di andare in time out e inviare una risposta vuota. Il valore predefinito è 0: ciò significa che quando il server viene interrogato, se non ci sono nuovi messaggi pronti alla consegna, allora viene immediatamente restituita una risposta vuota.
ja_jp: 二つ目のパラメータは <literal>Seam.Remoting.pollTimeout</literal> で、 このパラメータも秒単位で表現されます。 サーバへの要求がタイムアウトして空白の応答を送信するまでの新しいメッセージを待機する長さを制御します。 デフォルトは 0秒で、 サーバがポールされると配信できるメッセージがない場合は空白の応答が直ちに返されます。

source: Caution should be used when setting a high <literal>pollTimeout</literal> value; each request that has to wait for a message means that a server thread is tied up until a message is received, or until the request times out. If many such requests are being served simultaneously, it could mean a large number of threads become tied up because of this reason.
it_it: Occorre essere molto cauti nell'impostare un valore alto di <literal>pollTimeout</literal>; ogni richiesta in attesa di un messaggio tiene un thread attivo finché non viene ricevuto un messaggio o finché la richiesta non va in time out. Se molte di queste richieste devono essere gestite contemporaneamente, si potrebbero avere molti thread in attesa.
ja_jp: <literal>pollTimeout</literal> 値を高く設定する場合は注意が必要です。 各リクエストがメッセージを待機する必要があるということは、 メッセージが受信されるまでまたはその要求がタイムアウトするまでサーバスレッドが固定されるということになります。 こうした要求が同時に多数発生すると、 大量のスレッドが固定される結果になります。

source: It is recommended that you set these options via components.xml, however they can be overridden via Javascript if desired. The following example demonstrates how to configure the polling to occur much more aggressively. You should set these parameters to suitable values for your application:
it_it: Si raccomanda si impostare queste opzioni in components.xml, anche se possono essere sovrascritte dal codice Javascript. L'esempio seguente mostra come configurare il polling in modo da renderlo molto aggressivo. Dovreste impostare questi parametri a dei valori adatti alla vostra applicazione:
ja_jp: これらのオプションは components.xml 経由で設定することを推奨しますが、 必要に応じて Javascript で上書きすることができます。 次の例ではポーリングがかなりアグレッシブに発生するよう設定する方法を示しています。 これらのパラメータはご使用のアプリケーションに適切な値を設定してください。

source: // Only wait 1 second between receiving a poll response and sending the next poll request. Seam.Remoting.pollInterval = 1; // Wait up to 5 seconds on the server for new messages Seam.Remoting.pollTimeout = 5;
it_it: // Attendere 1 secondo tra la ricezione della risposta del pool e l'invio della successiva richiesta di pool. Seam.Remoting.pollInterval = 1; // Attendere fino a 5 secondi sul server per nuovi messaggi Seam.Remoting.pollTimeout = 5;

source: Remoting
ja_jp: リモーティング

source: String
ja_jp: String 型

source: Number
ja_jp: Number 型

source: Boolean
ja_jp: Boolean 型

source: Enums
ja_jp: Enum

source: Collections
ja_jp: 集合

source: Bags
ja_jp: Bag

source: Maps
ja_jp: Map

source: Debugging
ja_jp: デバッグ機能

source: Via components.xml:
ja_jp: components.xml:

source: Via JavaScript:
ja_jp: JavaScript:
