Repository: PatientOrderSets/jboss-seam-2.3.0.Final-Hibernate.3
Catalog: seam-reference-guide/src/docbook/*/Testing.po
Languages: it_it

source: Testing Seam applications
it_it: Test delle applicazioni Seam

source: Most Seam applications will need at least two kinds of automated tests: <emphasis>unit tests</emphasis>, which test a particular Seam component in isolation, and scripted <emphasis>integration tests</emphasis> which exercise all Java layers of the application (that is, everything except the view pages).
it_it: La maggior parte delle applicazioni Seam ha bisogno di almeno due tipi di test automatici: <emphasis>test di unità</emphasis> per testare un particolare componente Seam in isolamento, e <emphasis>test d'integrazione</emphasis> per provare tutti i layer java dell'applicazione (cioè tutto, tranne le pagine di vista).

source: Both kinds of tests are very easy to write.
it_it: Entrambi i tipi di test sono facili da scrivere.

source: Unit testing Seam components
it_it: Test d'unità dei componenti Seam

source: All Seam components are POJOs. This is a great place to start if you want easy unit testing. And since Seam emphasises the use of bijection for inter-component interactions and access to contextual objects, it's very easy to test a Seam component outside of its normal runtime environment.
it_it: Tutti i componenti Seam sono POJO. Questo è un buon punto per partire se si vogliono eseguire dei facili test di unità. E poiché Seam enfatizza l'uso della bijection per le interazioni tra componenti e l'accesso ad oggetti contestuali, è molto facile testare un componente Seam fuori dal suo normale ambiente di runtime.

source: Consider the following Seam Component which creates a statement of account for a customer:
it_it: Si consideri il seguente componente Seam che crea una dichiarazione di account per un cliente:

source: We could write a unit test for the calculateTotal method (which tests the business logic of the component) as follows:
it_it: Si può scrivere un test d'unità per il metodo calculateTotal (che testa la business logic del componente) come segue:

source: You'll notice we aren't testing retrieving data from or persisting data to the database; nor are we testing any functionality provided by Seam. We are just testing the logic of our POJOs. Seam components don't usually depend directly upon container infrastructure, so most unit testing are as easy as that!
it_it: Si vede che non si sta testando il recupero dei dati e la persistenza dei dati da/a database; e neppure si testa alcuna funzionalità fornita da Seam. Si sta solamente testanto la logica del POJO. I componenti Seam solitamente non dipendono direttamente dall'infrastruttura del container, e quindi la maggior parte dei test d'unità sono facili come quello mostrato!

source: However, if you want to test the entire application, read on.
it_it: Comunque se si vuole testare l'intera applicazione, si consiglia di continuare nella lettura.

source: Integration testing Seam components
it_it: Test d'integrazione dei componenti Seam

source: Integration testing is slightly more difficult. In this case, we can't eliminate the container infrastructure; indeed, that is part of what is being tested! At the same time, we don't want to be forced to deploy our application to an application server to run the automated tests. We need to be able to reproduce just enough of the container infrastructure inside our testing environment to be able to exercise the whole application, without hurting performance too much.
it_it: Il test d'integrazione è leggermente più difficile. In questo caso non si può eliminare l'infrastruttura del container che invece fa parte di ciò che va testato! Allo stesso tempo non si vuole essere forzati ad eseguire un deploy dell'applicazione in un application server per fare girare i test. Occorre essere in grado di riprodurre l'infrastruttura essenziale del container dentro l'ambiente di test per poter provare l'intera applicazione senza nuocere troppo alle performance.

source: The approach taken by Seam is to let you write tests that exercise your components while running inside a pruned down container environment (Seam, together with the JBoss Embedded container; see <xref linkend="config.install.embedded"/> for configuration details)
it_it: L'approccio adottato da Seam è quello di consentire di scrivere test che possano provare i componenti mentre girano dentro un ambiente di container ridotto (Seam assieme al container JBoss Embedded; vedere <xref linkend="config.install.embedded"/> per i dettagli di configurazione)

source: Using mocks in integration tests
it_it: Uso dei mock nei test d'intergrazione

source: Occasionally, we need to be able to replace the implementation of some Seam component that depends upon resources which are not available in the integration test environment. For example, suppose we have some Seam component which is a facade to some payment processing system:
it_it: Occasionalmente occorre essere in grado di sostituire l'implementazione di alcuni componenti Seam che dipendono da risorse non disponibili in ambiente di test. Per esempio, si supponga di avere dei componenti Seam che sono una façade di un qualche sistema di elaborazione pagamenti:

source: For integration tests, we can mock out this component as follows:
it_it: Per i test di integrazione è possibile creare un mock di un componente come segue:

source: Since the <literal>MOCK</literal> precedence is higher than the default precedence of application components, Seam will install the mock implementation whenever it is in the classpath. When deployed into production, the mock implementation is absent, so the real component will be installed.
it_it: Poiché la precedenza <literal>MOCK</literal> è più elevata della precedenza di default dei componenti di applicazione, Seam installerà l'implementazione mock quando questa è nel classpath. Con un deploy in produzione, l'implementazione mock è assente, e quindi il componente reale verrà installato.

source: Integration testing Seam application user interactions
it_it: Test d'integrazione delle interazioni utente in applicazioni Seam

source: An even harder problem is emulating user interactions. A third problem is where to put our assertions. Some test frameworks let us test the whole application by reproducing user interactions with the web browser. These frameworks have their place, but they are not appropriate for use at development time.
it_it: Un problema ancora più difficile è quello di emulare le interazioni utente. Un terzo problema si verifica quando vengono messe le asserzioni. Alcuni framewrok di test consentono di testare un'intera applicazione riproducendo le interazioni utente con il browser. Questi framework hanno un loro spazio d'uso, ma non sono adatti per l'uso in fase di sviluppo.

source: <literal>SeamTest</literal> lets you write <emphasis>scripted</emphasis> tests, in a simulated JSF environment. The role of a scripted test is to reproduce the interaction between the view and the Seam components. In other words, you get to pretend you are the JSF implementation!
it_it: <literal>SeamTest</literal> consente di scrivere test <emphasis>sotto forma di script (scripted)</emphasis>, in un ambiente JSF simulato. Il ruolo di un test scripted è quello di riprodurre l'interazione tra la vista ed i componenti Seam. In altre parole si pretende di essere l'implementazione JSF!

source: This approach tests everything except the view.
it_it: Questo approccio testa ogni cosa tranne la vista.

source: Let's consider a JSP view for the component we unit tested above:
it_it: Si consideri una vista JSP per il componente testato come unità visto sopra:

source: We want to test the registration functionality of our application (the stuff that happens when the user clicks the Register button). We'll reproduce the JSF request lifecycle in an automated TestNG test:
it_it: Si vuole testare la funzionalità di registrazione dell'applicazione (la cosa che succede quando l'utente clicca il pulsante Registra). Si riprodurrà il ciclo di vita della richiesta JSF in un test TestNG automatizzato:

source: Notice that we've extended <literal>SeamTest</literal>, which provides a Seam environment for our components, and written our test script as an anonymous class that extends <literal>SeamTest.FacesRequest</literal>, which provides an emulated JSF request lifecycle. (There is also a <literal>SeamTest.NonFacesRequest</literal> for testing GET requests.) We've written our code in methods which are named for the various JSF phases, to emulate the calls that JSF would make to our components. Then we've thrown in various assertions.
it_it: Si noti che si è esteso <literal>SeamTest</literal>, il quale fornisce un ambiente Seam ai componenti, e si è scritto uno script di test come classe anonima che estende <literal>SeamTest.FacesRequest</literal>, la quale fornisce un ciclo di vita emulato della richiesta JSF. (C'è anche <literal>SeamTest.NonFacesRequest</literal> per testare le richieste GET). Si è scritto codice in metodi che vengono chiamati in varie fasi JSF, per emulare le chiamate che JSF farebbe ai componenti. Infine sono state scritte le asserzioni.

source: You'll find plenty of integration tests for the Seam example applications which demonstrate more complex cases. There are instructions for running these tests using Ant, or using the TestNG plugin for eclipse:
it_it: Nelle applicazioni d'esempio di Seam ci sono molti test d'integrazione che mostrano casi ancora più complicati. Ci sono istruzioni per eseguire questi test usando Ant o usando il plugin TestNG per Eclipse:

source: Configuration
it_it: Configurazione

source: If you used seam-gen to create your project you are ready to start writing tests. Otherwise you'll need to setup the testing environment in your favorite build tool (e.g. ant, maven, eclipse).
it_it: Se è stato usato seam-gen per creare il progetto si è già pronti per scrivere test. Altrimenti occorre configurare l'ambiente di test all'interno del proprio tool di build (es. ant, maven, eclipse).

source: First, lets look at the dependencies you need at a minimum:
it_it: Prima si guardi alle dipendenze necessarie:

source: Location in Seam
it_it: Locazione in Seam

source: It's very important you don't put the compile time JBoss AS dependencies from <literal>lib/</literal> (e.g. <literal>jboss-system.jar</literal>) on the classpath, these will cause Embedded JBoss to not boot. So, just add the dependencies (e.g. Drools, jBPM)you need as you go.
it_it: E' molto importante non inserire nel classpath le dipendenze di JBoss AS a compile time da <literal>lib/</literal> (es. <literal>jboss-system.jar</literal>), altrimenti questo causerà il non avvio di JBoss Embedded. Quindi si aggiungano solo le dipendenze necessarie per partire (es. Drools, jBPM).

source: You also need to include the <literal>bootstrap/</literal> directory on the classpath; <literal>bootstrap/</literal> contains the configuration for Embedded JBoss.
it_it: Occorre includere nel classpath la directory <literal>bootstrap/</literal> che contiene la configurazione per JBoss Embedded.

source: And, of course you need to put your built project and tests onto the classpath as well as jar for your test framework. Don't forget to put all the correct configuration files for JPA and Seam onto the classpath as well.Seam asks Embedded JBoss to deploy any resource (jar or directory) which has <literal>seam.properties</literal> in it's root. Therefore, if you don't assemble a directory structure that resembles a deployable archive containing your built project, you must put a <literal>seam.properties</literal> in each resource.
it_it: E sicuramente occorre mettere nel classpath il progetto ed i test così come i jar del framework di test. Non si dimentichi di mettere nel classpath anche tutti i file di configurazione corretti per JPA e Seam. Seam chiede a JBoss Embedded di deployare le risorse (jar o directory) che hanno <literal>seam.properties</literal> nella root. Quindi se non si assembla una struttura di directory che assomiglia ad un archivio deployabile contenente il progetto, occorre mettere <literal>seam.properties</literal> in ciascuna risorsa.

source: By default, a generated project will use the <literal>java:/DefaultDS</literal> (a built in HSQL datasource in Embedded JBoss) for testing. If you want to use another datasource place the <literal>foo-ds.xml</literal> into <literal>bootstrap/deploy</literal> directory.
it_it: Di default un progetto generato userà per i test <literal>java:/DefaultDS</literal> (un datasource predefinito HSQL in JBoss Embedded). Se si vuole usare un altro datasource, si metta <literal>foo-ds.xml</literal> nella directory <literal>bootstrap/deploy</literal>.

source: Using SeamTest with another test framework
it_it: Uso di SeamTest con un altro framework di test

source: Seam provides TestNG support out of the box, but you can also use another test framework, such as JUnit, if you want.
it_it: Seam include il supporto TestNG, ma è possibile usare un qualsivoglia altro framework di test quale JUnit.

source: You'll need to provide an implementation of <literal>AbstractSeamTest</literal> which does the following:
it_it: Occorre fornire un'implementazione di <literal>AbstractSeamTest</literal> che faccia le seguenti cose:

source: Calls <literal>super.begin()</literal> before every test method.
it_it: Chiami <literal>super.begin()</literal> prima di ciascun test.

source: Calls <literal>super.end()</literal> after every test method.
it_it: Chiami <literal>super.end()</literal> dopo ciascun metodo di test.

source: Calls <literal>super.setupClass()</literal> to setup integration test environment. This should be called before any test methods are called.
it_it: Chiami <literal>super.setupClass()</literal> per configurare l'ambiente di test d'integrazione. Questo deve essere chiamato prima dei metodi di test.

source: Calls <literal>super.cleanupClass()</literal> to clean up the integration test environment.
it_it: Chiami <literal>super.cleanupClass()</literal> per pulire l'ambiente di test d'integrazione.

source: Calls <literal>super.startSeam()</literal> to start Seam at the start of integration testing.
it_it: Chiami <literal>super.startSeam()</literal> per avviare Seam all'avvio dei test.

source: Calls <literal>super.stopSeam()</literal> to cleanly shut down Seam at the end of integration testing.
it_it: Chiami <literal>super.stopSeam()</literal> per terminare in modo corretto Seam alla fine dei test.

source: Integration Testing with Mock Data
it_it: Test d'integrazione con Dati Mock

source: If you want to insert or clean data in your database before each test you can use Seam's integration with DBUnit. To do this, extend <literal>DBUnitSeamTest</literal> rather than <literal>SeamTest</literal>.
it_it: Se si vuole inserire o pulire i dati nel database prima di ogni test, si può usare l'integrazione di Seam con DBUnit. Per fare questo si estenda <literal>DBUnitSeamTest</literal> piuttosto che SeamTest.

source: You have to provide a dataset for DBUnit.
it_it: Occorre fornire un dataset per DBUnit.

source: DBUnit supports two formats for dataset files, flat and XML. Seam's <literal>DBUnitSeamTest</literal> assumes the flat format is used, so make sure that your dataset is in this format.
it_it: DBUnit supporta due formati per i file di dataset, flat e XML. <literal>DBUnitSeamTest</literal> di Seam assume che venga usato il formato flat, e quindi occorre accertarsi che il dataset sia in questo formato.

source: In your test class, configure your dataset with overriding <literal>prepareDBUnitOperations()</literal>:
it_it: Nella classe di test configurare il dataset con l'override di <literal>prepareDBUnitOperations()</literal>:

source: <literal>DataSetOperation</literal> defaults to <literal>DatabaseOperation.CLEAN_INSERT</literal> if no other operation is specified as a constructor argument. The above example cleans all tables defined <literal>BaseData.xml</literal>, then inserts all rows declared in <literal>BaseData.xml</literal> before each <literal>@Test</literal> method is invoked.
it_it: <literal>DataSetOperation</literal> è impostato di default a <literal>DatabaseOperation.CLEAN_INSERT</literal> se non viene specificata qualche altra operazione come argomento del costruttore. L'esempio di cui sopra pulisce tutte le tabelle definite in <literal>BaseData.xml</literal> e quindi inserisce tutte le righe dichiarate in <literal>BaseData.xml</literal> prima che venga invocato ogni metodo <literal>@Test</literal>.

source: If you require extra cleanup after a test method executes, add operations to <literal>afterTestOperations</literal> list.
it_it: Se viene richiesta un'ulteriore pulizia prima dell'esecuzione di un metodo di test, si aggiungano operazioni alla lista <literal>afterTestOperations</literal>.

source: You need to tell DBUnit about the datasource you are using by setting a TestNG test parameter named <literal>datasourceJndiName</literal>:
it_it: Occorre informare DBUnit del datasource usato impostando il parametro TestNG chiamato <literal>datasourceJndiName</literal>:

source: DBUnitSeamTest has support for MySQL and HSQL - you need to tell it which database is being used, otherwise it defaults to HSQL:
it_it: DBUnitSeamTest supporta MySQL e HSQL- occorre dire quale database viene usato, altrimenti il default è HSQL:

source: It also allows you to insert binary data into the test data set (n.b. this is untested on Windows). You need to tell it where to locate these resources on your classpath:
it_it: Questo consente anche di inserire dati binari nel set dei dati di test (N.B. non è stato testato sotto Windows). Occorre dire dove si trovano queste risorse nel classpath:

source: You do not have to configure any of these parameters if you use HSQL and have no binary imports. However, unless you specify <literal>datasourceJndiName</literal> in your test configuration, you will have to call <literal>setDatabaseJndiName()</literal> before your test runs. If you are not using HSQL or MySQL, you need to override some methods. See the Javadoc of <literal>DBUnitSeamTest</literal> for more details.
it_it: Non occorre configurare alcun parametro se si usa HSQL e non si hanno import binari. Comunque, amenoché si specifichi <literal>datasourceJndiName</literal> nella configurazione del test, occorre chiamare <literal>setDatabaseJndiName()</literal> prima di eseguire il test. Se non si usa HSQL o MySQL, occorre fare override di qualche metodo. Si veda Javadoc di <literal>DBUnitSeamTest</literal> per i dettagli.

source: Integration Testing Seam Mail
it_it: Test d'integrazione di Seam Mail

source: Warning! This feature is still under development.
it_it: Attenzione! Questa funzionalità è ancora in fase di sviluppo.

source: It's very easy to integration test your Seam Mail:
it_it: E' facilissimo eseguire il test d'integrazione con Seam Mail:

source: We create a new <literal>FacesRequest</literal> as normal. Inside the invokeApplication hook we render the message using <literal>getRenderedMailMessage(viewId);</literal>, passing the viewId of the message to render. The method returns the rendered message on which you can do your tests. You can of course also use any of the standard JSF lifecycle methods.
it_it: Viene creata una nuova <literal>FacesRequest</literal> come normale. Dentro la sezione invokeApplication mostriamo il messaggio usando <literal>getRenderedMailMessage(viewId);</literal>, passando il viewId del messaggio da generare. Il metodo restituisce il messaggio sul quale è possibile fare i test. Si può anche usare ogni altro metodo standard del ciclo di vita JSF.

source: There is no support for rendering standard JSF components so you can't test the content body of the mail message easily.
it_it: Non c'è alcun supporto per il rendering dei componenti JSF standard, così non è possibile testare facilmente il corpo dei messaggi email.
